<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<h4>Oracle&reg; GlassFish Server 3.1.2</h4>
<p><a name="BEGIN" id="BEGIN"></a></p>
<p>Ayuda en Pantalla Web</p>
<p></p>
<p>E27845-01</p>
<p>Diciembre de 2011</p>
<p>Este documento proporciona los temas de referencia y de la ayuda en pantalla de tareas para el m&oacute;dulo web de Servidor GlassFish Consola de Administraci&oacute;n.</p>
<p><a id="sthref1" name="sthref1"></a></p>
<hr />
<p>Ayuda en Pantalla Web de Oracle GlassFish Server 3.1.2</p>
<p>E27845-01</p>
<p>Copyright &copy; 2011,&nbsp;Oracle and/or its affiliates. All rights reserved.</p>
<p>Este software y la documentaci&oacute;n relacionada se proporcionan con un acuerdo de licencia que contiene restricciones sobre el uso y la divulgaci&oacute;n, y est&aacute;n protegidos por las leyes de propiedad intelectual. A menos que figure expl&iacute;citamente en el contrato de licencia o est&eacute; permitido por la ley, no se podr&aacute; utilizar, copiar, reproducir, traducir, emitir, modificar, conceder licencias, transmitir, distribuir, exhibir, representar, publicar ni mostrar ninguna parte, de ninguna forma, por ning&uacute;n medio. Queda prohibida la ingenier&iacute;a inversa, desensamblaje o descompilaci&oacute;n de este software, excepto en la medida en que sean necesarios para conseguir interoperabilidad seg&uacute;n lo especificado por la legislaci&oacute;n aplicable.</p>
<p>La informaci&oacute;n contenida en este documento puede someterse a modificaciones sin previo aviso y no se garantiza que se encuentre exenta de errores. Si detecta cualquier problema en la documentaci&oacute;n, le agradeceremos nos lo comunique por escrito.</p>
<p>Si este software y documentaci&oacute;n se entrega al Gobierno de EE. UU. o a cualquier entidad que adquiera licencias de software o utilice software en nombre del Gobierno de EE. UU., se aplicar&aacute; la siguiente advertencia:</p>
<p>U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are "commercial computer software" or "commercial technical data" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065.</p>
<p>Los Programas o hardware no est&aacute;n dise&ntilde;ados para su uso en cualesquiera aplicaciones nucleares, de aviaci&oacute;n, tr&aacute;nsito de masas, m&eacute;dicas u otras de riesgo inherente. No se ha dise&ntilde;ado ni est&aacute; destinado para utilizarse en aplicaciones de riesgo inherente, incluidas las aplicaciones que pueden causar da&ntilde;os personales. Si utiliza este software o hardware en aplicaciones de riesgo, usted ser&aacute; responsable de tomar todas las medidas apropiadas de prevenci&oacute;n de fallos, copia de seguridad, redundancia o de cualquier otro tipo para garantizar la seguridad en el uso de este software o hardware. Oracle no asumir&aacute; responsabilidad alguna por cualesquiera da&ntilde;os que pudieran ser ocasionados por dicho uso de los Programas o hardware.</p>
<p>Oracle y Java son marcas comerciales registradas de Oracle y/o sus filiales. Todos los dem&aacute;s nombres pueden ser marcas comerciales de sus respectivos propietarios.</p>
<p>Intel e Intel Xeon son marcas comerciales o marcas comerciales registradas de Intel Corporation. Todas las marcas comerciales de SPARC se utilizan bajo licencia y son marcas comerciales o marcas comerciales registradas de SPARC International, Inc. AMD, Opteron, el logotipo de AMD y el logotipo de AMD Opteron son marcas comerciales o marcas comerciales registradas de Advanced Micro Devices. UNIX es una marca comercial registrada de The Open Group.</p>
<p>Este software o hardware y la documentaci&oacute;n pueden ofrecer acceso a contenidos, productos o servicios de terceros o informaci&oacute;n sobre los mismos. Ni Oracle Corporation ni sus filiales ser&aacute;n responsables de ofrecer cualquier tipo de garant&iacute;a sobre el contenido, los productos o los servicios de terceros y renuncian expl&iacute;citamente a ello. Oracle Corporation y sus filiales no se har&aacute;n responsables de las p&eacute;rdidas, los costos o los da&ntilde;os en los que se incurra como consecuencia del acceso o el uso de contenidos, productos o servicios de terceros.</p>
<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
