<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-webcontaineravailability"></a><h4>Disponibilidad de contenedor Web</h4>
<a name="indexterm-39"></a><a name="indexterm-40"></a><p>Utilice la p&#225;gina Disponibilidad de contenedor Web para configurar las opciones de
disponibilidad de contenedor web.</p>

<p>La p&#225;gina Disponibilidad de contenedor Web contiene las siguientes opciones.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer las opciones que tienen valores por defecto a estos. Las opciones que no tienen valores por defecto no se modifican.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>El nombre de la configuraci&#243;n a la que aplicar los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Servicio de disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitada, se ha habilitado la disponibilidad para el contenedor web.</p>

</dd>
<dt>Tipo de persistencia</dt>
<dd><p>El mecanismo de persistencia utilizado.</p>


<ul><li><p>Si el Servicio de disponibilidad Habilitado <b>no</b> est&#225; activado, seleccione una de las siguientes opciones:</p>


<ul><li><p><tt>memory</tt> para ninguna persistencia de sesi&#243;n</p>

</li>
<li><p><tt>file</tt> para la persistencia de sesi&#243;n en funci&#243;n del sistema de archivos que no es de alta disponibilidad</p>

</li></ul>
</li>
<li><p>Si el Servicio de disponibilidad Habilitado est&#225; activado, seleccione <tt>replicated </tt> para la persistencia de sesi&#243;n en funci&#243;n de la conmutaci&#243;n por error del cl&#250;ster que es de alta disponibilidad.</p>

</li></ul>
</dd>
<dt>Frecuencia de persistencia</dt>
<dd><p>La frecuencia con la que se almacena la sesi&#243;n HTTP:</p>


<ul><li><p><tt>web-method</tt> &#8212; El estado de la sesi&#243;n se almacena al final de cada solicitud web antes de enviar una respuesta al cliente. Este modo ofrece la mejor garant&#237;a de que el estado de la sesi&#243;n se actualizar&#225; completamente en caso de fallo. &#201;ste es el valor predeterminado.</p>

</li></ul>
</dd>
<dt>&#193;mbito de persistencia</dt>
<dd><p>El &#225;mbito de los cambios de la sesi&#243;n HTTP necesarios para que se realice el almacenamiento:</p>


<ul><li><p><tt>session</tt> &#8212; Se almacena cada vez el estado de la sesi&#243;n completo. Este modo ofrece la mejor garant&#237;a de que sus datos de sesi&#243;n se almacenan correctamente para las aplicaciones web distribuibles.</p>

</li>
<li><p><tt>modified-session</tt> &#8212; El estado de la sesi&#243;n completo se almacena si se ha modificado. Se considera que se ha modificado una sesi&#243;n si se ha realizado una llamada a <tt>HttpSession.setAttribute()</tt> o <tt>HttpSession.removeAttribute()</tt>. Debe garantizar que se llama a <tt> setAttribute()</tt> cada vez que se cambia un atributo. Esto no es un requisito de especificaci&#243;n de Java EE, pero es necesario para que este modo funcione correctamente.</p>

</li>
<li><p><tt>modified-attribute</tt> &#8212; S&#243;lo se almacenan los atributos de sesi&#243;n modificados. Para que este modo funcione correctamente, debe seguir estas directrices:</p>


<ul><li><p>Llame a <tt>setAttribute</tt> cada vez que se modifique el estado de la sesi&#243;n.</p>

</li>
<li><p>Aseg&#250;rese de que no existen referencias cruzadas entre atributos. El gr&#225;fico de objetos debajo de cada clave de atributo distinto se serializa y almacena por separado. Si hay referencias cruzadas de objetos entre los objetos de cada clave diferente, no est&#225;n serializados ni deserializados correctamente.</p>

</li>
<li><p>Distribuya el estado de la sesi&#243;n en varios atributos o por lo menos entre un atributo de s&#243;lo lectura y uno modificable.</p>

</li></ul>
</li></ul>
</dd>
<dt>Estado de inicio de sesi&#243;n &#250;nico</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, el estado de inicio de sesi&#243;n &#250;nico estar&#225; disponible para la conmutaci&#243;n por error.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales de la Disponibilidad de contenedor web.</p>

<p>Servidor GlassFish no define propiedades adicionales para la disponibilidad de contenedor web.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-webcontainergeneral.html">C&#243;mo configurar propiedades generales para el contenedor web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">C&#243;mo configurar propiedades generales para el contenedor web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">C&#243;mo configurar propiedades de administrador para el contenedor web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">C&#243;mo configurar propiedades de almacenamiento para el contenedor web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">C&#243;mo configurar  las opciones de disponibilidad para el contenedor web</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
