<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-networklisteneredit"></a><h4>Editar escucha de red</h4>
<a name="indexterm-66"></a><p>Utilice la p&#225;gina Editar escucha de red para modificar una escucha de
red existente.</p>

<p>Cuando se edita una escucha de red, tambi&#233;n estar&#225;n disponibles las fichas
SSL, HTTP y Cach&#233; de archivos del protocolo asociado para que sea
posible editarlas. </p>

<p>La p&#225;gina Editar escucha de red contiene las siguientes opciones.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer las opciones que tienen valores por defecto a estos. Las opciones que no tienen valores por defecto no se modifican.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>El nombre de la configuraci&#243;n a la que aplicar los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Nombre</dt>
<dd><p>El nombre &#250;nico de la escucha. El campo Nombre es un campo de s&#243;lo lectura. &#218;nicamente puede especificar el nombre al crear una nueva escucha de red.</p>

</dd>
<dt>Protocolo</dt>
<dd><p>El protocolo asociado a la escucha de red. El campo Protocolo es un campo de s&#243;lo lectura. Puede crear o especificar un protocolo &#250;nicamente al crear una nueva escucha de red. </p>

</dd>
<dt>Estado</dt>
<dd><p>El estado de la escucha de red. La escucha puede habilitarse o deshabilitarse. Esta opci&#243;n se habilita por defecto. Si la escucha se encuentra deshabilitada, cualquier intento de establecer una conexi&#243;n con ella tiene como resultado una excepci&#243;n de socket (<tt>java.net.ConnectException</tt>). </p>

<p>En las versiones anteriores a la 9.1 de Servidor GlassFish, una escucha cuyo atributo habilitado se hubiera definido como false devolv&#237;a un c&#243;digo de respuesta 404 para cualquier solicitud que se le enviaba. Para lograr este comportamiento en la versi&#243;n actual de Servidor GlassFish, establezca el estado de la escucha en habilitado y defina cada estado de servidor virtual asociado como desactivado. Un servidor virtual incluye sus escuchas asociadas en la lista desplegable Escuchas de red. </p>

</dd>
<dt>Security</dt>
<dd><p>Si se selecciona esta opci&#243;n, se habilita para el protocolo utilizado por la escucha de red. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Escucha JK</dt>
<dd><p>Si se encuentra seleccionada esta opci&#243;n, la escucha admite el protocolo <tt>mod-jk</tt> de Apache. El protocolo <tt>mod-jk</tt> es un protocolo de red/comunicaci&#243;n de propiedad entre <tt>httpd</tt> de Apache (servidor web) y una instancia back-end de Servidor GlassFish. Si la escucha admite este protocolo, se supone que <tt>httpd</tt> maneja todo el contenido est&#225;tico, mientras que cualquier solicitud de recursos din&#225;micos (es decir, servlets y JSP) se direccionan a la escucha de red con el protocolo <tt>mod jk</tt> habilitado de Servidor GlassFish a trav&#233;s del protocolo  <tt>mod-jk</tt>. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Puerto</dt>
<dd><p>El n&#250;mero de puerto en el que se efectuar&#225; la escucha. Los valores v&#225;lidos se encuentran entre 1 y 65535. En un sistema UNIX, la creaci&#243;n de sockets de escucha para puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt>Direcci&#243;n</dt>
<dd><p>La direcci&#243;n IP en la que efectuar&#225; la escucha de red. La direcci&#243;n se puede especificar en par punteado o notaci&#243;n IPv6. Puede ser <tt>cualquiera</tt> (para <tt>INADDR_ANY</tt>) para recibir escuchas en todas las direcciones IP. Puede ser un nombre de host. </p>

</dd>
<dt>Conjunto de subprocesos</dt>
<dd><p>El conjunto de subprocesos asociado a la escucha de red.</p>

</dd>
<dt>Transporte</dt>
<dd><p>El tipo de transporte de la escucha de red. De forma predeterminada, el &#250;nico transporte es <tt>tcp</tt>. </p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-networklistenernew.html">C&#243;mo crear una escucha de red</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">C&#243;mo editar la escucha de red</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">C&#243;mo eliminar una escucha de red</a></p>

</li>
<li><p><a href="task-protocolnew.html">C&#243;mo crear un protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">C&#243;mo editar un protocolo</a></p>

</li>
<li><p><a href="task-protocolssledit.html">C&#243;mo editar la configuraci&#243;n SSL para un protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">C&#243;mo editar la configuraci&#243;n HTTP para un protocolo</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">C&#243;mo editar la cach&#233; de archivos para un protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">C&#243;mo eliminar un protocolo</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-network-listener-1"><tt>create-network-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-network-listeners-1"><tt>list-network-listeners</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-network-listener-1"><tt>delete-network-listener</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
