<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-transportnew"></a><h3>C&#243;mo crear un transporte</h3><a name="indexterm-33"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Configuraci&#243;n de red.</b></li>
<li><b>En el nodo Configuraci&#243;n de red, seleccione el nodo Transportes.</b><p>Se abrir&#225; la p&#225;gina Transportes.</p></li>
<li><b>En la p&#225;gina Transportes, haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo transporte.</p></li>
<li><b>En el campo Nombre, introduzca un nombre &#250;nico para el transporte.</b></li>
<li><b>En el campo Nombre de clase, escriba el nombre de clase de
la implementaci&#243;n del transporte. </b><p>El valor predeterminado es <tt>com.sun.grizzly.TCPSelectorHandler</tt>.</p></li>
<li><b>En el campo Controlador de clave de selecci&#243;n, escriba el nombre de
clase del controlador de clave de selecci&#243;n. </b><p>Un controlador de clave de selecci&#243;n es una clase abstracta que administra el
ciclo de vida de las claves de selecci&#243;n. Si no se especifica ning&#250;n
valor, se utiliza una implementaci&#243;n predeterminada. </p></li>
<li><b>Desde la lista desplegable Tipo de b&#250;fer en byte, seleccione el tipo
de <tt>ByteBuffer</tt> que se va a utilizar. </b><p>Las opciones disponibles son <tt>HEAP</tt> y <tt>DIRECT</tt>. El valor predeterminado es <tt>HEAP</tt>.</p></li>
<li><b>En el campo Subprocesos del aceptador, escriba el n&#250;mero de procesadores de
la m&#225;quina. </b><p>Un valor de -1 indica que Grizzly calcular&#225; por su cuenta el n&#250;mero
de subprocesos del aceptador seg&#250;n el n&#250;mero de procesadores de la m&#225;quina. El
valor predeterminado es 1. </p><p>Para definir el n&#250;mero de subprocesos de procesamiento de solicitudes, establezca el
valor del Tama&#241;o m&#225;ximo del conjunto de subprocesos del conjunto de subprocesos utilizado
por una escucha de red que emplea este transporte. </p></li>
<li><b>En el campo N&#250;mero m&#225;x. de conexiones, escriba el n&#250;mero m&#225;ximo de
conexiones pendientes en una escucha de red que utiliza este transporte.</b><p>El valor predeterminado es 4096.</p></li>
<li><b>En el campo Tama&#241;o de b&#250;fer, escriba el tama&#241;o (en bytes) del
b&#250;fer que se proporciona para las secuencias de entrada creadas por una
escucha de red que utiliza este transporte. </b><p>El valor predeterminado es 8192.</p></li>
<li><b>En el campo Tiempo de espera clave inactiva, escriba el n&#250;mero de
segundos despu&#233;s de los cuales se cancelar&#225; una clave inactiva y se
cerrar&#225; el canal. </b><p>El valor predeterminado es 30.</p></li>
<li><b>En el campo Tiempo de espera de lectura, introduzca el n&#250;mero de
milisegundos que Servidor GlassFish esperar&#225; durante la fase de an&#225;lisis de encabezado
y cuerpo de una operaci&#243;n de lectura.</b><p>El valor predeterminado es 30000.</p></li>
<li><b>En el campo Tiempo de espera de sondeo de selector, escriba el
n&#250;mero de milisegundos tras los cuales un selector NIO se bloquear&#225; a
la espera de eventos (solicitudes del usuario). </b><p>El valor predeterminado es 1.000.</p></li>
<li><b>En el campo Tiempo de espera de escritura, introduzca el n&#250;mero de
milisegundos que Servidor GlassFish espera antes de considerar que el cliente remoto est&#225;
desconectado al escribir la respuesta. </b><p>El valor predeterminado es 30000.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n de habilitaci&#243;n de la configuraci&#243;n de pantalla
para que la configuraci&#243;n interna de Grizzly se descargue en los registros
del servidor.</b><p>Esta opci&#243;n puede proporcionar informaci&#243;n &#250;til para la depuraci&#243;n. Esta opci&#243;n se deshabilita
por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n de habilitaci&#243;n de Snoop para que la
informaci&#243;n de la respuesta/solicitud se vuelque en el registro del servidor.</b><p>Puede que esta opci&#243;n proporcione informaci&#243;n &#250;til para realizar la depuraci&#243;n, pero reduce
significativamente el rendimiento. Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n TCP sin retraso para habilitar la opci&#243;n
TCP_NODELAY (tambi&#233;n llamada algoritmo de Nagle). </b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-networklistenernew.html">C&#243;mo crear una escucha de red</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">C&#243;mo editar la escucha de red</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">C&#243;mo eliminar una escucha de red</a></p>

</li>
<li><p><a href="task-protocolnew.html">C&#243;mo crear un protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">C&#243;mo editar un protocolo</a></p>

</li>
<li><p><a href="task-protocolssledit.html">C&#243;mo editar la configuraci&#243;n SSL para un protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">C&#243;mo editar la configuraci&#243;n HTTP para un protocolo</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">C&#243;mo editar la cach&#233; de archivos para un protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">C&#243;mo eliminar un protocolo</a></p>

</li>
<li><p><a href="task-transportedit.html">C&#243;mo editar un transporte</a></p>

</li>
<li><p><a href="task-transportdelete.html">C&#243;mo eliminar un transporte</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
