<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-protocolssledit"></a><h3>C&#243;mo editar la configuraci&#243;n SSL para un protocolo</h3><a name="indexterm-26"></a><a name="indexterm-27"></a><p><b>Antes de empezar</b></p><p>Esta tarea &#250;nicamente tiene sentido si se ha habilitado la seguridad en
el protocolo. </p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Configuraci&#243;n de red.</b></li>
<li><b>En el nodo Configuraci&#243;n de red, seleccione el nodo Protocolos. </b><p>Se abrir&#225; la p&#225;gina Protocolos.</p></li>
<li><b>En la p&#225;gina Protocolos, haga clic en el nombre del protocolo que
est&#225; editando.</b><p>Se abrir&#225; la p&#225;gina Editar protocolo.</p></li>
<li><b>En la p&#225;gina Editar protocolo, haga clic en la ficha SSL. </b><p>Se abrir&#225; la p&#225;gina SSL.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n SSL3 habilitado para habilitar la opci&#243;n SSL3.
</b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n TLS habilitado para habilitar la seguridad de
la capa de transporte (TLS).</b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Autenticaci&#243;n de clientes habilitada para solicitar a
los clientes que se identifiquen en el servidor con cada solicitud.</b><p>Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>En el campo Sobrenombre del certificado, introduzca el sobrenombre del certificado del
servidor en la base de datos de certificados o token PKCS#11.</b><p>En el certificado, el formato del nombre es <tt><i>tokenname</i>:<i>nickname</i></tt>. Incluyendo el <tt>tokenname<i>:</i></tt>
parte del nombre de este atributo es opcional.</p></li>
<li><b>En el campo Almac&#233;n de claves, introduzca el nombre del archivo de
almac&#233;n de claves (por ejemplo, <tt>keystore.jks</tt>).</b></li>
<li><b>En el campo Algoritmo de confianza, introduzca el nombre del algoritmo de
administraci&#243;n de confianza (por ejemplo, PKIX) que se utilizar&#225; para la validaci&#243;n
de rutas de certificaci&#243;n.</b></li>
<li><b>En el campo N&#250;mero m&#225;ximo de certificados, introduzca el n&#250;mero m&#225;ximo de
certificados intermedios no autoemitidos que puede haber en una ruta de certificaci&#243;n.</b><p>Este campo se utiliza solamente en caso de que el campo Algoritmo
de confianza est&#233; configurado en PKIX. Un valor de 0 implica que
la ruta &#250;nicamente puede contener un certificado. Un valor de -1 implica
que la longitud de la ruta no est&#225; restringida (no hay un
m&#225;ximo). La configuraci&#243;n en un valor inferior a -1 inicia una excepci&#243;n.
</p></li>
<li><b>En el campo Almac&#233;n de confianza, introduzca el nombre de un archivo
del almac&#233;n de confianza (por ejemplo, <tt>cacerts.jks</tt>).</b></li>
<li><b>En el &#225;rea Conjuntos de cifrado, especifique los conjuntos de cifrado que
se utilizar&#225;n.</b><p>Si no a&#241;ade ning&#250;n conjunto de cifrado, se utilizar&#225;n todos los conjuntos
de cifrado.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-networklistenernew.html">C&#243;mo crear una escucha de red</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">C&#243;mo editar la escucha de red</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">C&#243;mo eliminar una escucha de red</a></p>

</li>
<li><p><a href="task-protocolnew.html">C&#243;mo crear un protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">C&#243;mo editar un protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">C&#243;mo editar la configuraci&#243;n HTTP para un protocolo</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">C&#243;mo editar la cach&#233; de archivos para un protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">C&#243;mo eliminar un protocolo</a></p>

</li>
<li><p><a href="task-transportnew.html">C&#243;mo crear un transporte</a></p>

</li>
<li><p><a href="task-transportedit.html">C&#243;mo editar un transporte</a></p>

</li>
<li><p><a href="task-transportdelete.html">C&#243;mo eliminar un transporte</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
