<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-protocolfilecacheedit"></a><h4>C&#243;mo editar la cach&#233; de archivos para un protocolo</h4><a name="indexterm-30"></a><a name="indexterm-31"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Configuraci&#243;n de red.</b></li>
<li><b>En el nodo Configuraci&#243;n de red, seleccione el nodo Protocolos. </b><p>Se abrir&#225; la p&#225;gina Protocolos.</p></li>
<li><b>En la p&#225;gina Protocolos, haga clic en el nombre del protocolo que
est&#225; editando.</b><p>Se abrir&#225; la p&#225;gina Editar protocolo.</p></li>
<li><b>En la p&#225;gina Editar protocolo, haga clic en la ficha Cach&#233; de
archivos.  </b><p>Se abrir&#225; la p&#225;gina Cach&#233; de archivos.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar la memoria cach&#233;
de archivos.</b><p>Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></li>
<li><b>En el campo Antig&#252;edad m&#225;xima, introduzca la antig&#252;edad m&#225;xima, en segundos, de
una entrada de cach&#233; v&#225;lida.</b><p>Este par&#225;metro controla el tiempo que se utiliza la informaci&#243;n en cach&#233;
despu&#233;s de que un archivo se haya almacenado en cach&#233;. Una entrada
m&#225;s antigua que la antig&#252;edad m&#225;xima se reemplaza por una nueva entrada
para el mismo archivo. Si su contenido no cambia con frecuencia, aumente
este valor para mejorar el rendimiento.</p><p>La antig&#252;edad m&#225;xima &#243;ptima depende de si los archivos existentes se modifican
con regularidad. Por ejemplo, si los archivos se modifican cuatro veces al
d&#237;a en intervalos regulares, plant&#233;ese establecer la antig&#252;edad m&#225;xima en 21.600 segundos
(6 horas). De lo contrario, una vez que el archivo haya sido
modificado, considere establecer la antig&#252;edad m&#225;xima en el per&#237;odo de tiempo mayor
que desee servir a la versi&#243;n anterior de un archivo.</p><p>El valor predeterminado es 30.</p></li>
<li><b>En el campo Tama&#241;o m&#225;x. de cach&#233;, escriba el tama&#241;o m&#225;ximo total
(en bytes) de la memoria cach&#233; de archivo del disco.</b><p>El valor predeterminado es 10485760.</p></li>
<li><b>En el campo Total m&#225;ximo de archivos, introduzca el n&#250;mero m&#225;ximo de
archivos que se puede almacenar en la memoria cach&#233; de archivos.</b><p>Si el valor es demasiado grande, el servidor almacena en cach&#233; archivos
que no son estrictamente necesarios, lo que consume memoria. Si el valor
es demasiado peque&#241;o, no se aprovechan las ventajas del almacenamiento en cach&#233;.
Pruebe distintos valores de este atributo para determinar la soluci&#243;n &#243;ptima para
aplicaciones espec&#237;ficas.</p><p>El valor predeterminado es 1024.</p></li>
<li><b>Haga clic en Guardar.</b>
<hr><p><b>Consejo - </b>Para volver a los valores de configuraci&#243;n predeterminados, haga clic en el
bot&#243;n Cargar predeterminados y, a continuaci&#243;n, en Guardar.</p>


<hr>
</li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-networklistenernew.html">C&#243;mo crear una escucha de red</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">C&#243;mo editar la escucha de red</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">C&#243;mo eliminar una escucha de red</a></p>

</li>
<li><p><a href="task-protocolnew.html">C&#243;mo crear un protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">C&#243;mo editar un protocolo</a></p>

</li>
<li><p><a href="task-protocolssledit.html">C&#243;mo editar la configuraci&#243;n SSL para un protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">C&#243;mo editar la configuraci&#243;n HTTP para un protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">C&#243;mo eliminar un protocolo</a></p>

</li>
<li><p><a href="task-transportnew.html">C&#243;mo crear un transporte</a></p>

</li>
<li><p><a href="task-transportedit.html">C&#243;mo editar un transporte</a></p>

</li>
<li><p><a href="task-transportdelete.html">C&#243;mo eliminar un transporte</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
