<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-networklistenernew"></a><h3>C&#243;mo crear una escucha de red</h3><a name="indexterm-21"></a><p><b>Antes de empezar</b></p><p>Cuando se crea una escucha de red, es posible crear simult&#225;neamente un
protocolo que utilizar&#225; la escucha de red o utilizar un protocolo que cree previamente.
Normalmente, existe una relaci&#243;n de uno a uno entre una escucha de
red y su protocolo asociado, pero no es necesario que sea as&#237;. </p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Configuraci&#243;n de red.</b></li>
<li><b>En el nodo Configuraci&#243;n de red, seleccione el nodo Escuchas de red.</b><p>Se abrir&#225; la p&#225;gina Escuchas de red.</p></li>
<li><b>En la p&#225;gina Escuchas de red, haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nueva escucha de red.</p></li>
<li><b>En el campo Nombre, escriba un nombre para la escucha de red.</b><p>Un nombre de escucha de red no puede empezar con un n&#250;mero.</p></li>
<li><b>En el campo Protocolo, especifique el protocolo que se va a asociar
a la escucha de red. </b><ul>
<li><b>Seleccione Crear un protocolo nuevo para crear un nuevo protocolo con una
configuraci&#243;n predeterminada. Adem&#225;s, en la lista desplegable Servidor virtual predeterminado, seleccione el
servidor virtual que se va a asociar al protocolo.</b><p>El nombre predeterminado del protocolo es el nombre de la escucha de
red con la terminaci&#243;n <tt>-protocol</tt> a&#241;adida, pero es posible editar este valor. </p></li>
<li><b>Seleccione Utilizar un protocolo existente y, a continuaci&#243;n, seleccione un protocolo de
la lista desplegable.</b><p>Si selecciona esta opci&#243;n, por lo general habr&#225; creado previamente el protocolo de
esta escucha. </p></li></ul><p>Podr&#225; especificar el protocolo &#250;nicamente si ha creado la escucha de red. No
es posible cambiar el protocolo asociado m&#225;s adelante. </p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar la escucha de
red.</b><p>Esta opci&#243;n se habilita por defecto. Si la escucha se encuentra deshabilitada, cualquier
intento de establecer una conexi&#243;n con ella tiene como resultado una excepci&#243;n
de socket (<tt>java.net.ConnectException</tt>). </p><p>En las versiones anteriores a la 9.1 de Servidor GlassFish, una escucha
cuyo atributo habilitado se hubiera definido como false devolv&#237;a un c&#243;digo de
respuesta 404 para cualquier solicitud que se le enviaba. Para lograr este comportamiento
en la versi&#243;n actual de Servidor GlassFish, establezca el estado de la
escucha en habilitado y defina cada estado de servidor virtual asociado como
desactivado. Un servidor virtual incluye sus escuchas asociadas en la lista desplegable Escuchas
de red. </p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Seguridad habilitada para habilitar la seguridad para
el protocolo que utiliza la escucha de red. </b><p>Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n de habilitaci&#243;n de la escucha JK para
especificar que la escucha admite el protocolo <tt>mod-jk</tt> de Apache. </b><p>El protocolo <tt>mod-jk</tt> es un protocolo de red/comunicaci&#243;n de propiedad entre <tt>httpd</tt>
de Apache (servidor web) y una  instancia back-end de Servidor GlassFish. Si
la escucha admite este protocolo, se supone que <tt>httpd</tt> maneja todo el
contenido est&#225;tico, mientras que cualquier solicitud de recursos din&#225;micos (es decir, servlets
y JSP) se direccionan a la escucha de red con el protocolo
<tt>mod jk</tt> habilitado de Servidor GlassFish a trav&#233;s del protocolo  <tt>mod-jk</tt>. Esta opci&#243;n
se deshabilita por defecto.</p></li>
<li><b>En el campo Puerto, introduzca el n&#250;mero de puerto en el que
se efectuar&#225; la escucha de red.</b><p>Los valores v&#225;lidos se encuentran entre 1 y 65535. En un sistema
UNIX, la creaci&#243;n de sockets de escucha para puertos 1-1024 requiere privilegios
de superusuario.</p></li>
<li><b>En el campo Direcci&#243;n, escriba la direcci&#243;n IP en la que se
efectuar&#225; la escucha de red.</b><p>La direcci&#243;n se puede especificar en par punteado o notaci&#243;n IPv6. Puede
ser <tt>cualquiera</tt> (para <tt>INADDR_ANY</tt>) para recibir escuchas en todas las direcciones IP.
Puede ser un nombre de host. </p></li>
<li><b>En la lista desplegable Conjunto de subprocesos, seleccione el conjunto de subprocesos
que se debe asociar a la escucha de red.</b><p>Normalmente, puede seleccionar uno de las dos conjuntos de subprocesos que est&#225;n configurados
cuando se instala Servidor GlassFish.  </p></li>
<li><b>En la lista desplegable Transporte, seleccione el tipo de transporte que se
debe utilizar en la escucha de red.</b><p>De forma predeterminada, la &#250;nica alternativa es <tt>tcp</tt>. </p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>Pasos siguientes</b></p><p>Si ha habilitado la seguridad de la escucha de red, puede utilizar
la ficha SSL para editar la configuraci&#243;n de SSL del protocolo utilizado por
la escucha de red. </p>

<p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-networklisteneredit.html">C&#243;mo editar la escucha de red</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">C&#243;mo eliminar una escucha de red</a></p>

</li>
<li><p><a href="task-protocolnew.html">C&#243;mo crear un protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">C&#243;mo editar un protocolo</a></p>

</li>
<li><p><a href="task-protocolssledit.html">C&#243;mo editar la configuraci&#243;n SSL para un protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">C&#243;mo editar la configuraci&#243;n HTTP para un protocolo</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">C&#243;mo editar la cach&#233; de archivos para un protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">C&#243;mo eliminar un protocolo</a></p>

</li>
<li><p><a href="task-transportnew.html">C&#243;mo crear un transporte</a></p>

</li>
<li><p><a href="task-transportedit.html">C&#243;mo editar un transporte</a></p>

</li>
<li><p><a href="task-transportdelete.html">C&#243;mo eliminar un transporte</a></p>

</li>
<li><p><a href="task-virtualservercreate.html">Para crear un servidor virtual</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
