<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-accesslog"></a><h3>Para configurar el servicio HTTP</h3><a name="indexterm-16"></a><a name="indexterm-17"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Servicio HTTP.</b><p>Se abrir&#225; la p&#225;gina Servicio HTTP.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n de habilitaci&#243;n de SSO para habilitar de
forma predeterminada el inicio de sesi&#243;n &#250;nico para todas las aplicaciones web
en todos los servidores virtuales de este servidor que se hayan configurado
para el mismo dominio.</b><p>Puede cancelar este valor para un servidor virtual individual. Esta opci&#243;n se deshabilita
por defecto.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Registro de acceso activado para habilitar el
registro de acceso de todos los subelementos de servidores virtuales que no
tengan especificada esta propiedad. </b><p>Si anula la selecci&#243;n de la casilla de verificaci&#243;n Registro de acceso
activado, se desactivar&#225; el registro de acceso de todos los subelementos de
servidores virtuales que no tengan especificada esta propiedad. Esta opci&#243;n se deshabilita
por defecto.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Rotaci&#243;n activada para habilitar la rotaci&#243;n del
archivo de registro.</b><p>Esta opci&#243;n est&#225; habilitada por defecto.</p></li>
<li><b>En la lista desplegable Directiva de rotaci&#243;n, seleccione una directiva de rotaci&#243;n.</b><p>La &#250;nica pol&#237;tica de rotaci&#243;n disponible es <tt>time</tt>.</p></li>
<li><b>En el campo Intervalo de rotaci&#243;n, introduzca el n&#250;mero de minutos entre
las rotaciones del registro de acceso. </b><p>Este campo s&#243;lo es v&#225;lido si la pol&#237;tica de rotaci&#243;n es <tt>time</tt>.
El valor predeterminado es 1.440 minutos (24 horas).</p></li>
<li><b>En el campo Sufijo de rotaci&#243;n, introduzca el valor de la cadena
del sufijo que se va a agregar al final del nombre del
archivo de registro tras la rotaci&#243;n.</b><p>El valor predeterminado es <tt>aaaa-MM-dd</tt>.</p><p>Aseg&#250;rese de que el sufijo de rotaci&#243;n contenga valores suficientes para crear
un sufijo &#250;nico para cada rotaci&#243;n del registro. Por ejemplo, si el
registro de acceso rota m&#225;s de una vez al d&#237;a, se incluye
la hora del d&#237;a en el sufijo de rotaci&#243;n.</p><p>Es necesario un &#250;nico sufijo para asegurar que el archivo de registro
de acceso rota cada vez que transcurre el intervalo de rotaci&#243;n .
Si el sufijo de rotaci&#243;n del nuevo archivo de registro de acceso
es igual que el sufijo de rotaci&#243;n del archivo de registro de
acceso existente, el archivo no se rota.</p></li>
<li><b>En el campo N&#250;mero m&#225;x. de archivos, escriba el n&#250;mero m&#225;ximo de
archivos de registro de acceso rotados que deben guardarse. </b><p>Un valor negativo indica que no hay l&#237;mite en el n&#250;mero de
archivos. El valor predeterminado es -1.</p></li>
<li><b>En el campo Tama&#241;o del b&#250;fer, introduzca el tama&#241;o, en bytes, del
b&#250;fer de registro de acceso.</b><p>Un valor inferior o igual a cero deshabilita el almacenamiento en el
b&#250;fer del registro de acceso. El valor predeterminado es 32768.</p></li>
<li><b>En el campo Intervalo de escritura, introduzca el n&#250;mero de segundos que
deben transcurrir para que el registro se escriba en el disco.</b><p>El registro de acceso se escribe cuando el b&#250;fer est&#225; lleno o
cuando caduca el intervalo. Si el valor es menor o igual a
cero, el b&#250;fer siempre se escribe aunque no est&#233; lleno. Esto significa
que cada vez que se accede al servidor, el mensaje de registro
se almacena directamente en el archivo. El valor predeterminado es 300.</p></li>
<li><b>En el campo Formato, introduzca el valor de la cadena para especificar
las propiedades siguientes del registro de acceso:</b>
<ul><li><p>Informaci&#243;n que se capturar&#225; en el registro de acceso</p>

</li>
<li><p>Orden en el que se capturar&#225; la informaci&#243;n</p>

</li></ul>
<p>El valor predeterminado es el siguiente:</p><pre>%client.name% %auth-user-name% %datetime% %request% %status% %response.length%</pre><p>Los valores siguientes est&#225;n disponibles para su inclusi&#243;n en la cadena de
formato:</p><dl><dt><tt>%attribute.<i>name</i>%</tt></dt>
<dd><p>Registra el valor (mediante una llamada a su m&#233;todo <tt>toString</tt>) del atributo de la solicitud con el <i>nombre</i> indicado</p>

</dd>
<dt><tt>%auth-user-name%</tt></dt>
<dd><p>Nombre de usuario autorizado</p>

</dd>
<dt><tt>%client.name%</tt></dt>
<dd><p>Nombre de host del cliente</p>

</dd>
<dt><tt>%client.dns%</tt></dt>
<dd><p>DNS de cliente</p>

</dd>
<dt><tt>%cookie.<i>name</i>%</tt></dt>
<dd><p>El valor de la cookie de la solicitud con el <i>nombre</i> indicado</p>

</dd>
<dt><tt>%cookie.value%</tt></dt>
<dd><p>El valor de la primera cookie que se encuentra en la solicitud </p>

</dd>
<dt><tt>%datetime%</tt></dt>
<dd><p>Fecha del sistema</p>

</dd>
<dt><tt>%request%</tt></dt>
<dd><p>L&#237;nea de solicitud HTTP completa</p>

</dd>
<dt><tt>%status%</tt></dt>
<dd><p>Estado</p>

</dd>
<dt><tt>%response.length%</tt></dt>
<dd><p>Longitud del contenido de respuesta</p>

</dd>
<dt><tt>%header.referer%</tt></dt>
<dd><p>Encabezado del referenciador</p>

</dd>
<dt><tt>%header.user-agent%</tt></dt>
<dd><p>Encabezado del agente del usuario</p>

</dd>
<dt><tt>%http-method%</tt></dt>
<dd><p>M&#233;todo HTTP</p>

</dd>
<dt><tt>%http-uri%</tt></dt>
<dd><p>URI de HTTP</p>

</dd>
<dt><tt>%query-str%</tt></dt>
<dd><p>Cadena de consulta HTTP</p>

</dd>
<dt><tt>%http-version%</tt></dt>
<dd><p>Versi&#243;n de protocolo HTTP</p>

</dd>
<dt><tt>%header.accept%</tt></dt>
<dd><p>Encabezado de aceptaci&#243;n</p>

</dd>
<dt><tt>%header.date%</tt></dt>
<dd><p>Encabezado de fecha</p>

</dd>
<dt><tt>%header.if-mod-since%</tt></dt>
<dd><p>Encabezado si modificados desde</p>

</dd>
<dt><tt>%header.auth%</tt></dt>
<dd><p>Encabezado de autorizaci&#243;n</p>

</dd>
<dt><tt>%header.<i>any</i>%</tt></dt>
<dd><p>Cualquier valor de encabezado HTTP v&#225;lido definido en RFC 2616 (<tt>cualquiera</tt> tambi&#233;n es un valor de encabezado v&#225;lido; se especifica como variable aqu&#237;)</p>

</dd>
<dt><tt>%session.<i>name</i>%</tt></dt>
<dd><p>El valor del atributo de la sesi&#243;n con el nombre <i>name</i> o <tt>NULL-SESSION-ATTRIBUTE-<i>name</i></tt> si el atributo indicado no existe en la sesi&#243;n, o <tt>NULL-SESSION</tt> si no existe sesi&#243;n </p>

</dd>
<dt><tt>%time-taken%</tt></dt>
<dd><p>Tiempo (en milisegundos) que se tard&#243; en dar servicio a cada solicitud </p>

</dd>
<dt><tt>%vs.id%</tt></dt>
<dd><p>Id. de servidor virtual</p>

</dd>
</dl>
</li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para obtener una descripci&#243;n de las propiedades disponibles, consulte <a href="ref-httpserviceprops.html">Propiedades espec&#237;ficas del servicio de transacci&#243;n HTTP</a>.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b>
<hr><p><b>Consejo - </b>Para volver a los valores de configuraci&#243;n predeterminados, haga clic en el
bot&#243;n Cargar predeterminados y, a continuaci&#243;n, en Guardar.</p>


<hr>
</li></ol>

<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
