<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooledit" name="ref-connectorconnectionpooledit"></a><a id="GHJCA00044" name="GHJCA00044"></a></p>

<h4><a id="sthref75" name="sthref75"></a>Editar Pool de Conexiones del Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar conjunto de conexiones de conectores para modificar los par&aacute;metros de configuraci&oacute;n de un conjunto de conexiones de conectores.</p>
<p>La p&aacute;gina Editar conjunto de conexiones de conectores contiene las siguientes opciones.</p>
<dl>
<dt>Cargar valores predeterminados</dt>
<dd>
<p>Bot&oacute;n para restaurar la configuraci&oacute;n que tiene valores por defecto a estos valores. La configuraci&oacute;n que no tiene valores por defecto no se modifica.</p>
</dd>
<dt>Vaciar</dt>
<dd>
<p>Bot&oacute;n para reinicializar las conexiones del conjunto de conexiones. Al hacer clic en este bot&oacute;n se destruyen todas las conexiones existentes, se recrean las conexiones establecidas para el conjunto y se restablece el tama&ntilde;o de conjunto inicial y m&iacute;nimo del conjunto.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Bot&oacute;n para verificar que el conjunto de conexiones se puede utilizar.</p>
</dd>
<dt>Nombre de conjunto</dt>
<dd>
<p>Un nombre exclusivo que identifica el conjunto de conexiones de conectores. &Eacute;ste es un campo de solo lectura. El nombre del conjunto se puede especificar &uacute;nicamente al crear un nuevo conjunto de conexiones del conector.</p>
</dd>
<dt>Adaptador de recursos</dt>
<dd>
<p>El adaptador de recursos asociado con el conjunto de conexiones de conectores.</p>
</dd>
<dt>Definici&oacute;n de conexi&oacute;n</dt>
<dd>
<p>La definici&oacute;n de conexi&oacute;n para el conjunto de conexiones de conectores. Las opciones de la lista dependen del adaptador de recursos seleccionado. La definici&oacute;n de conexi&oacute;n identifica un elemento <code>connection-definition</code> del adaptador de recursos en el archivo <code>ra.xml</code>.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; habilitada, se realiza un ping en el conjunto de conexiones durante la creaci&oacute;n o la reconfiguraci&oacute;n para identificar cualquier valor incorrecto para sus atributos y avisar de &eacute;l. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Una descripci&oacute;n del conjunto de conexiones de conectores.</p>
</dd>
<dt>Tama&ntilde;o inicial y m&iacute;nimo del conjunto</dt>
<dd>
<p>El n&uacute;mero m&iacute;nimo de conexiones del conjunto de conexiones de conectores. El valor predeterminado es 8.</p>
</dd>
<dt>Tama&ntilde;o m&aacute;ximo del conjunto</dt>
<dd>
<p>El n&uacute;mero m&aacute;ximo de conexiones del conjunto de conexiones de conectores. El valor predeterminado es 32.</p>
</dd>
<dt>Cantidad de cambio de tama&ntilde;o del conjunto</dt>
<dd>
<p>El n&uacute;mero de conexiones que se eliminar&aacute;n cuando se llegue al l&iacute;mite el tiempo de espera del conjunto. El valor predeterminado es 2.</p>
</dd>
<dt>Tiempo de espera inactivo</dt>
<dd>
<p>El tiempo m&aacute;ximo en segundos que una conexi&oacute;n puede permanecer inactiva en el conjunto. El valor predeterminado es 300.</p>
</dd>
<dt>Tiempo de espera m&aacute;ximo</dt>
<dd>
<p>La cantidad de tiempo que la aplicaci&oacute;n que solicita una conexi&oacute;n puede esperar para obtener la conexi&oacute;n. El valor predeterminado es 60000.</p>
</dd>
<dt>Validaci&oacute;n de la conexi&oacute;n</dt>
<dd>
<p>Si la casilla de verificaci&oacute;n Necesaria est&aacute; seleccionada, las conexiones se validar&aacute;n antes de proporcion&aacute;rselas a la aplicaci&oacute;n. Si falla la validaci&oacute;n de un recurso, &eacute;ste se destruye, para a continuaci&oacute;n crear y devolver un recurso nuevo. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Con cualquier fallo</dt>
<dd>
<p>Si se selecciona la casilla de verificaci&oacute;n Cerrar todas las conexiones, GlassFish Server cerrar&aacute; todas las conexiones del conjunto y las restablecer&aacute; con que tan s&oacute;lo falle una. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Compatibilidad de transacci&oacute;n</dt>
<dd>
<p>La compatibilidad de transacci&oacute;n seleccionada sobrescribe el atributo de compatibilidad de transacci&oacute;n en el adaptador de recursos asociado con el conjunto de conexiones de una forma descendente. Dicho de otro modo, se puede admitir un nivel de transacci&oacute;n inferior o id&eacute;ntico al que se especifica en el adaptador de recursos, pero no se puede indicar un nivel superior.</p>
<p>El valor puede ser cualquiera de los siguientes:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>El adaptador de recursos soporta transacciones JTA y transacciones locales del gestor de recursos mediante la implantaci&oacute;n de las interfaces LocalTransaction y XAResource. Las transacciones XA se controlan y coordinan a trav&eacute;s de un administrador de transacciones ajeno a un administrador de recursos.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>El adaptador de recursos soporta transacciones locales mediante la implantaci&oacute;n de la interfaz LocalTransaction. Las transacciones locales se administran de manera interna en un administrador de recursos y no involucran a administradores de transacciones externos.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>El adaptador de recursos no soporta transacciones JTA o transacciones locales del gestor de recursos y no implanta las interfaces XAResource o LocalTransaction.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref76" name="sthref76"></a>
<h5>Tareas Relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Crear un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Editar un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avanzados de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Editar Propiedades de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad para Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad del Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Editar una Asignaci&oacute;n de Seguridad para un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suprimir un Pool de Conexiones de Conector</a></p>
</li>
</ul>
<a id="sthref77" name="sthref77"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
