<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a><a id="GHJCA00045" name="GHJCA00045"></a></p>

<h4><a id="sthref78" name="sthref78"></a>Editar Atributos Avanzados del Pool de Conexiones de Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar atributos avanzados del conjunto de conexiones de conector para modificar las opciones avanzadas de un conjunto de conexiones del conector.</p>
<p>La p&aacute;gina Editar atributos avanzados del conjunto de conexiones de conector presenta las opciones siguientes:</p>
<dl>
<dt>Cargar valores predeterminados</dt>
<dd>
<p>Bot&oacute;n para restaurar la configuraci&oacute;n que tiene valores por defecto a estos valores. La configuraci&oacute;n que no tiene valores por defecto no se modifica.</p>
</dd>
<dt>Validar como m&aacute;ximo una vez</dt>
<dd>
<p>Especifica el intervalo de tiempo, en segundos, entre solicitudes consecutivas para validar una conexi&oacute;n como m&aacute;ximo una vez. El valor predeterminado es 0, lo que significa que el atributo no est&aacute; habilitado.</p>
</dd>
<dt>Tiempo de espera de p&eacute;rdida</dt>
<dd>
<p>La duraci&oacute;n de tiempo, en segundos, para realizar un seguimiento de las p&eacute;rdidas de conexi&oacute;n en un conjunto de conexiones. El valor 0 indica que el seguimiento de p&eacute;rdidas de conexi&oacute;n est&aacute; deshabilitado. El valor predeterminado es 0.</p>
</dd>
<dt>Reclamaci&oacute;n de p&eacute;rdidas</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, las conexiones perdidas se restablecer&aacute;n en el conjunto tras completar un seguimiento de las p&eacute;rdidas de conexi&oacute;n. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Reintentos de creaci&oacute;n</dt>
<dd>
<p>El n&uacute;mero de intentos que se har&aacute;n si se produce un fallo al crear una nueva conexi&oacute;n. El valor de 0 significa que no se har&aacute; ning&uacute;n intento para crear la conexi&oacute;n de nuevo. El valor predeterminado es 0.</p>
</dd>
<dt>Intervalo de reintento</dt>
<dd>
<p>El intervalo, en segundos, entre dos intentos para crear una conexi&oacute;n. Este atributo se utiliza s&oacute;lo si el valor de intentos de reintento de creaci&oacute;n es superior a 0. El valor predeterminado es 10 segundos.</p>
</dd>
<dt>Crear conjuntos</dt>
<dd>
<p>Permite crear conjuntos de conexiones en el conjunto. Esta opci&oacute;n est&aacute; habilitada por defecto.</p>
</dd>
<dt>Asociaci&oacute;n no activa</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, las conexiones se asociar&aacute;n levemente cuando se realice una operaci&oacute;n en ellas. Las conexiones se disocian cuando la transacci&oacute;n se completa y un m&eacute;todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f&iacute;sicas. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Reclutamiento de conexiones no activas</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, s&oacute;lo se incluye un recurso en la transacci&oacute;n cuando realmente se utiliza en un m&eacute;todo. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Asociar con subproceso</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la conexi&oacute;n est&aacute; asociada a un subproceso. Cuando el mismo subproceso necesita otra conexi&oacute;n, puede volver a utilizar la conexi&oacute;n que ya est&aacute; asociada con ese subproceso, sin necesidad de incurrir en la sobrecarga de coger otra conexi&oacute;n del conjunto. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
<dt>Conexiones coincidentes</dt>
<dd>
<p>Si selecciona esta opci&oacute;n, la correspondencia de conexiones est&aacute; habilitada en el conjunto. Esta opci&oacute;n se puede deshabilitar si sabe que las conexiones del conjunto siempre ser&aacute;n homog&eacute;neas y, por tanto, para una conexi&oacute;n recogida del conjunto no se necesita establecer correspondencia mediante el adaptador de recursos. Esta opci&oacute;n se habilita por defecto.</p>
</dd>
<dt>Uso de la correspondencia de conexiones</dt>
<dd>
<p>El n&uacute;mero de veces que el conjunto debe reutilizar una conexi&oacute;n. La conexi&oacute;n se cerrar&aacute; una vez reutilizada durante un n&uacute;mero espec&iacute;fico de veces. El valor 0 indica que el atributo no est&aacute; habilitado. El valor predeterminado es 0.</p>
</dd>
</dl>
<a id="sthref79" name="sthref79"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Crear un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Editar un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avanzados de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Editar Propiedades de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad para Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad del Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Editar una Asignaci&oacute;n de Seguridad para un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suprimir un Pool de Conexiones de Conector</a></p>
</li>
</ul>
<a id="sthref80" name="sthref80"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
