<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-resourceadapterconfig"></a><h4>Configuraci&#243;n del adaptador de recursos </h4>
<a name="indexterm-59"></a><p>Utilice la p&#225;gina Configuraci&#243;n del adaptador de recursos para gestionar los par&#225;metros
de configuraci&#243;n del conector (adaptador de recursos). </p>

<p>La configuraci&#243;n del adaptador de recursos proporciona informaci&#243;n de configuraci&#243;n para un
adaptador de recursos. Con la Consola de administraci&#243;n puedes crear una configuraci&#243;n
del adaptador de recursos despu&#233;s de implementar dicho adaptador. En este caso,
el adaptador de recursos se reinicia con la nueva configuraci&#243;n. Para crear una
configuraci&#243;n del adaptador de recursos antes de implementar dicho adaptador, utilice el
comando <tt>asadmin create-resource-adapter-config</tt>. </p>

<p>Antes de que pueda crear una configuraci&#243;n del adaptador de recursos, debe
crear un conjunto de subprocesos para que lo utilice dicho adaptador. </p>

<p>Para la configuraci&#243;n de cada adaptador de recursos, se proporciona la siguiente
informaci&#243;n.</p>

<dl><dt>Nombre</dt>
<dd><p>El nombre del adaptador de recursos. </p>

</dd>
</dl>
<p>La tabla Configuraci&#243;n tambi&#233;n contiene las siguientes opciones. </p>

<dl><dt>Nuevo</dt>
<dd><p>Bot&#243;n para crear una nueva configuraci&#243;n del adaptador de recursos. </p>

</dd>
<dt>Borrar</dt>
<dd><p>Bot&#243;n para eliminar una o m&#225;s configuraciones seleccionadas del adaptador de recursos. </p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-resourceadapterconfignew.html">Para crear una configuraci&#243;n del adaptador de recursos</a></p>

</li>
<li><p><a href="task-resourceadapterconfigedit.html">Para editar una configuraci&#243;n del adaptador de recursos</a></p>

</li>
<li><p><a href="task-resourceadapterconfigdelete.html">Para eliminar una configuraci&#243;n del adaptador de recursos</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-resource-adapter-config-1"><tt>create-resource-adapter-config</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-resource-adapter-configs-1"><tt>list-resource-adapter-configs</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-resource-adapter-config-1"><tt>delete-resource-adapter-config</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
