<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymapedit" name="ref-worksecuritymapedit"></a><a id="GHJCA00055" name="GHJCA00055"></a></p>

<h4>Editar mapa de seguridad de tareas</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar mapa de seguridad de tareas para modificar los par&aacute;metros de configuraci&oacute;n para el mapa de seguridad de tareas.</p>
<p>La p&aacute;gina Editar mapa de seguridad de tareas contiene las siguientes opciones.</p>
<dl>
<dt>Nombre del mapa de seguridad</dt>
<dd>
<p>El nombre del mapa de seguridad de tareas. &Eacute;ste campo es de s&oacute;lo lectura. S&oacute;lo se puede especificar un nombre de mapa de seguridad cuando cree un nuevo mapa de seguridad de tareas.</p>
</dd>
<dt>Grupo</dt>
<dd>
<p>Si el bot&oacute;n de radio Grupo est&aacute; activado, el campo de texto debe especificar una asignaci&oacute;n de cada grupo de usuarios EIS de backend al grupo de usuarios correspondiente definido en el dominio de seguridad de GlassFish Server. Use una lista separada por comas para especificar m&aacute;s de una asignaci&oacute;n. Por ejemplo:</p>
<pre>
eis-group-1=server-group-1,eis-group-2=server-group-2
</pre></dd>
<dt>Principal</dt>
<dd>
<p>Si el bot&oacute;n de radio Principal est&aacute; seleccionado, el campo de texto debe especificar una asignaci&oacute;n de cada principal EIS de backend al principal correspondiente definido en el dominio de seguridad de GlassFish Server. Use una lista separada por comas para especificar m&aacute;s de una asignaci&oacute;n. Por ejemplo:</p>
<pre>
eis-principal-1=server-principal-1,eis-principal-2=server-principal-2
</pre></dd>
<dt>Adaptador de recursos</dt>
<dd>
<p>El adaptador de recursos para el EIS.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Una descripci&oacute;n del mapa de seguridad de tareas.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, el mapa de seguridad de tareas est&aacute; habilitado. Esta opci&oacute;n se habilita por defecto.</p>
</dd>
</dl>
<a id="sthref114" name="sthref114"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suprimir una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
</ul>
<a id="sthref115" name="sthref115"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
