<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymaps" name="ref-worksecuritymaps"></a><a id="GHJCA00053" name="GHJCA00053"></a></p>

<h4><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>Asignaciones de Seguridad de Trabajo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Mapas de seguridad de tareas para configurar los mapas de seguridad de tareas para los adaptadores de recursos.</p>
<p>Un mapa de seguridad de tareas de conectores asigna la identidad de origen de la llamada de las tareas presentadas por un adaptador de recursos a un elemento principal o a un grupo de usuarios adecuado en el dominio de seguridad de GlassFish Server. Uno o m&aacute;s mapas de seguridad de tareas pueden asociarse con un adaptador de recursos. La configuraci&oacute;n de asignaciones de seguridad de trabajo del conector soporta el uso del asterisco como car&aacute;cter comod&iacute;n (<code>*</code>) para referirse a todos los usuarios o a todos los grupos de usuarios.</p>
<p>Una asignaci&oacute;n de seguridad de trabajo es diferente de una asignaci&oacute;n de seguridad para un pool de conexiones de conectores, el cual asigna el principal recibido durante la autenticaci&oacute;n EJB o de servlet a las credenciales aceptadas por el EIS. Consulte <a href="ref-connectorsecuritymaps.html">Asignaciones de Seguridad del Pool de Conexiones del Conector</a> para obtener m&aacute;s informaci&oacute;n sobre las asignaciones de seguridad relativas a pools de conexiones de conectores.</p>
<p>El sistema de informaci&oacute;n empresarial (EIS) es cualquier sistema que guarde los datos de una organizaci&oacute;n. Puede ser un mainframe, un sistema de mensajer&iacute;a, un sistema de base de datos o una aplicaci&oacute;n.</p>
<p>Para cada mapa de seguridad de tareas, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>El nombre del mapa de seguridad de tareas.</p>
</dd>
</dl>
<p>La tabla Mapas de seguridad de tareas tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear un mapa de seguridad de tareas nuevo.</p>
</dd>
<dt>Borrar</dt>
<dd>
<p>Bot&oacute;n para eliminar uno o m&aacute;s mapas de seguridad de tareas seleccionados.</p>
</dd>
</dl>
<a id="sthref108" name="sthref108"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suprimir una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
</ul>
<a id="sthref109" name="sthref109"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
