<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-worksecuritymapedit"></a><h4>Editar mapa de seguridad de tareas </h4>
<p>Utilice la p&#225;gina Editar mapa de seguridad de tareas para modificar los
par&#225;metros de configuraci&#243;n para el mapa de seguridad de tareas. </p>

<p>La p&#225;gina Editar mapa de seguridad de tareas contiene las siguientes opciones.</p>

<dl><dt>Nombre del mapa de seguridad</dt>
<dd><p>El nombre del mapa de seguridad de tareas. &#201;ste campo es de s&#243;lo lectura. S&#243;lo se puede especificar un nombre de mapa de seguridad cuando cree un nuevo mapa de seguridad de tareas. </p>

</dd>
<dt>Grupo</dt>
<dd><p>Si el bot&#243;n de opci&#243;n Grupo est&#225; seleccionado, el campo de texto debe especificar un mapa de cada grupo de usuarios EIS de back-end al grupo de usuarios correspondiente definido en el dominio de seguridad de GlassFish Server. Use una lista separada por comas para especificar m&#225;s de una asignaci&#243;n. Por ejemplo:</p>

<pre>eis-group-1=server-group-1,eis-group-2=server-group-2</pre></dd>
<dt>Principal</dt>
<dd><p>Si el bot&#243;n de opci&#243;n Asignaci&#243;n de elemento principal est&#225; seleccionado, el campo de texto debe especificar un mapa de cada elemento principal EIS de back-end al elemento principal correspondiente definido en el dominio de seguridad de GlassFish Server. Use una lista separada por comas para especificar m&#225;s de una asignaci&#243;n. Por ejemplo:</p>

<pre>eis-principal-1=server-principal-1,eis-principal-2=server-principal-2</pre></dd>
<dt>Adaptador de recursos </dt>
<dd><p>El adaptador de recursos para el EIS. </p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n del mapa de seguridad de tareas. </p>

</dd>
<dt>Estado</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, el mapa de seguridad de tareas est&#225; habilitado. Esta opci&#243;n se habilita por defecto.</p>

</dd>
</dl>
<a name="gkolg"></a><h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-worksecuritymapnew.html">Para crear un mapa de seguridad de tareas</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar un mapa de seguridad de tareas</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para eliminar un mapa de seguridad de tareas</a></p>

</li></ul>
<a name="gkolw"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-work-security-map-1"><tt>create-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-work-security-maps-1"><tt>list-connector-work-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-work-security-map-1"><tt>delete-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-work-security-map-1"><tt>update-connector-work-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
