<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-adminobjectedit"></a><h3>Para editar un recurso de objeto administrado</h3><a name="indexterm-22"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Recursos.</b></li>
<li><b>Expanda el nodo Conectores</b></li>
<li><b>En el nodo Conectores, seleccione el nodo Recursos de objeto administrado. </b><p>La p&#225;gina Recursos de objeto administrado se abre. </p></li>
<li><b>En la p&#225;gina Recursos de objeto administrado, haga clic en el nombre
del recurso de objeto administrado que se est&#225; editando. </b><p>Se abre la p&#225;gina Editar recurso de objeto administrado.</p></li>
<li><b>En la lista desplegable Adaptador de recursos, seleccione el adaptador de recursos para
el recurso de objeto administrado. </b></li>
<li><b>En la lista desplegable Tipo de recurso, seleccione el tipo Java para
el recurso de objeto administrado. </b></li>
<li><b>En la lista desplegable Nombre de clase, seleccione el nombre de clase
de implementaci&#243;n asociado con el tipo de recurso. </b></li>
<li><b>En el campo Descripci&#243;n, introduzca una descripci&#243;n del recurso de objeto administrado.</b></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar el recurso de
objeto administrado. </b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li>(Opcional) <b>En la tabla Propiedades adicionales, especifique las propiedades adicionales para el recurso de
objeto administrado. </b><p>Las propiedades disponibles dependen del adaptador de recursos para el conjunto de conexiones
de conectores.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite su campo Valor.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>En la ficha Destino, haga clic en Administrar destinos para editar los
destinos en los que el objeto administrado est&#225; implementado. </b><p>Vuelva a la p&#225;gina Editar recurso de objeto administrado haciendo clic en
la ficha General.</p></li>
<li><b>Haga clic en Guardar.</b>
<hr><p><b>Consejo - </b>Para volver a los valores de configuraci&#243;n predeterminados, haga clic en el
bot&#243;n Cargar predeterminados y, a continuaci&#243;n, en Guardar.</p>


<hr>
</li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-connectorresourcenew.html">Para crear un recurso de conector</a></p>

</li>
<li><p><a href="task-connectorresourceedit.html">Para editar un recurso de conector</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Para borrar un recurso de conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolnew.html">Para crear un conjunto de conexiones de conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar un conjunto de conexiones de conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del conjunto de conexiones del conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar las propiedades del conjunto de conexiones del conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para crear un mapa de seguridad para un conjunto de conexiones de conectores</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar un mapa de seguridad para un conjunto de conexiones de conectores</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para eliminar un mapa de seguridad para un conjunto de conexiones de conectores</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para eliminar un conjunto de conexiones de conector</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Para configurar el acceso EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Para crear un recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Para eliminar un recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Para crear un mapa de seguridad de tareas</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar un mapa de seguridad de tareas</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para eliminar un mapa de seguridad de tareas</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
