<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-adminobjectedit" name="task-adminobjectedit"></a><a id="GHJCA00073" name="GHJCA00073"></a></p>

<h4><a id="sthref35" name="sthref35"></a>Edici&oacute;n de un Recurso de Objeto Administrado</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>Expanda el nodo Conectores</p>
</li>
<li>
<p>En el nodo Conectores, seleccione el nodo Recursos de objeto administrado.</p>
<p>La p&aacute;gina Recursos de objeto administrado se abre.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos de objeto administrado, haga clic en el nombre del recurso de objeto administrado que se est&aacute; editando.</p>
<p>Se abre la p&aacute;gina Editar recurso de objeto administrado.</p>
</li>
<li>
<p>En la lista desplegable Adaptador de recursos, seleccione el adaptador de recursos para el recurso de objeto administrado.</p>
</li>
<li>
<p>En la lista desplegable Tipo de recurso, seleccione el tipo Java para el recurso de objeto administrado.</p>
</li>
<li>
<p>En la lista desplegable Nombre de clase, seleccione el nombre de clase de implementaci&oacute;n asociado con el tipo de recurso.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n del recurso de objeto administrado.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Estado habilitado para habilitar el recurso de objeto administrado.</p>
<p>Esta opci&oacute;n se habilita por defecto.</p>
</li>
<li>
<p>En la tabla Propiedades adicionales, especifique las propiedades adicionales para el recurso de objeto administrado.</p>
<p>Las propiedades disponibles dependen del adaptador de recursos para el conjunto de conexiones de conectores.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, escriba el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite su campo Valor.</p>
</li>
<li>
<p>Para eliminar una propiedad, marque la casilla de verificaci&oacute;n situada a la izquierda del campo Nombre de la propiedad que quiera eliminar y, a continuaci&oacute;n, haga clic en el bot&oacute;n Eliminar propiedades.</p>
</li>
</ul>
</li>
<li>
<p>En la ficha Destino, haga clic en Administrar destinos para editar los destinos en los que el objeto administrado est&aacute; implementado.</p>
<p>Vuelva a la p&aacute;gina Editar recurso de objeto administrado haciendo clic en la ficha General.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref36" name="sthref36"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Crear un Recurso de Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Editar un Recurso de Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Suprimir un Recurso de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Crear un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Editar un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avanzados de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Editar Propiedades de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad para Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad del Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Editar una Asignaci&oacute;n de Seguridad para un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suprimir un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Configurar el Acceso EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Crear un Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suprimir un Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suprimir una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
