<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolproperty" name="task-connectorconnectionpoolproperty"></a><a id="GHJCA00066" name="GHJCA00066"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Editar Propiedades de Pools de Conexiones de Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>Expanda el nodo Conectores.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Conjuntos de conexiones de conectores.</p>
<p>Se abrir&aacute; la p&aacute;gina Conjuntos de conexiones de conectores.</p>
</li>
<li>
<p>En la p&aacute;gina Conjunto de conexiones de conectores, haga clic en el nombre del conjunto de conexiones de conectores que desee editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar conjunto de conexiones de conectores.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Pool de Conexiones de Conector, haga clic en el separador Propiedades Adicionales.</p>
<p>Se abre la p&aacute;gina Editar propiedades de conjunto de conexiones del conector.</p>
</li>
<li>
<p>En la tabla Propiedades adicionales, especifique las propiedades adicionales para el conjunto de conexiones de conectores.</p>
<p>Las propiedades especificadas dependen del adaptador de recursos utilizado por el conjunto. Los pares nombre-valor especificados por el usuario de esta tabla se pueden emplear para sobrescribir los valores predeterminados de las propiedades definidas por el proveedor del adaptador de recursos.</p>
<p>Si no especifica un valor para una propiedad, &eacute;sta se elimina de la tabla al finalizar la edici&oacute;n del conjunto de conexiones. Si no desea definir un valor para una propiedad ahora, pero desea que la propiedad permanezca en la tabla para que el valor se pueda definir m&aacute;s adelante, escriba un conjunto de par&eacute;ntesis vac&iacute;o en el campo Valor:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, escriba el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite su campo Valor.</p>
</li>
<li>
<p>Para eliminar una propiedad, seleccione la casilla de verificaci&oacute;n a la izquierda del campo Nombre de la propiedad que est&aacute; eliminando y, a continuaci&oacute;n, haga clic en el bot&oacute;n Eliminar propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Crear un Recurso de Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Editar un Recurso de Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Suprimir un Recurso de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Crear un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Editar un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avanzados de Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad para Pools de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad del Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Editar una Asignaci&oacute;n de Seguridad para un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suprimir un Pool de Conexiones de Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Configurar el Acceso EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Crear un Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Edici&oacute;n de un Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suprimir un Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Crear una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Editar una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suprimir una Asignaci&oacute;n de Seguridad de Trabajo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
