<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectorresourcenew"></a><h3>Para crear un recurso de conector</h3><a name="indexterm-1"></a><p><b>Antes de empezar</b></p><p>Antes de crear un recurso de conector, debe crear primero un conjunto
de conexiones de conector.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Recursos.</b></li>
<li><b>En el nodo Recursos, ampl&#237;e el nodo Conectores.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Recursos de conectores.</b><p>Se abrir&#225; la p&#225;gina Recursos de conectores.</p></li>
<li><b>En la p&#225;gina Recursos de conectores, haga clic en el bot&#243;n Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo recurso de conectores.</p></li>
<li><b>En el campo Nombre JNDI, introduzca un nombre JNDI &#250;nico para el
recurso de conector.</b><p>Por ejemplo: <tt>eis/miERP</tt>. </p></li>
<li><b>En la lista desplegable Nombre de conjunto, seleccione el conjunto de conexiones
al que pertenece el nuevo recurso de conector.</b></li>
<li><b>En el campo Descripci&#243;n, introduzca una descripci&#243;n del recurso de conector.</b></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado activado para habilitar el recurso de
conector en tiempo de ejecuci&#243;n.</b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li><b>En Destinos disponibles, seleccione el dominio, el cl&#250;ster o las instancias de
servidor donde residir&#225; el recurso de conector y haga clic en A&#241;adir.</b><p>Si no desea implementar el recurso de conector en uno de los
dominios, cl&#250;steres o instancias de servidor que se muestran en Destinos seleccionados,
seleccione el destino en el campo y haga clic en Eliminar.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique propiedades adicionales del recurso de conector.</b><p>Las propiedades disponibles dependen del adaptador de recursos para el conjunto de conexiones
de conectores.</p><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-connectorresourceedit.html">Para editar un recurso de conector</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Para borrar un recurso de conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolnew.html">Para crear un conjunto de conexiones de conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar un conjunto de conexiones de conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del conjunto de conexiones del conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar las propiedades del conjunto de conexiones del conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para crear un mapa de seguridad para un conjunto de conexiones de conectores</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar un mapa de seguridad para un conjunto de conexiones de conectores</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para eliminar un mapa de seguridad para un conjunto de conexiones de conectores</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para eliminar un conjunto de conexiones de conector</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Para configurar el acceso EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Para crear un recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Para editar un recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Para eliminar un recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Para crear un mapa de seguridad de tareas</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar un mapa de seguridad de tareas</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para eliminar un mapa de seguridad de tareas</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
