<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-resourceadapterconfigedit"></a><h4>Para editar una configuraci&#243;n del adaptador de recursos</h4><a name="indexterm-32"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Recursos.</b></li>
<li><b>En el nodo Recursos, seleccione el nodo Configuraci&#243;n de adaptadores de recursos.
</b><p>Se abre la p&#225;gina Configuraci&#243;n del adaptador de recursos. </p></li>
<li><b>En la p&#225;gina Configuraci&#243;n del adaptador de recursos, haga clic en el
nombre de la configuraci&#243;n del adaptador de recursos que desee editar. 
</b><p>Se abre la p&#225;gina Editar configuraci&#243;n del adaptador de recursos. </p></li>
<li><b>En la lista desplegable Id. del conjunto de subprocesos, seleccione el conjunto
de subprocesos que se debe utilizar para la configuraci&#243;n del adaptador de
recursos. </b></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique propiedades adicionales del adaptador de recursos.</b><p>Las propiedades disponibles son los nombres de m&#233;todos de establecimiento de la
clase a la que hace referencia el elemento <tt>resourceadapter-class</tt> del archivo <tt>ra.xml</tt>,
que define el nombre de clase del componente JavaBeans del adaptador de recursos. 
Las modificaciones en las propiedades definidas aqu&#237; sobreescriben los valores predeterminados presentes en
<tt>ra.xml</tt>. </p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite su campo Valor.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-resourceadapterconfignew.html">Para crear una configuraci&#243;n del adaptador de recursos</a></p>

</li>
<li><p><a href="task-resourceadapterconfigdelete.html">Para eliminar una configuraci&#243;n del adaptador de recursos</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
