<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Usuarios de archivo</h4>
<a name="indexterm-214"></a><p>Utilice la p&#225;gina Usuarios de archivo para administrar los usuarios de dominios
de <tt>archivo</tt>. Los usuarios y grupos del dominio <tt>file</tt> aparecen en el
archivo de claves, cuya ubicaci&#243;n est&#225; especificada por la propiedad <tt>file</tt>.</p>

<p>Los usuarios del dominio <tt>file</tt> pueden pertenecer a un <b>grupo Java</b>, una categor&#237;a
de usuarios clasificados por rasgos en com&#250;n. Por ejemplo, los clientes de
una aplicaci&#243;n de comercio electr&#243;nico pueden pertenecer al grupo <tt>CLIENTE</tt>, pero los
que m&#225;s gastan pertenecer&#237;an al grupo <tt>PREFERENTE</tt>. La clasificaci&#243;n de usuarios en
grupos simplifica el control del acceso de grandes n&#250;meros de usuarios.</p>

<p>Inicialmente, tras la instalaci&#243;n de GlassFish Server, el &#250;nico usuario es el
administrador introducido durante la instalaci&#243;n. Por defecto, este usuario pertenece al grupo
<tt>asadmin</tt>, en el dominio <tt>admin-realm</tt>, lo que le da derecho a modificar
GlassFish Server. Los usuarios asignados a este grupo tendr&#225;n privilegios de administrador,
es decir que podr&#225;n acceder a la herramienta <tt>asadmin</tt> y a la
Consola de administraci&#243;n.</p>

<p>La p&#225;gina Usuarios del archivo muestra una lista de usuarios del dominio
seleccionado. Para cada recurso, se proporciona la siguiente informaci&#243;n:</p>

<dl><dt>Id. de usuario</dt>
<dd><p>El nombre de usuario.</p>

</dd>
<dt>Lista de grupos</dt>
<dd><p>Los grupos a los que pertenece el usuario.</p>

</dd>
</dl>
<p>La tabla Usuarios de archivos tambi&#233;n contiene las siguientes opciones. </p>

<dl><dt>Nuevo</dt>
<dd><p>Bot&#243;n para crear un nuevo usuario. </p>

</dd>
<dt>Borrar</dt>
<dd><p>Bot&#243;n para eliminar uno o varios usuarios seleccionados. </p>

</dd>
</dl>
<a name="gkool"></a><h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-fileuserscreate.html">C&#243;mo a&#241;adir un usuario al dominio del archivo</a></p>

</li>
<li><p><a href="task-fileusersedit.html">C&#243;mo editar la informaci&#243;n de usuario de un dominio de archivos</a></p>

</li>
<li><p><a href="task-fileusersdelete.html">C&#243;mo eliminar a un usuario del dominio de archivos</a></p>

</li></ul>
<a name="gkonn"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-file-users-1"><tt>list-file-users</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-file-user-1"><tt>create-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-file-user-1"><tt>update-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-file-user-1"><tt>delete-file-user</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
