<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmpathsettings"></a><h4>Configuraci&#243;n de ruta JVM </h4>
<a name="indexterm-191"></a><p>Utilice la p&#225;gina Configuraci&#243;n de ruta JVM para configurar la ruta de
biblioteca nativa. La ruta de biblioteca nativa consiste en una concatenaci&#243;n de las
rutas siguientes:</p>


<ul><li><p>El prefijo de la ruta de biblioteca nativa</p>

</li>
<li><p>La ruta del servidor para sus bibliotecas nativas (es decir, <tt></tt><i>as-install</i><tt>/lib</tt>) </p>

</li>
<li><p>Los directorios de biblioteca nativa de 64 bits, si procede </p>

</li>
<li><p>El valor de la variable <tt>java.library.path</tt> para la JVM utilizada para iniciar GlassFish Server (este valor es distinto en diferentes sistemas operativos)</p>

</li>
<li><p>Las rutas que se especifican en la p&#225;gina <a href="ref-serverinstjvmprofiler.html">Configuraci&#243;n de analizador JVM</a>, si el analizador est&#225; habilitado </p>

</li>
<li><p>El sufijo de la ruta de biblioteca nativa</p>

</li></ul>
<p>Otros par&#225;metros de configuraci&#243;n se muestran como valores de s&#243;lo lectura para
los dominios que se han actualizado desde una versi&#243;n anterior de GlassFish Server.
 No son compatibles con la versi&#243;n v3. </p>

<p>La p&#225;gina Configuraci&#243;n de ruta JVM contiene las siguientes opciones.</p>

<dl><dt>Nombre de configuraci&#243;n</dt>
<dd><p>El nombre de la configuraci&#243;n a la que se aplican los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Ruta de clase de entorno</dt>
<dd><p>Si se activa la casilla de verificaci&#243;n Ignorar, se omitir&#225; la variable de entorno <tt>CLASSPATH</tt>. La variable de entorno <tt>CLASSPATH</tt> resulta c&#243;moda para tutoriales b&#225;sicos de programaci&#243;n, pero no se recomienda en entornos de empresa. &#201;ste es un campo de s&#243;lo lectura.</p>

</dd>
<dt>Ruta de clase del sistema</dt>
<dd><p>La ruta a las clases del sistema. &#201;ste es un campo de s&#243;lo lectura. </p>

</dd>
<dt>Prefijo de ruta de clase</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anteponer a la ruta de clase del servidor, una por l&#237;nea. &#201;ste es un campo de s&#243;lo lectura.</p>

</dd>
<dt>Sufijo de ruta de clase</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anexar a la ruta de clase del servidor, una por l&#237;nea. &#201;ste es un campo de s&#243;lo lectura.</p>

</dd>
<dt>Prefijo de ruta de biblioteca nativa</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anteponer a la ruta de biblioteca nativa, una por l&#237;nea.</p>

</dd>
<dt>Sufijo de ruta de biblioteca nativa</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anexar a la ruta de biblioteca nativa, una por l&#237;nea.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">Para configurar la configuraci&#243;n de ruta de JVM</a></p>

</li>
<li><p><a href="task-jvmpathsettings.html">Para configurar la configuraci&#243;n de ruta de JVM</a></p>

</li>
<li><p><a href="task-jvmoptions.html">Para configurar las opciones de JVM</a></p>

</li>
<li><p><a href="task-securitymanagerdisable.html">Para desactivar el gestor de seguridad</a></p>

</li>
<li><p><a href="task-jvmprofilersettings.html">Para ajustar la configuraci&#243;n del analizador de JVM</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jvm-options-1"><tt>create-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jvm-options-1"><tt>delete-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jvm-options-1"><tt>list-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-profiler-1"><tt>create-profiler</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-profiler-1"><tt>delete-profiler</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
