<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-manageadminrealm"></a><h4>Usuarios de administraci&#243;n</h4>
<a name="indexterm-216"></a><p>Utilice la p&#225;gina Usuarios de administrador para administrar los usuarios del <tt>dominio de administraci&#243;n</tt>. El
<tt>dominio de administraci&#243;n</tt> es un dominio de archivo. Los usuarios y grupos del dominio
<tt>file</tt> aparecen en el archivo de claves, cuya ubicaci&#243;n est&#225; especificada por
la propiedad <tt>file</tt>.</p>

<p>Inicialmente, tras la instalaci&#243;n de Servidor GlassFish, el &#250;nico usuario es el
administrador introducido durante la instalaci&#243;n. Por defecto, este usuario pertenece al grupo
<tt>asadmin</tt>, en el dominio <tt>admin-realm</tt>, lo que le da derecho a modificar
Servidor GlassFish. Los usuarios asignados a este grupo tendr&#225;n privilegios de administrador,
es decir que podr&#225;n acceder a la herramienta <tt>asadmin</tt> y a la
Consola de administraci&#243;n.</p>

<p>La p&#225;gina Usuarios de administraci&#243;n muestra una lista de los usuarios para
el dominio seleccionado. Para cada recurso, se proporciona la siguiente informaci&#243;n:</p>

<dl><dt>Id. de usuario</dt>
<dd><p>El nombre de usuario.</p>

</dd>
<dt>Lista de grupos</dt>
<dd><p>Los grupos a los que pertenece el usuario.</p>

</dd>
</dl>
<p>La tabla Usuarios de administraci&#243;n tambi&#233;n contiene las siguientes opciones. </p>

<dl><dt>Nuevo</dt>
<dd><p>Bot&#243;n para crear un nuevo usuario. </p>

</dd>
<dt>Borrar</dt>
<dd><p>Bot&#243;n para eliminar uno o varios usuarios seleccionados. </p>

</dd>
</dl>
<a name="gkomt"></a><h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-adminuserscreate.html">Para a&#241;adir un usuario al dominio de administraci&#243;n</a></p>

</li>
<li><p><a href="task-adminusersedit.html">Para editar la informaci&#243;n de los usuarios del dominio de administraci&#243;n</a></p>

</li>
<li><p><a href="task-adminusersdelete.html">Para eliminar un usuario del domino de administraci&#243;n</a></p>

</li></ul>
<a name="gkonq"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-file-users-1"><tt>list-file-users</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-file-user-1"><tt>create-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-file-user-1"><tt>update-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-file-user-1"><tt>delete-file-user</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
