<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-predefinedconfigsysproperties"></a><h4>Propiedades del sistema predefinidas </h4>
<p>Servidor GlassFish define la siguiente configuraci&#243;n de propiedades del sistema:</p>

<dl><dt><tt>ASADMIN_LISTENER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero de puerto del puerto HTTP o HTTPS puerto a trav&#233;s del cual el DAS se conecta a la instancia para administrar la instancia. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>HTTP_LISTENER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero del puerto que se utiliza para recibir las solicitudes HTTP. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>HTTP_SSL_LISTENER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero del puerto que se utiliza para recibir solicitudes HTTPS. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>IIOP_LISTENER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero del puerto que se utiliza para las conexiones IIOP. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>IIOP_SSL_LISTENER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero del puerto que se utiliza para conexiones IIOP seguras. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>IIOP_SSL_MUTUALAUTH_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero del puerto que se utiliza para conexiones IIOP seguras con autenticaci&#243;n de cliente. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>JAVA_DEBUGGER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero del puerto que se utiliza para las conexiones al depurador <a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">Java Platform Debugger Architecture (JPDA)</a>. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>JMS_PROVIDER_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero de puerto del proveedor de Java Message Service. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>JMX_SYSTEM_CONNECTOR_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero de puerto en el que escucha el conector JMX. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
<dt><tt>OSGI_SHELL_TELNET_PORT</tt></dt>
<dd><p>Esta propiedad especifica el n&#250;mero de puerto del puerto que se utiliza para las conexiones con<a href="http://felix.apache.org/site/apache-felix-remote-shell.html">Apache Felix Remote Shell</a>. Este shell utiliza el servicio Felix shell para interactuar con el subsistema de administraci&#243;n de m&#243;dulos OSGi. Los valores v&#225;lidos son 1&#8211;65535. En sistemas UNIX, la creaci&#243;n de sockets de escucha en los puertos 1-1024 requiere privilegios de superusuario.</p>

</dd>
</dl>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
