<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoringservice" name="ref-monitoringservice"></a><a id="GHCOM00129" name="GHCOM00129"></a></p>

<h4><a id="sthref449" name="sthref449"></a>Servicio de supervisi&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Servicio de supervisi&oacute;n para configurar opciones de supervisi&oacute;n de servicios o componentes del servidor individual.</p>
<p>Debe implementar una aplicaci&oacute;n, componente o servicio antes de configurar su supervisi&oacute;n.</p>
<p>La p&aacute;gina Servicio de supervisi&oacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de la configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Monitoring Service</dt>
<dd>
<p>Si la casilla de control Servicio de Supervisi&oacute;n Activado est&aacute; seleccionada, la supervisi&oacute;n est&aacute; activada para Servidor GlassFish. Esta opci&oacute;n se habilita por defecto.</p>
</dd>
<dt>MBeans de supervisi&oacute;n</dt>
<dd>
<p>Si la casilla de control MBeans de Supervisi&oacute;n Habilitados est&aacute; seleccionada, todos los MBeans necesarios para la supervisi&oacute;n estar&aacute;n desplegados en Servidor GlassFish. Esta opci&oacute;n se habilita por defecto.</p>
<p>Si la casilla de control no est&aacute; seleccionada, no podr&aacute; ver datos de supervisi&oacute;n en la Consola de Administraci&oacute;n incluso si la casilla de control Servicio de Supervisi&oacute;n est&aacute; seleccionada. En su lugar, debe utilizar la l&iacute;nea de comandos para ver los datos de supervisi&oacute;n. Si anula la selecci&oacute;n de la casilla de control, la huella de memoria de Servidor GlassFish se reduce.</p>
</dd>
<dt>DTrace</dt>
<dd>
<p>Si la casilla de control DTrace habilitado est&aacute; seleccionada y tiene supervisi&oacute;n de Oracle Enterprise Manager DTrace, puede usar la utilidad Solaris DTrace. Esta opci&oacute;n se deshabilita por defecto.</p>
</dd>
</dl>
<p>Para cada componente disponible, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Componente</dt>
<dd>
<p>Nombre del componente de Servidor GlassFish.</p>
</dd>
<dt>Nivel de supervisi&oacute;n</dt>
<dd>
<p>Nivel de supervisi&oacute;n determinado por el componente. Para cada componente est&aacute;n disponibles los niveles BAJO, ALTO Y DESACTIVADO. El nivel predeterminado es DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&oacute;n que ofrecen las opciones BAJO y ALTO de esta versi&oacute;n.</p>
</dd>
</dl>
<p>La tabla Configuraci&oacute;n de nivel de componentes tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Cambiar nivel</dt>
<dd>
<p>Bot&oacute;n para cambiar el nivel de supervisi&oacute;n de uno o m&aacute;s componentes seleccionados.</p>
</dd>
<dt>Nivel</dt>
<dd>
<p>Lista desplegable en la que puede seleccionar un nivel de supervisi&oacute;n para que se aplique a todos los componentes seleccionados.</p>
</dd>
</dl>
<a id="sthref450" name="sthref450"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">Configurar el Servicio de Supervisi&oacute;n</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Ver Datos de Supervisi&oacute;n de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Ver Datos de Supervisi&oacute;n de Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Ver Datos de Supervisi&oacute;n de Recurso</a></p>
</li>
</ul>
<a id="sthref451" name="sthref451"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
