<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityproviderconfig" name="ref-messagesecurityproviderconfig"></a><a id="GHCOM00121" name="GHCOM00121"></a></p>

<h4><a id="sthref429" name="sthref429"></a>Configuraciones del proveedor</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Consulte la p&aacute;gina Configuraciones del proveedor para configurar el proveedor de seguridad de mensajes en una capa de autenticaci&oacute;n SOAP o HttpServlet.</p>
<p>De manera predeterminada, cuatro proveedores est&aacute;n configurados en la capa de autenticaci&oacute;n SOAP.</p>
<p>Para cada configuraci&oacute;n de proveedor, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>ID de Proveedor</dt>
<dd>
<p>Nombre de la configuraci&oacute;n del proveedor.</p>
</dd>
<dt>Tipo de proveedor</dt>
<dd>
<p>Tipo de proveedor, que puede ser cualquiera de los siguientes:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n de clientes.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n del servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que el proveedor es tanto el proveedor de autenticaci&oacute;n del servidor como del cliente.</p>
</dd>
</dl>
</dd>
<dt>Proveedor predeterminado</dt>
<dd>
<p>Si se configura en <code>true</code>, el proveedor ser&aacute; el proveedor predeterminado.</p>
</dd>
<dt>Nombre de clase</dt>
<dd>
<p>Nombre de la clase de implementaci&oacute;n de Java del proveedor.</p>
</dd>
</dl>
<p>La tabla Configuraciones de proveedor tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nueva</dt>
<dd>
<p>Bot&oacute;n para crear una nueva configuraci&oacute;n de proveedor.</p>
</dd>
<dt>Borrar</dt>
<dd>
<p>Bot&oacute;n para eliminar una o m&aacute;s configuraciones de proveedor seleccionadas.</p>
</dd>
</dl>
<a id="sthref430" name="sthref430"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar Utilidades de Servidor GlassFish para que las Utilicen los Proveedores de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Crear una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Editar una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Crear una Configuraci&oacute;n de Proveedores de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una Configuraci&oacute;n de Proveedor de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suprimir una Configuraci&oacute;n de Proveedor de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la Seguridad de Mensajes para los Clientes de Aplicaciones</a></p>
</li>
</ul>
<a id="sthref431" name="sthref431"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00045"><code>create-message-security-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00184"><code>list-message-security-providers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00097"><code>delete-message-security-provider</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
