<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jaccproviders" name="ref-jaccproviders"></a><a id="GHCOM00114" name="GHCOM00114"></a></p>

<h4><a id="sthref409" name="sthref409"></a>Proveedores JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Proveedores JACC para configurar los proveedores de Java Authorization Contract for Containers (JACC) para la instancia o cl&uacute;ster de Servidor GlassFish seleccionado.</p>
<p>Los proveedores de JACC los pueden utilizar m&oacute;dulos de autorizaci&oacute;n de terceros para aplicaciones que se ejecuten en Servidor GlassFish. La instalaci&oacute;n de Servidor GlassFish por defecto incluye dos proveedores JACC, denominados <code>default</code> y <code>simple</code>. Estos proveedores predeterminados implementan un motor de autorizaci&oacute;n simple, basado en archivos, que cumple la especificaci&oacute;n JACC. Tambi&eacute;n puede crear sus propios proveedores JACC personalizados. Consulte <a href="task-jaccprovidernew.html">Crear un Proveedor JACC</a>.</p>
<p>Para obtener informaci&oacute;n acerca de c&oacute;mo escribir clases de implementaci&oacute;n para un proveedor JACC, consulte la especificaci&oacute;n JACC en <code><a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a></code>.</p>
<p>Se proporciona la siguiente informaci&oacute;n para cada proveedor JACC.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre del proveedor JACC. Este nombre se utiliza para hacer referencia al elemento <code>jacc-provider</code> elemento en <code>domain.xml</code>.</p>
</dd>
<dt>Configuraci&oacute;n de directivas</dt>
<dd>
<p>El nombre de clase completo de <code>javax.security.jacc.PolicyConfigurationFactory.provider</code> que implementa el <code>javax.security.jacc.PolicyConfigurationFactory</code> espec&iacute;fico del proveedor.</p>
</dd>
<dt>Proveedor de directivas</dt>
<dd>
<p>El nombre de clase completo de <code>javax.security.jacc.policy.provider</code> que implementa <code>java.security.Policy</code>.</p>
</dd>
</dl>
<p>Los proveedores JACC por defecto tambi&eacute;n soportan la siguiente propiedad.</p>
<dl>
<dt>repository</dt>
<dd>
<p>Directorio que contiene el archivo de pol&iacute;tica de JACC. Para el proveedor JACC de Servidor GlassFish <code>por defecto</code>, el directorio por defecto es <code>${com.sun.aas.instanceRoot}/generated/policy</code>. Esta propiedad no est&aacute; definida por defecto para el proveedor JACC Servidor GlassFish <code>simple</code>.</p>
</dd>
</dl>
<p>La tabla Proveedores JACC tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear un nuevo proveedor JACC.</p>
</dd>
<dt>Borrar</dt>
<dd>
<p>Bot&oacute;n para eliminar uno o m&aacute;s proveedores JACC seleccionados.</p>
</dd>
</dl>
<a id="sthref410" name="sthref410"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">Crear un Proveedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccprovideredit.html">Editar un Proveedor de JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Suprimir un Proveedor de JACC</a></p>
</li>
</ul>
<a id="sthref411" name="sthref411"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
