<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a><a id="GHCOM00130" name="GHCOM00130"></a></p>

<h4><a id="sthref452" name="sthref452"></a> <a id="sthref453" name="sthref453"></a>Propiedades del sistema</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Propiedades de sistema muestra una lista de las propiedades del sistema Java definidas en la configuraci&oacute;n con nombre seleccionada. Las propiedades del sistema Java se transfieren al iniciador de aplicaciones Java mediante la opci&oacute;n <code>-D</code> del iniciador de aplicaciones Java al iniciar Servidor GlassFish.</p>
<p>Estas propiedades definen la configuraci&oacute;n de puertos predeterminada para todas las instancias de Servidor GlassFish que hacen referencia a la configuraci&oacute;n.</p>
<p>Para obtener informaci&oacute;n sobre los par&aacute;metros de puertos predefinidos en una configuraci&oacute;n, consulte <a href="ref-predefinedconfigsysproperties.html">Propiedades del sistema predefinidas</a>.</p>
<p>Para cada propiedad se muestra la informaci&oacute;n siguiente:</p>
<dl>
<dt>Nombre de variable de instancia</dt>
<dd>
<p>Nombre de la propiedad del sistema.</p>
</dd>
<dt>Valor predeterminado</dt>
<dd>
<p>Valor que se define para la propiedad en la configuraci&oacute;n especificada a la que hace referencia la instancia. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Valores de instancia</dt>
<dd>
<p>Un enlace a la p&aacute;gina <a href="ref-sysinstancevalues.html">Valores de instancias</a> de la propiedad.</p>
</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Agregar propiedad</dt>
<dd>
<p>Bot&oacute;n para agregar una propiedad. Al hacer clic en este bot&oacute;n se agrega una fila a la tabla Propiedades Adicionales.</p>
</dd>
<dt>Suprimir Propiedades</dt>
<dd>
<p>Bot&oacute;n para suptimir una o varias propiedades seleccionadas. Cualquier propiedad que se elimine vuelve a su valor predeterminado o, si no se ha definido ning&uacute;n valor predeterminado, se queda sin definir.</p>
</dd>
</dl>
<p>La p&aacute;gina Propiedades de sistema tambi&eacute;n contiene las opciones siguientes:</p>
<dl>
<dt>Nombre de la configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Reconfiguraci&oacute;n din&aacute;mica</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; habilitada, los cambios realizados en la configuraci&oacute;n se aplican a las instancias que hacen referencia a la configuraci&oacute;n sin necesidad de reiniciar dichas instancias.</p>
</dd>
<dt>Clusters y/o instancias que utilizan esta configuraci&oacute;n</dt>
<dd>
<p>Una lista de los cl&uacute;steres y las instancias que hacen referencia a la configuraci&oacute;n, con una indicaci&oacute;n de si cada cl&uacute;ster o instancia se est&aacute; ejecutando:</p>
<ul>
<li>
<p>Si el cl&uacute;ster o instancia se est&aacute; ejecutando, se muestra una marca de verificaci&oacute;n (&#10003;).</p>
</li>
<li>
<p>Si el cl&uacute;ster o instancia est&aacute; detenido, se muestra un signo de exclamaci&oacute;n (<code>!</code>).</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref454" name="sthref454"></a>
<h5>Tareas relacionadas</h5>
<p>C&oacute;mo definir los valores predeterminados de las propiedades de configuraci&oacute;n</p>
<a id="sthref455" name="sthref455"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
