<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-update" name="ref-uc-update"></a><a id="GHCOM00135" name="GHCOM00135"></a></p>

<h4><a id="sthref471" name="sthref471"></a>Actualizaciones disponibles</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Actualizaciones disponibles ofrece informaci&oacute;n sobre las &uacute;ltimas versiones de los componentes de la imagen de instalaci&oacute;n que est&aacute;n instalados.</p>
<p>Para instalar las actualizaciones disponibles, primero debe detener el dominio de Servidor GlassFish. A continuaci&oacute;n, utilice uno de estos comandos:</p>
<ul>
<li>
<p><code>glassfish3/bin/updatetool</code>, que inicia la utilidad gr&aacute;fica Herramienta de actualizaci&oacute;n</p>
</li>
<li>
<p><code>glassfish3/bin/pkg</code>, una versi&oacute;n de l&iacute;nea de comandos de la herramienta de actualizaci&oacute;n</p>
</li>
</ul>
<p>Para obtener informaci&oacute;n sobre el uso del comando <code>pkg</code>, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, <i>Ampliaci&oacute;n y actualizaci&oacute;n de GlassFish Server</i>, en <i>Oracle GlassFish Server Administration Guide</i></a>. La utilidad Herramienta de actualizaci&oacute;n tiene su propia ayuda en l&iacute;nea.</p>
<p>Reinicie el servidor despu&eacute;s de que haya acabado de instalar las actualizaciones.</p>
<p>La p&aacute;gina Actualizaciones disponibles contiene las siguientes opciones.</p>
<dl>
<dt>Ruta de instalaci&oacute;n</dt>
<dd>
<p>Ruta del sistema de archivos de la ra&iacute;z o directorio superior de la imagen de instalaci&oacute;n.</p>
</dd>
<dt>Actualizaciones disponibles</dt>
<dd>
<p>Para cada componente para el que haya disponible una versi&oacute;n m&aacute;s reciente, en esta tabla se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Componente</dt>
<dd>
<p>Nombre del componente.</p>
</dd>
<dt>Categor&iacute;a</dt>
<dd>
<p>Categor&iacute;a del software al que se asocia el componente, por ejemplo, servidores de aplicaciones, herramientas de sistemas y bases de datos. El autor del componente le asigna la categor&iacute;a al mismo cuando se crea el componente.</p>
</dd>
<dt>Versi&oacute;n instalada</dt>
<dd>
<p>El n&uacute;mero de versi&oacute;n del paquete en el que se proporciona el componente actual.</p>
</dd>
<dt>Nueva versi&oacute;n</dt>
<dd>
<p>El n&uacute;mero de versi&oacute;n de la actualizaci&oacute;n disponible.</p>
</dd>
<dt>Cambiar</dt>
<dd>
<p>Diferencia de tama&ntilde;o entre la versi&oacute;n instalada y la actualizaci&oacute;n disponible.</p>
</dd>
<dt>Origen</dt>
<dd>
<p>El nombre del <a href="ref-uc-concepts.html#ref-uc-about-repository">Dep&oacute;sito de red</a> del que se obtendr&iacute;a el componente.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref472" name="sthref472"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-uc-update.html">Ver Actualizaciones Disponibles para Componentes</a></p>
<a id="sthref473" name="sthref473"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguna.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
