<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmgeneral"></a><h4>Configuraci&#243;n general JVM</h4>
<a name="indexterm-190"></a><p>La M&#225;quina virtual Java (JVM) permiten la ejecuci&#243;n de los c&#243;digos de
bytes de Java en una m&#225;quina f&#237;sica. Al ajustar los valores de
configuraci&#243;n de JVM, mejora el rendimiento y se evitan errores de asignaci&#243;n
de memoria.</p>

<p>La m&#225;quina virtual de Java se incluye en la plataforma Java, Standard
Edition (plataforma Java SE), que necesita GlassFish Server. La introducci&#243;n de valores
incorrectos para la configuraci&#243;n de JVM har&#225; que no funcione el servidor,
por lo que tiene que ir con cuidado a la hora de
cambiar estos valores.</p>


<hr><p><b>Nota - </b>Los t&#233;rminos &#8220;m&#225;quina virtual de Java&#8221; y &#8220;JVM&#8221; hacen referencia a una
m&#225;quina virtual para la plataforma Java.</p>


<hr>
<p>La p&#225;gina Configuraci&#243;n general de JVM contiene las siguientes opciones.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer los valores predeterminados de todos los par&#225;metros de configuraci&#243;n.</p>

</dd>
<dt>Nombre de configuraci&#243;n</dt>
<dd><p>El nombre de la configuraci&#243;n a la que se aplican los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Inicio de Java</dt>
<dd><p>Nombre del directorio de instalaci&#243;n del software de Java SE, que necesita GlassFish Server para poder ejecutarse. Para comprobar que la versi&#243;n del software Java SE que se especifica sea compatible con esta versi&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2434&id=sjsaseern"><i>Oracle GlassFish Server 3.1 Release Notes</i></a>. Si introduce un nombre de directorio inexistente o un directorio para una versi&#243;n no compatible del software de Java SE, GlassFish Server no se podr&#225; iniciar.</p>

</dd>
<dt>Opciones de Javac</dt>
<dd><p>Opciones de l&#237;nea de comandos para el compilador del lenguaje de programaci&#243;n de Java. GlassFish Server ejecuta el compilador cuando se implementan los componentes de Enterprise JavaBeans (EJB).</p>

</dd>
<dt>Depuraci&#243;n</dt>
<dd><p>Habilita la depuraci&#243;n con Java Platform Debugger Architecture (JPDA).</p>

<p>Los desarrolladores de aplicaciones utilizan JPDA. Para obtener m&#225;s informaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2418&id=sjsaseedg"><i>Oracle GlassFish Server 3.1 Application Development Guide</i></a>.</p>

</dd>
<dt>Opciones de depuraci&#243;n</dt>
<dd><p>Especifica las opciones de JPDA que enviar&#225; a JVM cuando se habilite la depuraci&#243;n.</p>

</dd>
<dt>Opciones de compilaci&#243;n RMI</dt>
<dd><p>Opciones de l&#237;nea de comandos para el compilador <tt>rmic</tt>. GlassFish Server ejecuta el compilador <tt>rmic</tt> cuando se implementan componentes EJB.</p>

</dd>
<dt>Preprocesador de c&#243;digo byte</dt>
<dd><p>Nombres de clases para el preprocesamiento de c&#243;digo byte. Utilice comas para separar los nombres de clase. Cada clase debe implementar la interfaz com.sun.appserv.BytecodePreprocessor . Las clases se llaman en el orden especificado.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales para JVM. GlassFish Server no define ninguna propiedad adicional para JVM.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">Para configurar la configuraci&#243;n de ruta de JVM</a></p>

</li>
<li><p><a href="task-jvmpathsettings.html">Para configurar la configuraci&#243;n de ruta de JVM</a></p>

</li>
<li><p><a href="task-jvmoptions.html">Para configurar las opciones de JVM</a></p>

</li>
<li><p><a href="task-securitymanagerdisable.html">Para desactivar el gestor de seguridad</a></p>

</li>
<li><p><a href="task-jvmprofilersettings.html">Para ajustar la configuraci&#243;n del analizador de JVM</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Ninguno.</p>



<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
