<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-pkgdetails" name="ref-uc-pkgdetails"></a><a id="GHCOM00137" name="GHCOM00137"></a></p>

<h4><a id="sthref477" name="sthref477"></a>Detalles de los componentes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Detalles de los componentes ofrece informaci&oacute;n detallada sobre un componente.</p>
<p>La p&aacute;gina Detalles de los componentes incluye las opciones siguientes.</p>
<dl>
<dt>Atr&aacute;s</dt>
<dd>
<p>Este bot&oacute;n se utiliza para regresar a la p&aacute;gina donde ha seleccionado el componente del cual est&aacute;s visualizando los detalles.</p>
</dd>
<dt>Nombre del paquete</dt>
<dd>
<p>Nombre del paquete en el que se proporciona el componente .</p>
</dd>
<dt>Identificador &uacute;nico</dt>
<dd>
<p>Identificador completo de este componente tal y como existe en el dep&oacute;sito.</p>
</dd>
<dt>Categor&iacute;a</dt>
<dd>
<p>Categor&iacute;a del software al que se asocia el componente, por ejemplo, servidores de aplicaciones, herramientas de sistemas y bases de datos. El autor del componente le asigna la categor&iacute;a al mismo cuando se crea el componente.</p>
</dd>
<dt>Versi&oacute;n</dt>
<dd>
<p>N&uacute;mero de versi&oacute;n del paquete en el que se proporciona el componente.</p>
</dd>
<dt>Fecha publicada</dt>
<dd>
<p>Fecha y hora en la que esta versi&oacute;n del componente se public&oacute; en el dep&oacute;sito. Esta fecha <i>no</i> es la fecha y hora en la que el componente se instal&oacute; en la imagen de instalaci&oacute;n.</p>
</dd>
<dt>Tama&ntilde;o instalado</dt>
<dd>
<p>Cantidad de espacio en disco que consume la instalaci&oacute;n del componente.</p>
</dd>
<dt>Origen</dt>
<dd>
<p>Para un componente instalado: nombre del <a href="ref-uc-concepts.html#ref-uc-about-repository">Dep&oacute;sito de red</a> desde el que se consigui&oacute; el componente.</p>
<p>Para un componente de complementos o actualizaci&oacute;n: nombre del dep&oacute;sito de red desde el que se obtendr&iacute;a el componente.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Ofrece una descripci&oacute;n general del componente.</p>
</dd>
</dl>
<a id="sthref478" name="sthref478"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-uc-pkgdetails.html">Ver Informaci&oacute;n Detallada sobre un Componente</a></p>
<a id="sthref479" name="sthref479"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguna.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
