<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-monitoringservice"></a><h4>Servicio de supervisi&#243;n</h4>
<a name="indexterm-242"></a><p>Utilice la p&#225;gina Servicio de supervisi&#243;n para configurar opciones de supervisi&#243;n de
servicios o componentes del servidor individual.</p>

<p>Debe implementar una aplicaci&#243;n, componente o servicio antes de configurar su supervisi&#243;n. </p>

<p>La p&#225;gina Servicio de supervisi&#243;n contiene las siguientes opciones.</p>

<dl><dt>Configuration Name</dt>
<dd><p>El nombre de la configuraci&#243;n a la que aplicar los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Monitoring Service</dt>
<dd><p>Si la casilla de verificaci&#243;n Servicio de supervisi&#243;n habilitado est&#225; seleccionada, la supervisi&#243;n est&#225; habilitada para Servidor GlassFish. Esta opci&#243;n se habilita por defecto.</p>

</dd>
<dt>MBeans de supervisi&#243;n</dt>
<dd><p>Si la casilla de verificaci&#243;n MBeans de supervisi&#243;n habilitados est&#225; seleccionada, todos los MBeans necesarios para la supervisi&#243;n estar&#225;n implementados en Servidor GlassFish. Esta opci&#243;n se habilita por defecto.</p>

<p>Si la casilla de verificaci&#243;n no est&#225; seleccionada, no podr&#225; ver datos de supervisi&#243;n en la Consola de administraci&#243;n incluso si la casilla de verificaci&#243;n Servicio de supervisi&#243;n est&#225; seleccionada. En su lugar, debe utilizar la l&#237;nea de comandos para ver los datos de supervisi&#243;n. Si anula la selecci&#243;n de la casilla de verificaci&#243;n, la huella de memoria de Servidor GlassFish se reduce. </p>

</dd>
<dt>DTrace</dt>
<dd><p>Si la casilla de verificaci&#243;n DTrace habilitado est&#225; seleccionada y tiene supervisi&#243;n de Oracle Enterprise Manager DTrace, puede usar la utilidad Solaris DTrace. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
</dl>
<p>Para cada componente disponible, se proporciona la siguiente informaci&#243;n.</p>

<dl><dt>Componente</dt>
<dd><p>Nombre del componente de Servidor GlassFish.</p>

</dd>
<dt>Nivel de supervisi&#243;n</dt>
<dd><p>Nivel de supervisi&#243;n determinado por el componente. Para cada componente est&#225;n disponibles los niveles BAJO, ALTO Y DESACTIVADO. El nivel predeterminado es DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&#243;n que ofrecen las opciones BAJO y ALTO de esta versi&#243;n.</p>

</dd>
</dl>
<p>La tabla Configuraci&#243;n de nivel de componentes tambi&#233;n contiene las siguientes opciones.
</p>

<dl><dt>Cambiar nivel</dt>
<dd><p>Bot&#243;n para cambiar el nivel de supervisi&#243;n de uno o m&#225;s componentes seleccionados.</p>

</dd>
<dt>Nivel</dt>
<dd><p>Lista desplegable en la que puede seleccionar un nivel de supervisi&#243;n para que se aplique a todos los componentes seleccionados. </p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-confmonitor.html">C&#243;mo configurar el servicio de supervisi&#243;n</a></p>

</li>
<li><p><a href="task-appmonitoringdata.html">Visualizaci&#243;n de datos de supervisi&#243;n de la aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-servermonitoringdata.html">Visualizaci&#243;n de datos de supervisi&#243;n del servidor</a></p>

</li>
<li><p><a href="task-resourcemonitoringdata.html">Para ver los datos de supervisi&#243;n de recursos</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-monitoring-1"><tt>enable-monitoring</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-monitoring-1"><tt>disable-monitoring</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=monitor-1"><tt>monitor</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
