<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-endpoint"></a><h4>Informaci&#243;n de punto final del servicio web </h4>
<a name="indexterm-168"></a><a name="indexterm-169"></a><a name="indexterm-170"></a><p>Utilice la p&#225;gina Informaci&#243;n de punto final del servicio web para ver
informaci&#243;n sobre el punto final de un servicio web. </p>

<p>La p&#225;gina Informaci&#243;n de punto final del servicio web contiene la siguiente
informaci&#243;n. </p>

<dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>El nombre de la aplicaci&#243;n implementada. Haga clic en este enlace o en el bot&#243;n Atr&#225;s para volver a la p&#225;gina Editar aplicaci&#243;n. </p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Probador</dt>
<dd><p>El v&#237;nculo Probador s&#243;lo est&#225; visible si Tipo de implementaci&#243;n es distinto de RI (por ejemplo, 109). Haga clic en este v&#237;nculo para ver una p&#225;gina que permita proporcionar par&#225;metros para probar los m&#233;todos del servicio web.</p>

</dd>
<dt>WSDL</dt>
<dd><p>El idioma de definici&#243;n de los servicios web (WSDL) para el punto final. Haga clic en este v&#237;nculo para ver el archivo WSDL en una nueva pesta&#241;a o ventana del explorador. </p>

<p>Tenga en cuenta que algunos navegadores tratan de interpretar el c&#243;digo fuente WSDL al hacer clic en el v&#237;nculo WSDL, de modo que muestran una p&#225;gina en blanco. Para estos navegadores, utilice el comando Ver c&#243;digo fuente del navegador en la p&#225;gina en blanco para ver el c&#243;digo fuente WSDL.</p>

</dd>
<dt>Nombre del punto final</dt>
<dd><p>El nombre del punto final.</p>

</dd>
<dt>Nombre del servicio</dt>
<dd><p>El nombre del servicio web.</p>

</dd>
<dt>Nombre del puerto</dt>
<dd><p>El nombre del puerto del servicio web.</p>

</dd>
<dt>Tipo de implementaci&#243;n</dt>
<dd><p>El tipo de implementaci&#243;n del servicio web (por ejemplo, RI o 109). </p>

</dd>
<dt>Tipo de implementaci&#243;n</dt>
<dd><p>El tipo de implementaci&#243;n del servicio web (por ejemplo, SERVLET o EJB). </p>

</dd>
<dt>Nombre de clase de implementaci&#243;n</dt>
<dd><p>El nombre de la clase de implementaci&#243;n del servicio web.</p>

</dd>
<dt>URI de direcci&#243;n de punto final</dt>
<dd><p>El URI de la direcci&#243;n del punto final. </p>

</dd>
<dt>Espacio de nombre</dt>
<dd><p>El espacio de nombre de destino asociado con el servicio web. </p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n del punto final, si existe.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-endpoint.html">Para ver informaci&#243;n de punto final de un servicio web </a></p>

</li>
<li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p>

</li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-apprestart.html">C&#243;mo recargar una aplicaci&#243;n implementada</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
