<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-config" name="ref-uc-config"></a><a id="GHCOM00138" name="GHCOM00138"></a></p>

<h4><a id="sthref480" name="sthref480"></a>Configuraci&oacute;n de la Herramienta de Actualizaci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Configuraci&oacute;n ofrece informaci&oacute;n de configuraci&oacute;n sobre Herramienta de Actualizaci&oacute;n y permite cambiar c&oacute;mo se conecta a Internet Herramienta de Actualizaci&oacute;n. Para modificar otros aspectos de la configuraci&oacute;n de Herramienta de Actualizaci&oacute;n, utilice la aplicaci&oacute;n <code>updatetool</code>, que se encuentra en <i>as-install-parent</i><code>/bin</code>.</p>
<p>La p&aacute;gina Configuraci&oacute;n de Herramienta de Actualizaci&oacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Ruta de instalaci&oacute;n</dt>
<dd>
<p>Ruta del sistema de archivos de la ra&iacute;z o directorio superior de la imagen de instalaci&oacute;n.</p>
</dd>
<dt>Dep&oacute;sito preferido</dt>
<dd>
<p>Nombre del dep&oacute;sito de red preferido que se asocia con esta imagen de instalaci&oacute;n, por ejemplo, <code>glassfish.org</code>.</p>
</dd>
<dt>Conexi&oacute;n a Internet</dt>
<dd>
<p>C&oacute;mo conectar Servidor GlassFish a Internet:</p>
<dl>
<dt>Conexi&oacute;n directa</dt>
<dd>
<p>Esta opci&oacute;n especifica que Servidor GlassFish se conecta directamente a Internet.</p>
</dd>
<dt>Mediante un servidor proxy</dt>
<dd>
<p>Esta opci&oacute;n especifica que Servidor GlassFish se conecta a Internet mediante un servidor proxy. Cuando esta opci&oacute;n est&aacute; seleccionada, se incluir&aacute;n en esta p&aacute;gina el campo Host del proxy y el campo Puerto del proxy.</p>
</dd>
</dl>
</dd>
<dt>Host del proxy</dt>
<dd>
<p>El nombre de host del servidor proxy del equipo en el que se est&aacute; ejecutando Servidor GlassFish.</p>
<p>Este campo s&oacute;lo es aplicable si el equipo en el que se est&aacute; ejecutando Servidor GlassFish se conecta a Internet a trav&eacute;s de un servidor proxy.</p>
</dd>
<dt>Puerto del proxy</dt>
<dd>
<p>El n&uacute;mero de puerto del servidor proxy del equipo en el que se est&aacute; ejecutando Servidor GlassFish.</p>
<p>Este campo s&oacute;lo es aplicable si el equipo en el que se est&aacute; ejecutando Servidor GlassFish se conecta a Internet a trav&eacute;s de un servidor proxy.</p>
</dd>
<dt>Dep&oacute;sitos</dt>
<dd>
<p>Esta tabla ofrece la siguiente informaci&oacute;n sobre todos los dep&oacute;sitos de red que est&aacute;n asociados con esta imagen de instalaci&oacute;n:</p>
<dl>
<dt>Dep&oacute;sito</dt>
<dd>
<p>El nombre del dep&oacute;sito, por ejemplo, <code>dev.glassfish.org</code>.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref481" name="sthref481"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-uc-set-proxy.html">Definir la Configuraci&oacute;n de Proxy de Red para Acceder a los Repositorios de Red</a></p>
<a id="sthref482" name="sthref482"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
