<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a><a id="GHCOM00120" name="GHCOM00120"></a></p>

<h4><a id="sthref426" name="sthref426"></a>Editar las configuraciones de seguridad de los mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Consulte la p&aacute;gina Editar configuraci&oacute;n de seguridad de mensajes para habilitar a los proveedores de la seguridad de mensajes.</p>
<p>Para habilitar la seguridad de los mensajes para puntos finales de servicios web implementados en Servidor GlassFish, debe especificar un proveedor para usar por defecto en el servidor. Si activa un proveedor predeterminado para la seguridad de los mensajes, tambi&eacute;n tendr&aacute; que habilitar proveedores para ser usados por clientes de los servicios web implementados en Servidor GlassFish. Encontrar&aacute; informaci&oacute;n sobre la habilitaci&oacute;n de los proveedores usados por clientes en <a href="task-enablemesec4appclients.html">Activar la Seguridad de Mensajes para los Clientes de Aplicaciones</a>.</p>
<p>Para habilitar la seguridad de los mensajes para invocaciones de servicios web que se originan en puntos finales implementados, debe especificar un proveedor de cliente predeterminado. Si ha activado un proveedor de cliente predeterminado para Servidor GlassFish, debe asegurarse que los servicios invocados de los puntos finales implementados en Servidor GlassFish est&aacute;n configurados de forma compatible para la seguridad de la capa de mensajes.</p>
<p>La p&aacute;gina Editar configuraci&oacute;n de seguridad de mensajes contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de la configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Capa de autenticaci&oacute;n</dt>
<dd>
<p>Capa del mensaje en la que se lleva a cabo la autenticaci&oacute;n. &Eacute;ste es un campo de solo lectura. El valor puede ser <code>SOAP</code> (para configuraci&oacute;n de seguridad de mensajes predeterminada) o <code>HttpServlet</code>.</p>
</dd>
<dt>Proveedor predeterminado</dt>
<dd>
<p>Proveedor de servidor predeterminado, si lo hubiera. El proveedor de servidor predeterminado, tambi&eacute;n llamado proveedor predeterminado, identifica el proveedor de servidor invocado para una aplicaci&oacute;n que no identifica un proveedor de servidor espec&iacute;fico. Las opciones disponibles son <code>ServerProvider</code>, <code>XWS_ServerProvider</code> o ninguno. De manera predeterminada no hay ning&uacute;n proveedor predeterminado, por tanto Servidor GlassFish no invocar&aacute; un proveedor de seguridad de mensajes para el servidor. Generalmente, debe seleccionar <code>ServerProvider</code> como proveedor predeterminado.</p>
</dd>
<dt>Proveedor de cliente predeterminado</dt>
<dd>
<p>Proveedor de cliente predeterminado, so lo hubiera. El proveedor de cliente predeterminado identifica el proveedor de cliente invocado para una aplicaci&oacute;n que no identifica un proveedor de cliente espec&iacute;fico. Las opciones disponibles son <code>ClientProvider</code>, <code>XWS_ClientProvider</code> o ninguno. De manera predeterminada no hay ning&uacute;n proveedor seleccionado, por tanto Servidor GlassFish no invocar&aacute; un proveedor de seguridad de mensajes para clientes. Generalmente, no debe seleccionar ninguno como proveedor de clientes. Seleccione <code>ClientProvider</code> para habilitar un proveedor predeterminado y una directiva de protecci&oacute;n de mensajes para aplicar a las llamadas a servicios web que se originan en los puntos finales de servicios web implementados en Servidor GlassFish.</p>
</dd>
</dl>
<a id="sthref427" name="sthref427"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar Utilidades de Servidor GlassFish para que las Utilicen los Proveedores de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Crear una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Editar una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Crear una Configuraci&oacute;n de Proveedores de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una Configuraci&oacute;n de Proveedor de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suprimir una Configuraci&oacute;n de Proveedor de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la Seguridad de Mensajes para los Clientes de Aplicaciones</a></p>
</li>
</ul>
<a id="sthref428" name="sthref428"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Utilice el comando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> para modificar la configuraci&oacute;n de seguridad de mensajes.</p>
<ul>
<li>
<p>C&oacute;mo especificar el proveedor de servidor predeterminado:</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>C&oacute;mo especificar el proveedor de cliente predeterminado:</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
