<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-appedit"></a><h4>Editar aplicaci&#243;n</h4>
<a name="indexterm-162"></a><p>Utilice la p&#225;gina Editar aplicaci&#243;n para modificar una aplicaci&#243;n existente.</p>

<p>La p&#225;gina Editar aplicaci&#243;n contiene algunas o todas las opciones siguientes, en
funci&#243;n del tipo de aplicaci&#243;n. </p>

<dl><dt>Nombre</dt>
<dd><p>Campo de solo lectura que muestra el nombre de la aplicaci&#243;n que est&#225; editando.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Estado</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la aplicaci&#243;n. Esta opci&#243;n est&#225; seleccionada por defecto.</p>

</dd>
<dt>Ra&#237;z de contexto</dt>
<dd><p>Para una aplicaci&#243;n web, se especifica la ruta de la aplicaci&#243;n. En la URL de la aplicaci&#243;n web, la ra&#237;z de contexto sigue inmediatamente al n&#250;mero de puerto (<tt>http://<i>host</i>:<i>puerto</i>/<i> ra&#237;z de contexto</i>/...</tt>). La ra&#237;z de contexto debe comenzar por una barra diagonal, por ejemplo, <tt>/hello</tt>.</p>

</dd>
<dt>Disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la alta disponibilidad para la aplicaci&#243;n de puntos de control de SFSB y posiblemente para la pasivaci&#243;n. Si se configura como False (el valor predeterminado), se inhabilita el guardado de sesiones web y puntos de control de SFSB para la aplicaci&#243;n, aplicaci&#243;n web o m&#243;dulo EJB especificado. Si se define como true, la aplicaci&#243;n o m&#243;dulo especificados se habilita para alta disponibilidad. Establezca esta opci&#243;n como true s&#243;lo si se ha configurado y habilitado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor. </p>

<p>Esta opci&#243;n aparece si existen cl&#250;steres o instancias independientes del servidor aparte de la instancia de servidor predeterminada (<tt>server</tt>).</p>

</dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p>

<p>La opci&#243;n Servidores virtuales aparece si solo existe la instancia de servidor predeterminada, <tt>server</tt>. Si existen cl&#250;steres u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&#233;s de la implementaci&#243;n. Vaya a la p&#225;gina Editar aplicaci&#243;n, seleccione la ficha Destino y seleccione Administrar servidores virtuales para el destino que desee.</p>

</dd>
<dt>Java Web Start</dt>
<dd><p>(Para algunos tipos de aplicaciones) Si se selecciona la casilla de verificaci&#243;n Habilitado, la aplicaci&#243;n emplear&#225; el software Java Web Start. Java Web Start proporciona una forma independiente de los navegadores de implementar aplicaciones Java para que se ejecuten en una m&#225;quina virtual de Java espec&#237;fica.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Breve descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
<dt>Ubicaci&#243;n</dt>
<dd><p>La ubicaci&#243;n de la aplicaci&#243;n implementada. &#201;ste es un campo de s&#243;lo lectura. </p>

</dd>
<dt>Bibliotecas</dt>
<dd><p>Los archivos JAR de biblioteca que necesitar&#225; la aplicaci&#243;n. &#201;ste es un campo de s&#243;lo lectura.</p>

</dd>
<dt>M&#243;dulos y componentes</dt>
<dd><p>Tabla en la que figuran los nombres de los m&#243;dulos de la aplicaci&#243;n y sus motores. Para un punto final de servicio web, puede seleccionar Consultar punto final para visualizar la p&#225;gina Informaci&#243;n de punto final de servicio web. Para un cliente de aplicaciones, puede seleccionar Iniciar para acceder a la p&#225;gina Iniciar cliente de aplicaciones.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p>

</li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appviewtargets.html">C&#243;mo ver los destinos de las aplicaciones </a></p>

</li>
<li><p><a href="task-endpoint.html">Para ver informaci&#243;n de punto final de un servicio web </a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-apprestart.html">C&#243;mo recargar una aplicaci&#243;n implementada</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
