<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfignew" name="ref-messagesecurityconfignew"></a><a id="GHCOM00119" name="GHCOM00119"></a></p>

<h4><a id="sthref423" name="sthref423"></a>configuraciones de seguridad de los mensajes nuevos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Consulte la p&aacute;gina Nueva configuraci&oacute;n de seguridad de mensajes para crear una configuraci&oacute;n HttpServlet para la seguridad de mensajes.</p>
<p>La p&aacute;gina Nueva configuraci&oacute;n de seguridad de mensajes contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de la configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Capa de autenticaci&oacute;n</dt>
<dd>
<p>Capa del mensaje en la que se lleva a cabo la autenticaci&oacute;n. El valor debe ser <code>SOAP</code> o <code>HttpServlet</code>. Debido a que de manera predeterminada hay una configuraci&oacute;n SOAP disponible, la &uacute;nica opci&oacute;n es <code>HttpServlet</code>.</p>
</dd>
<dt>ID de Proveedor</dt>
<dd>
<p>&Uacute;nico identificador de la configuraci&oacute;n del proveedor para esta configuraci&oacute;n de seguridad de mensajes.</p>
</dd>
<dt>Proveedor predeterminado</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, este proveedor ser&aacute; el proveedor predeterminado. El proveedor predeterminado ser&aacute; invocado para cualquier aplicaci&oacute;n que no identifique un proveedor espec&iacute;fico. Si el proveedor es el proveedor de cliente predeterminado, el proveedor de servidor predeterminado o ambos viene determinado por el Tipo de proveedor.</p>
</dd>
<dt>Tipo de proveedor</dt>
<dd>
<p>Especifica el tipo de proveedor. Las opciones disponibles son:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n de clientes.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n del servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que el proveedor es tanto el proveedor de autenticaci&oacute;n del servidor como del cliente.</p>
</dd>
</dl>
</dd>
<dt>Nombre de clase</dt>
<dd>
<p>Nombre de la clase de implementaci&oacute;n de Java del proveedor. Los proveedores de autenticaci&oacute;n del cliente deben implantar la interfaz <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Los proveedores del servidor deben implementar la interfaz <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Los proveedores de servidor y cliente deben implementar ambas interfaces.</p>
</dd>
<dt>Propiedades adicionales</dt>
<dd>
<p>Propiedades adicionales de la configuraci&oacute;n de seguridad de mensajes.</p>
</dd>
</dl>
<a id="sthref424" name="sthref424"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar Utilidades de Servidor GlassFish para que las Utilicen los Proveedores de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Crear una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Editar una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una Configuraci&oacute;n de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Crear una Configuraci&oacute;n de Proveedores de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una Configuraci&oacute;n de Proveedor de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suprimir una Configuraci&oacute;n de Proveedor de Seguridad de Mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la Seguridad de Mensajes para los Clientes de Aplicaciones</a></p>
</li>
</ul>
<a id="sthref425" name="sthref425"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguna.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
