<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uploaddev"></a><h4>Implementar aplicaciones o m&#243;dulos</h4>
<a name="indexterm-174"></a><a name="indexterm-175"></a><a name="indexterm-176"></a><a name="indexterm-177"></a><a name="indexterm-178"></a><a name="indexterm-179"></a><a name="indexterm-180"></a><a name="indexterm-181"></a><a name="indexterm-182"></a><a name="indexterm-183"></a><a name="indexterm-184"></a><a name="indexterm-185"></a><p>Utilice la p&#225;gina Implementar aplicaciones o m&#243;dulos para implementar una aplicaci&#243;n.</p>

<p>La p&#225;gina Implementar aplicaciones o m&#243;dulos contiene las opciones siguientes para todas
las aplicaciones. &#218;nicamente aparecen m&#225;s opciones en caso de que especifique el
campo Ubicaci&#243;n para la aplicaci&#243;n.</p>

<dl><dt>Ubicaci&#243;n</dt>
<dd><p>Ubicaci&#243;n del archivo de almacenamiento para la aplicaci&#243;n que est&#225; implementando.</p>

<p>Las opciones siguientes especifican desde d&#243;nde se puede acceder al archivo del almacenamiento y si el archivo de almacenamiento es un archivo o un directorio.</p>

<dl><dt>Archivo empaquetado que se cargar&#225; en el servidor</dt>
<dd><p>El archivo de almacenamiento es un archivo que reside en la m&#225;quina cliente o al que se puede acceder desde la misma.</p>

<p>La m&#225;quina cliente es el host en el que est&#225; viendo la Consola de administraci&#243;n por medio de un navegador.</p>

</dd>
<dt>Directorio o archivo empaquetado local al que se puede acceder desde Servidor GlassFish</dt>
<dd><p>El archivo de almacenamiento es un archivo que reside en la m&#225;quina servidor o es una aplicaci&#243;n desempaquetada en un directorio de despliegue.</p>

<p>El equipo servidor es el sistema anfitri&#243;n que est&#225; ejecutando el servidor de administraci&#243;n del dominio de Servidor GlassFish. </p>

</dd>
</dl>
</dd>
<dt>Tipo</dt>
<dd><p>Tipo de aplicaci&#243;n. Las opciones disponibles son:</p>


<ul><li><p>Aplicaci&#243;n de Web</p>

</li>
<li><p>Aplicaci&#243;n empresarial</p>

</li>
<li><p>Cliente de aplicaciones</p>

</li>
<li><p>M&#243;dulo del conector</p>

</li>
<li><p>JAR EJB</p>

</li>
<li><p>Otro</p>

</li></ul>
</dd>
<dt>Destinos</dt>
<dd><p>Cl&#250;steres e instancias independientes en los que implementar la aplicaci&#243;n o m&#243;dulo. Mueva los destinos seleccionados a la columna Destinos seleccionados mediante los botones Agregar y Agregar todos. Mueva los destinos que no necesite a la columna Destinos disponibles mediante los botones Eliminar y Eliminar todos.</p>

<p>Esta opci&#243;n s&#243;lo se muestra si se han creado cl&#250;steres o instancias independientes en el dominio.</p>

</dd>
</dl>
<p>Las opciones adicionales para los distintos tipos de aplicaci&#243;n se describen en
las siguientes secciones.</p>


<ul><li><p><a href="#ref-webapp-options">Opciones adicionales para una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="#ref-entapp-options">Opciones adicionales para una Aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="#ref-appclient-options">Opciones adicionales para un Cliente de aplicaciones</a></p>

</li>
<li><p><a href="#ref-connmodule-options">Opciones adicionales para un M&#243;dulo de conector</a></p>

</li>
<li><p><a href="#ref-ejb-options">Opciones adicionales para un JAR EJB</a></p>

</li></ul>
<a name="ref-webapp-options"></a><h5>Opciones adicionales para una aplicaci&#243;n web</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a una aplicaci&#243;n web, aparecen las
siguientes opciones.</p>

<dl><dt>Ra&#237;z de contexto</dt>
<dd><p>Ruta hacia la aplicaci&#243;n. En la URL de la aplicaci&#243;n web, la ra&#237;z de contexto aparece justo despu&#233;s del n&#250;mero de puerto (<tt>http://<i>host</i>:<i>port </i>/<i>context-root</i>/...</tt>). La ra&#237;z de contexto debe comenzar por una barra diagonal, por ejemplo, <tt>/hello</tt>.</p>

</dd>
<dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>) y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p>

<p>La opci&#243;n Servidores virtuales aparece si solo existe la instancia de servidor predeterminada, <tt>server</tt>. Si existen cl&#250;steres u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&#233;s de la implementaci&#243;n. Vaya a la p&#225;gina Editar aplicaci&#243;n, seleccione la ficha Destino y seleccione Administrar servidores virtuales para el destino que desee.</p>

</dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada por defecto.</p>

</dd>
<dt>Disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la alta disponibilidad para la aplicaci&#243;n de puntos de control de SFSB y posiblemente para la pasivaci&#243;n. Si se configura como False (el valor predeterminado), se inhabilita el guardado de sesiones web y puntos de control de SFSB para la aplicaci&#243;n, aplicaci&#243;n web o m&#243;dulo EJB especificado. Si se define como true, la aplicaci&#243;n o m&#243;dulo especificados se habilita para alta disponibilidad. Establezca esta opci&#243;n como true s&#243;lo si se ha configurado y habilitado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor. </p>

<p>Esta opci&#243;n aparece si existen cl&#250;steres o instancias independientes del servidor aparte de la instancia de servidor predeterminada (<tt>server</tt>).</p>

</dd>
<dt>Precompilar JSP</dt>
<dd><p>Si est&#225; seleccionada esta opci&#243;n, los archivos JavaServer Pages ( JSP) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p>

</dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, los descriptores de implementaci&#243;n se verifican antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se deshabilita por defecto.</p>

<p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de esta opci&#243;n.</p>

</dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Estado de conservaci&#243;n</dt>
<dd><p>Esta opci&#243;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre reimplementaciones. </p>

<p>Esta opci&#243;n se deshabilita por defecto. Esta opci&#243;n s&#243;lo se admite en la instancia de servidor predeterminada, denominada <tt>server</tt>. No se admite para ning&#250;n otro destino, y se hace caso omiso de ella.</p>

<p>Algunos cambios efectuados en una aplicaci&#243;n entre reimplementaciones impiden que esta opci&#243;n funcione correctamente. Por ejemplo, no cambie el conjunto de variables de instancia en la clase de bean SFSB.</p>

<p>Para las aplicaciones web, esta opci&#243;n solo es aplicable si, en el archivo <tt>glassfish-web-app.xml</tt>, el atributo <tt>persistence-type</tt> del elemento <tt>session-manager</tt> es <tt>file</tt>.</p>

<p>Para instancias de bean de sesi&#243;n con estado, el tipo de persistencia sin alta disponibilidad se establece en el servidor (con la opci&#243;n Tipo de persistencia SFSB) y se debe configurar como <tt>file</tt>, que es el valor predeterminado y recomendado.</p>

<p>Si una sesi&#243;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <b>ninguno</b> de ellos estar&#225; disponible cuando se haya completado la reimplementaci&#243;n. Sin embargo, la reimplementaci&#243;n proseguir&#225; y se registrar&#225; una advertencia.</p>

<p>Para conservar datos de estado activo, Servidor GlassFish serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&#243;n que se acaba de volver a implementar deserializa los datos guardados anteriormente.</p>

</dd>
<dt>Conservaci&#243;n de recursos de &#225;mbito de aplicaci&#243;n</dt>
<dd><p>Si se selecciona, conserva todos los recursos de &#225;mbito restringido a la aplicaci&#243;n y los restaura durante la reimplementaci&#243;n. Esta opci&#243;n no est&#225; activada de forma predeterminada.</p>

</dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos de este m&#243;dulo o aplicaci&#243;n. Las rutas pueden ser absolutas o relativas. Una ruta relativa es relativa a <tt></tt><i>dir_dominio</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>dir_dominio</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
</dl>
<a name="ref-entapp-options"></a><h5>Opciones adicionales para una Aplicaci&#243;n empresarial</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a una aplicaci&#243;n empresarial, aparecen las
siguientes opciones.</p>

<dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>) y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p>

<p>La opci&#243;n Servidores virtuales aparece si solo existe la instancia de servidor predeterminada, <tt>server</tt>. Si existen cl&#250;steres u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&#233;s de la implementaci&#243;n. Vaya a la p&#225;gina Editar aplicaci&#243;n, seleccione la ficha Destino y seleccione Administrar servidores virtuales para el destino que desee.</p>

</dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada por defecto.</p>

</dd>
<dt>Disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la alta disponibilidad para la aplicaci&#243;n de puntos de control de SFSB y posiblemente para la pasivaci&#243;n. Si se configura como False (el valor predeterminado), se inhabilita el guardado de sesiones web y puntos de control de SFSB para la aplicaci&#243;n, aplicaci&#243;n web o m&#243;dulo EJB especificado. Si se define como true, la aplicaci&#243;n o m&#243;dulo especificados se habilita para alta disponibilidad. Establezca esta opci&#243;n como true s&#243;lo si se ha configurado y habilitado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor. </p>

<p>Esta opci&#243;n aparece si existen cl&#250;steres o instancias independientes del servidor aparte de la instancia de servidor predeterminada (<tt>server</tt>).</p>

</dd>
<dt>Java Web Start</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se permite el acceso a Java Web Start para un m&#243;dulo de cliente de aplicaciones. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Precompilar JSP</dt>
<dd><p>Si est&#225; seleccionada esta opci&#243;n, los archivos JavaServer Pages ( JSP) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p>

</dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, los descriptores de implementaci&#243;n se verifican antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se deshabilita por defecto.</p>

<p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de esta opci&#243;n.</p>

</dd>
<dt>Compatibilidad</dt>
<dd><p>Si la opci&#243;n est&#225; seleccionada, utiliza los requisitos de visibilidad de JAR de Servidor GlassFish v2 para las aplicaciones, en lugar de los m&#225;s estrictos requisitos de Java EE 6 implementados en las versiones v3 de Servidor GlassFish, incluida 3.1. Esta opci&#243;n no est&#225; activada de forma predeterminada.</p>

<p>La especificaci&#243;n de la plataforma Java EE 6 impone requisitos m&#225;s estrictos que Java EE 5 sobre qu&#233; archivos JAR pueden ser visibles para varios m&#243;dulos dentro de un archivo EAR. En concreto, los clientes de aplicaci&#243;n no deben tener acceso a los archivos JAR EJB o a otros archivos JAR del archivo EAR a menos que las referencias utilicen los mecanismos Java SE est&#225;ndar (extensiones, por ejemplo) o el mecanismo biblioteca-directorio de Java EE. Al activar esta casilla se eliminan estas restricciones de Java EE 6.</p>

</dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Estado de conservaci&#243;n</dt>
<dd><p>Esta opci&#243;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre reimplementaciones. </p>

<p>Esta opci&#243;n se deshabilita por defecto. Esta opci&#243;n s&#243;lo se admite en la instancia de servidor predeterminada, denominada <tt>server</tt>. No se admite para ning&#250;n otro destino, y se hace caso omiso de ella.</p>

<p>Algunos cambios efectuados en una aplicaci&#243;n entre reimplementaciones impiden que esta opci&#243;n funcione correctamente. Por ejemplo, no cambie el conjunto de variables de instancia en la clase de bean SFSB.</p>

<p>Para las aplicaciones web, esta opci&#243;n solo es aplicable si, en el archivo <tt>glassfish-web-app.xml</tt>, el atributo <tt>persistence-type</tt> del elemento <tt>session-manager</tt> es <tt>file</tt>.</p>

<p>Para instancias de bean de sesi&#243;n con estado, el tipo de persistencia sin alta disponibilidad se establece en el servidor (con la opci&#243;n Tipo de persistencia SFSB) y se debe configurar como <tt>file</tt>, que es el valor predeterminado y recomendado.</p>

<p>Si una sesi&#243;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <b>ninguno</b> de ellos estar&#225; disponible cuando se haya completado la reimplementaci&#243;n. Sin embargo, la reimplementaci&#243;n proseguir&#225; y se registrar&#225; una advertencia.</p>

<p>Para conservar datos de estado activo, Servidor GlassFish serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&#243;n que se acaba de volver a implementar deserializa los datos guardados anteriormente.</p>

</dd>
<dt>Conservaci&#243;n de recursos de &#225;mbito de aplicaci&#243;n</dt>
<dd><p>Si se selecciona, conserva todos los recursos de &#225;mbito restringido a la aplicaci&#243;n y los restaura durante la reimplementaci&#243;n. Esta opci&#243;n no est&#225; activada de forma predeterminada.</p>

</dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos de esta aplicaci&#243;n. Especifica una ruta de acceso absoluta o relativa. Una ruta relativa es relativa a <tt></tt><i>dir_dominio</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>dir_dominio</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
</dl>
<a name="ref-appclient-options"></a><h5>Opciones adicionales para un Cliente de aplicaciones</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a un cliente de aplicaciones, aparecen
las siguientes opciones.</p>

<dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>) y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Java Web Start</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se permite el acceso a Java Web Start para un m&#243;dulo de cliente de aplicaciones. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, los descriptores de implementaci&#243;n se verifican antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se deshabilita por defecto.</p>

<p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de esta opci&#243;n.</p>

</dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
</dl>
<a name="ref-connmodule-options"></a><h5>Opciones adicionales para un M&#243;dulo de conector</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a un m&#243;dulo de conector, aparecen
las siguientes opciones.</p>

<dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>) y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p>

</dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, los descriptores de implementaci&#243;n se verifican antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se deshabilita por defecto.</p>

<p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de esta opci&#243;n.</p>

</dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Conservaci&#243;n de recursos de &#225;mbito de aplicaci&#243;n</dt>
<dd><p>Si se selecciona, conserva todos los recursos de &#225;mbito restringido a la aplicaci&#243;n y los restaura durante la reimplementaci&#243;n. Esta opci&#243;n no est&#225; activada de forma predeterminada.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
</dl>
<a name="ref-ejb-options"></a><h5>Opciones adicionales para un JAR EJB</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a un JAR EJB, aparecen las
siguientes opciones.</p>

<dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>) y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada por defecto.</p>

</dd>
<dt>Disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la alta disponibilidad para la aplicaci&#243;n de puntos de control de SFSB y posiblemente para la pasivaci&#243;n. Si se configura como False (el valor predeterminado), se inhabilita el guardado de sesiones web y puntos de control de SFSB para la aplicaci&#243;n, aplicaci&#243;n web o m&#243;dulo EJB especificado. Si se define como true, la aplicaci&#243;n o m&#243;dulo especificados se habilita para alta disponibilidad. Establezca esta opci&#243;n como true s&#243;lo si se ha configurado y habilitado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor. </p>

<p>Esta opci&#243;n aparece si existen cl&#250;steres o instancias independientes del servidor aparte de la instancia de servidor predeterminada (<tt>server</tt>).</p>

</dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, los descriptores de implementaci&#243;n se verifican antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se deshabilita por defecto.</p>

<p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de esta opci&#243;n.</p>

</dd>
<dt>Compatibilidad</dt>
<dd><p>Si la opci&#243;n est&#225; seleccionada, utiliza los requisitos de visibilidad de JAR de Servidor GlassFish v2 para las aplicaciones, en lugar de los m&#225;s estrictos requisitos de Java EE 6 implementados en las versiones v3 de Servidor GlassFish, incluida 3.1. Esta opci&#243;n no est&#225; activada de forma predeterminada.</p>

<p>La especificaci&#243;n de la plataforma Java EE 6 impone requisitos m&#225;s estrictos que Java EE 5 sobre qu&#233; archivos JAR pueden ser visibles para varios m&#243;dulos dentro de un archivo EAR. En concreto, los clientes de aplicaci&#243;n no deben tener acceso a los archivos JAR EJB o a otros archivos JAR del archivo EAR a menos que las referencias utilicen los mecanismos Java SE est&#225;ndar (extensiones, por ejemplo) o el mecanismo biblioteca-directorio de Java EE. Al activar esta casilla se eliminan estas restricciones de Java EE 6.</p>

</dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Estado de conservaci&#243;n</dt>
<dd><p>Esta opci&#243;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre reimplementaciones. </p>

<p>Esta opci&#243;n se deshabilita por defecto. Esta opci&#243;n s&#243;lo se admite en la instancia de servidor predeterminada, denominada <tt>server</tt>. No se admite para ning&#250;n otro destino, y se hace caso omiso de ella.</p>

<p>Algunos cambios efectuados en una aplicaci&#243;n entre reimplementaciones impiden que esta opci&#243;n funcione correctamente. Por ejemplo, no cambie el conjunto de variables de instancia en la clase de bean SFSB.</p>

<p>Para las aplicaciones web, esta opci&#243;n solo es aplicable si, en el archivo <tt>glassfish-web-app.xml</tt>, el atributo <tt>persistence-type</tt> del elemento <tt>session-manager</tt> es <tt>file</tt>.</p>

<p>Para instancias de bean de sesi&#243;n con estado, el tipo de persistencia sin alta disponibilidad se establece en el servidor (con la opci&#243;n Tipo de persistencia SFSB) y se debe configurar como <tt>file</tt>, que es el valor predeterminado y recomendado.</p>

<p>Si una sesi&#243;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <b>ninguno</b> de ellos estar&#225; disponible cuando se haya completado la reimplementaci&#243;n. Sin embargo, la reimplementaci&#243;n proseguir&#225; y se registrar&#225; una advertencia.</p>

<p>Para conservar datos de estado activo, Servidor GlassFish serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&#243;n que se acaba de volver a implementar deserializa los datos guardados anteriormente.</p>

</dd>
<dt>Conservaci&#243;n de recursos de &#225;mbito de aplicaci&#243;n</dt>
<dd><p>Si se selecciona, conserva todos los recursos de &#225;mbito restringido a la aplicaci&#243;n y los restaura durante la reimplementaci&#243;n. Esta opci&#243;n no est&#225; activada de forma predeterminada.</p>

</dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos para este m&#243;dulo o aplicaci&#243;n. Especifica una ruta de acceso absoluta o relativa. Una ruta relativa es relativa a <tt></tt><i>dir_dominio</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>dir_dominio</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
</dl>
<h5>Opciones adicionales para aplicaciones de tipo Otros</h5>
<p>Si el tipo de la aplicaci&#243;n es Otro, aparecer&#225;n las siguientes opciones.</p>

<dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>) y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p>

<p>La opci&#243;n Servidores virtuales aparece si solo existe la instancia de servidor predeterminada, <tt>server</tt>. Si existen cl&#250;steres u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&#233;s de la implementaci&#243;n. Vaya a la p&#225;gina Editar aplicaci&#243;n, seleccione la ficha Destino y seleccione Administrar servidores virtuales para el destino que desee.</p>

</dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada por defecto.</p>

</dd>
<dt>Disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la alta disponibilidad para la aplicaci&#243;n de puntos de control de SFSB y posiblemente para la pasivaci&#243;n. Si se configura como False (el valor predeterminado), se inhabilita el guardado de sesiones web y puntos de control de SFSB para la aplicaci&#243;n, aplicaci&#243;n web o m&#243;dulo EJB especificado. Si se define como true, la aplicaci&#243;n o m&#243;dulo especificados se habilita para alta disponibilidad. Establezca esta opci&#243;n como true s&#243;lo si se ha configurado y habilitado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor. </p>

<p>Esta opci&#243;n aparece si existen cl&#250;steres o instancias independientes del servidor aparte de la instancia de servidor predeterminada (<tt>server</tt>).</p>

</dd>
<dt>Tipo OSGi</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, especifica un m&#243;dulo h&#237;brido OSGi/Java-EE. Esta opci&#243;n solo aparece si el Tipo seleccionado es Otros.</p>

</dd>
<dt>Precompilar JSP</dt>
<dd><p>Si est&#225; seleccionada esta opci&#243;n, los archivos JavaServer Pages ( JSP) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p>

</dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, los descriptores de implementaci&#243;n se verifican antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se deshabilita por defecto.</p>

<p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de esta opci&#243;n.</p>

</dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Estado de conservaci&#243;n</dt>
<dd><p>Esta opci&#243;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre reimplementaciones. </p>

<p>Esta opci&#243;n se deshabilita por defecto. Esta opci&#243;n s&#243;lo se admite en la instancia de servidor predeterminada, denominada <tt>server</tt>. No se admite para ning&#250;n otro destino, y se hace caso omiso de ella.</p>

<p>Algunos cambios efectuados en una aplicaci&#243;n entre reimplementaciones impiden que esta opci&#243;n funcione correctamente. Por ejemplo, no cambie el conjunto de variables de instancia en la clase de bean SFSB.</p>

<p>Para las aplicaciones web, esta opci&#243;n solo es aplicable si, en el archivo <tt>glassfish-web-app.xml</tt>, el atributo <tt>persistence-type</tt> del elemento <tt>session-manager</tt> es <tt>file</tt>.</p>

<p>Para instancias de bean de sesi&#243;n con estado, el tipo de persistencia sin alta disponibilidad se establece en el servidor (con la opci&#243;n Tipo de persistencia SFSB) y se debe configurar como <tt>file</tt>, que es el valor predeterminado y recomendado.</p>

<p>Si una sesi&#243;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <b>ninguno</b> de ellos estar&#225; disponible cuando se haya completado la reimplementaci&#243;n. Sin embargo, la reimplementaci&#243;n proseguir&#225; y se registrar&#225; una advertencia.</p>

<p>Para conservar datos de estado activo, Servidor GlassFish serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&#243;n que se acaba de volver a implementar deserializa los datos guardados anteriormente.</p>

</dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos para este m&#243;dulo o aplicaci&#243;n. Especifica una ruta de acceso absoluta o relativa. Una ruta relativa es relativa a <tt></tt><i>dir_dominio</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>dir_dominio</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p>

</li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-endpoint.html">Para ver informaci&#243;n de punto final de un servicio web </a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-apprestart.html">C&#243;mo recargar una aplicaci&#243;n implementada</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=deploy-1"><tt>deploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=redeploy-1"><tt>redeploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-applications-1"><tt>list-applications</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
