<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-installed-remove" name="task-uc-installed-remove"></a><a id="GHCOM00216" name="GHCOM00216"></a></p>

<h4><a id="sthref215" name="sthref215"></a>Ver Componentes Instalados</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Componentes instalados ofrece informaci&oacute;n sobre los componentes de la imagen de instalaci&oacute;n que est&aacute;n instalados.</p>
<p>La desinstalaci&oacute;n de un componente incluye la eliminaci&oacute;n de los elementos siguientes:</p>
<ul>
<li>
<p>Todos los archivos y directorios introducidos con la instalaci&oacute;n original del componente</p>
</li>
<li>
<p>Todos los archivos y directorios introducidos con las actualizaciones del componente tras la instalaci&oacute;n original</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Herramienta de Actualizaci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Complementos Disponibles.</p>
</li>
<li>
<p>En la p&aacute;gina Complementos Disponibles, haga clic en el separador Componentes Instalados.</p>
<p>Se abrir&aacute; la p&aacute;gina Componentes Instalados.</p>
</li>
</ol>
<a id="sthref216" name="sthref216"></a>
<h5>Pasos Siguientes</h5>
<p>Para desinstalar los componentes instalados en primer lugar pare el dominio de Servidor GlassFish. A continuaci&oacute;n, utilice uno de estos comandos:</p>
<ul>
<li>
<p><i>as-install-parent</i><code>/bin/updatetool</code>, que inicia la utilidad gr&aacute;fica Herramienta de actualizaci&oacute;n</p>
</li>
<li>
<p><i>as-install-parent</i><code>/bin/pkg</code>, una versi&oacute;n de l&iacute;nea de comandos de la herramienta de actualizaci&oacute;n</p>
</li>
</ul>
<p>Para obtener informaci&oacute;n sobre el uso del comando <code>pkg</code>, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, <i>Ampliaci&oacute;n y actualizaci&oacute;n de GlassFish Server</i>, en <i>Oracle GlassFish Server Administration Guide</i></a>. La utilidad Herramienta de Actualizaci&oacute;n tiene su propia ayuda en pantalla.</p>
<p>Reinicie el servidor despu&eacute;s de que haya terminado de desinstalar los componentes.</p>
<a id="sthref217" name="sthref217"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Ver Actualizaciones Disponibles para Componentes</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">Instalar Componentes de Complementos</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Ver Informaci&oacute;n Detallada sobre un Componente</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Definir la Configuraci&oacute;n de Proxy de Red para Acceder a los Repositorios de Red</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
