<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-lifecyclemodulenew"></a><h4>Creaci&#243;n de un m&#243;dulo de ciclo de vida</h4><a name="indexterm-58"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo M&#243;dulos de ciclo de
vida.</b><p>Se abrir&#225; la p&#225;gina M&#243;dulos de ciclo de vida.</p></li>
<li><b>En la p&#225;gina M&#243;dulos de ciclo de vida, haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo m&#243;dulo de ciclo de vida.</p></li>
<li><b>En el campo Nombre, introduzca un nombre para m&#243;dulo de ciclo de
vida.</b></li>
<li><b>En el campo Nombre de clase, escriba el nombre completo del archivo
de clase del m&#243;dulo de ciclo de vida.</b><p>La clase debe implementar la interfaz <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></li>
<li><b>En el campo ruta de clase, introduzca la ruta de clase para
el m&#243;dulo de ciclo de vida.</b><p>La ruta de clase especifica d&#243;nde est&#225; ubicado el m&#243;dulo de ciclo
de vida. El valor predeterminado es <tt></tt><i>domain-dir</i><tt>/applications</tt>. Si el m&#243;dulo ya se
encuentra en este directorio (es decir, en la ruta de clase del
servidor), este campo puede dejarse en blanco.</p></li>
<li><b>En el campo Orden de carga, introduzca un valor que especifique el
orden en que este m&#243;dulo de ciclo de vida se cargar&#225; en
el arranque.</b><p>Los m&#243;dulos con valores de orden de carga inferiores se cargar&#225;n antes.
El valor puede estar entre 101 y el <tt>MAXINT</tt> del sistema operativo.
Los valores de 0 a 100 est&#225;n reservados.</p></li>
<li><b>En el campo Descripci&#243;n, introduzca una descripci&#243;n del m&#243;dulo de ciclo de
vida.</b></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar el m&#243;dulo de
ciclo de vida.</b><p>Esta opci&#243;n est&#225; habilitada por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Arranque de instancia para impedir fallo en
la carga para especificar que el servidor debe apagarse si se produce
un error en la carga del m&#243;dulo de ciclo de vida.</b><p>Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>Para agregar instancias de servidor y cl&#250;steres de destino en los que
habilitar el m&#243;dulo de ciclo de vida, selecci&#243;nelos en la lista Destinos
disponibles y utilice el bot&#243;n Agregar para moverlos a la lista Destinos
seleccionados.</b><p>La opci&#243;n Destino aparece si existen cl&#250;steres o instancias independientes del servidor
aparte de la instancia de servidor predeterminada (<tt>server</tt>). De manera predeterminada, el
m&#243;dulo de ciclo de vida est&#225; habilitado en la instancia de servidor
predeterminada, denominada <tt>server</tt>. Utilice el bot&#243;n Agregar todos para implementar en todos
los destinos. Utilice los botones Eliminar y Eliminar todos para eliminar destinos
de la lista Destinos seleccionados.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-lifecyclemoduleedit.html">Edici&#243;n de un m&#243;dulo de ciclo de vida</a></p>

</li>
<li><p><a href="task-lifecyclemoduledelete.html">Eliminaci&#243;n de un m&#243;dulo de ciclo de vida</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
