<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovidernew"></a><h3>Creaci&#243;n de un proveedor JACC</h3><a name="indexterm-101"></a><a name="indexterm-102"></a><a name="indexterm-103"></a><p>Consulte la p&#225;gina Nuevo proveedor JACC para crear un nuevo proveedor JACC
(Java Authorization Contract for Containers) que cumple la especificaci&#243;n JSR-115/196 que pueden
utilizar m&#243;dulos de autorizaci&#243;n de terceros para las aplicaciones que se ejecutan
en Servidor GlassFish. El proveedor JACC se crea como un elemento <tt>jacc-provider</tt>
dentro del elemento <tt>security-service</tt> el archivo <tt>domain.xml</tt> del dominio.</p>

<p>La instalaci&#243;n predeterminada de Servidor GlassFish incluye dos proveedores de JACC denominados
<tt>default</tt> y <tt>simple</tt>. Los nuevos proveedores JACC que se creen se a&#241;aden
a estos dos proveedores predeterminados. Estos proveedores JACC de Servidor GlassFish predeterminados
implementan un motor de autorizaci&#243;n simple, basado en archivos, que cumple la
especificaci&#243;n JACC.</p>

<p>Para obtener informaci&#243;n acerca de c&#243;mo escribir clases de implementaci&#243;n para un
proveedor JACC, consulte la especificaci&#243;n JACC en <a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a>.</p>

<ol>
<li><b>En el nodo Configuraciones del &#225;rbol de navegaci&#243;n, ampl&#237;e la instancia o
cl&#250;ster Servidor GlassFish para la que desee crear un proveedor JACC.</b><p>Para crear un proveedor que est&#233; disponible para todas las instancias y
cl&#250;steres, elija el nodo <tt>default-config</tt>.</p></li>
<li><b>En el nodo de configuraci&#243;n ampliado de la instancia o cl&#250;ster, ampl&#237;e
el nodo Seguridad.</b></li>
<li><b>En el nodo Seguridad, seleccione el nodo Proveedores JACC.</b><p>Se abrir&#225; la p&#225;gina Proveedores JACC.</p></li>
<li><b>En la p&#225;gina Proveedores JACC haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo proveedor JACC.</p></li>
<li><b>En la p&#225;gina Nuevo proveedor JACC, en el campo Nombre, introduzca el
nombre que identificar&#225; a este proveedor.</b><p>Este nombre se utiliza para hacer referencia al elemento <tt>jacc-provider</tt> en <tt>domain.xml</tt>.</p></li>
<li><b>En el campo Configuraci&#243;n de directivas, introduzca el nombre de la clase
que implementa el generador de configuraci&#243;n de directivas.</b><p>El proveedor <tt>default</tt> utiliza <tt>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl </tt>. El proveedor <tt>simple </tt> utiliza <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory</tt>.</p></li>
<li><b>En el campo Proveedor de directivas, introduzca el nombre de la clase
que implementa el generador de directivas.</b><p>El proveedor <tt>default</tt> utiliza <tt>com.sun.enterprise.security.provider.PolicyWrapper</tt>. El proveedor <tt>simple</tt> utiliza <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider </tt>.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p><p>Para obtener una descripci&#243;n de las propiedades adicionales disponibles para proveedores JACC,
consulte<a href="ref-jaccproviderprop.html">Propiedades espec&#237;ficas de los proveedores JACC</a>.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-jaccprovideredit.html">Edici&#243;n de un proveedor JACC</a></p>

</li>
<li><p><a href="task-jaccproviderdelete.html">Eliminaci&#243;n de un proveedor JACC</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
