<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appviewtargets"></a><h3>C&#243;mo ver los destinos de las aplicaciones </h3><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones.</p></li>
<li><b>Seleccione la aplicaci&#243;n cuyos destinos desee ver.</b><p>El nombre de la aplicaci&#243;n puede incluir un identificador de versi&#243;n opcional,
que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por
dos puntos (<tt>:</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo
y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p><p>Se abrir&#225; la p&#225;gina de la aplicaci&#243;n.</p></li>
<li><b>Seleccione la ficha Destino.</b><p>Se abrir&#225; la p&#225;gina Destinos de aplicaci&#243;n, y se mostrar&#225;n los destinos
actualmente especificados para la aplicaci&#243;n.</p></li>
<li><b>Para habilitar o inhabilitar una aplicaci&#243;n en un cl&#250;ster o instancia de
destino espec&#237;ficos, haga clic en la casilla de verificaci&#243;n que aparece junto
al destino y seleccione Habilitar o Inhabilitar en el men&#250; desplegable M&#225;s
acciones.</b></li>
<li><b>Para habilitar el equilibrado de carga de un destino en un cl&#250;ster
o instancia de destino espec&#237;ficos, haga clic en la casilla de verificaci&#243;n
que aparece junto al destino y seleccione Habilitar equilibrado de carga o
Inhabilitar equilibrado de carga en el men&#250; desplegable M&#225;s acciones.</b></li>
<li><b>Para asociar una aplicaci&#243;n con servidores virtuales espec&#237;ficos, seleccione Gestionar servidores virtuales
para la instancia o cl&#250;ster de destino deseados.</b><p>Se abrir&#225; la p&#225;gina Destinos de servidores virtuales.</p><p>Para agregar servidores virtuales de destino, selecci&#243;nelos en la lista Destinos disponibles
y utilice el bot&#243;n Agregar para moverlos a la lista Destinos seleccionados.</p><p>De forma predeterminada, el m&#243;dulo o aplicaci&#243;n se asocia con el servidor
virtual predeterminado, denominado <tt>server</tt>. Utilice el bot&#243;n Agregar todos para agregar todos
los destinos. Utilice los botones Eliminar y Eliminar todos para eliminar destinos
de la lista Destinos seleccionados.</p><p>Seleccione Guardar para volver a la p&#225;gina Destinos de aplicaci&#243;n.</p></li>
<li><b>Para agregar o eliminar instancias o cl&#250;steres de destino para la aplicaci&#243;n,
seleccione Administrar destinos.</b><p>Se abrir&#225; la p&#225;gina Administrar destinos.</p><p>Para agregar destinos, selecci&#243;nelos en la lista Destinos disponibles y utilice el
bot&#243;n Agregar para moverlos a la lista Destinos seleccionados.</p><p>Utilice el bot&#243;n Agregar todos para agregar todos los destinos. Utilice los
botones Eliminar y Eliminar todos para eliminar destinos de la lista Destinos
seleccionados.</p><p>Seleccione Guardar para volver a la p&#225;gina Destinos de aplicaci&#243;n.</p></li>
<li><b>Haga clic en Guardar.</b><p>La aplicaci&#243;n pasa a estar disponible en la lista de destinos modificada.</p></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
