<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appredeploy"></a><h4>C&#243;mo volver a implementar una aplicaci&#243;n implementada</h4><a name="indexterm-54"></a><a name="indexterm-55"></a><p>Al volver a implementar una aplicaci&#243;n se implementa una versi&#243;n nueva de
la aplicaci&#243;n y al mismo tiempo se preserva la configuraci&#243;n y otras
opciones propias de la aplicaci&#243;n cuando se implement&#243; inicialmente.</p>

<h6>Antes de empezar</h6><p>Aseg&#250;rese de que la aplicaci&#243;n que est&#225; volviendo a implementar ya est&#225;
implementada.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones.</p></li>
<li><b>En la tabla Aplicaciones implementadas, haga clic en Volver a implementar en
la fila de la aplicaci&#243;n que est&#225; volviendo a implementar.</b><p>El nombre de la aplicaci&#243;n puede incluir un identificador de versi&#243;n opcional,
que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por
dos puntos (<tt>:</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo
y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p><p>Se abrir&#225; la p&#225;gina Volver a implementar aplicaciones o M&#243;dulos.</p></li>
<li><b>Especifique la ubicaci&#243;n de la aplicaci&#243;n que desea volver a implementar. </b><ul>
<li><b>Si la aplicaci&#243;n es un archivo que reside en el equipo cliente
o al que se puede acceder desde el equipo cliente, seleccione la
opci&#243;n Archivo comprimido que se cargar&#225; en el servidor.</b><p>La m&#225;quina cliente es el anfitri&#243;n en el que se ve Consola
de administraci&#243;n mediante un navegador.</p><p>Haga clic en Examinar para buscar el archivo o bien escriba la
ruta completa hasta el archivo.</p></li>
<li><b>Si la aplicaci&#243;n es un archivo que reside en el equipo servidor
o es una aplicaci&#243;n descomprimida desde un directorio desplegado, seleccione la opci&#243;n
Archivo comprimido local o Directorio accesible desde GlassFish Server. </b><p>El equipo servidor es el host que se est&#225; ejecutando en el
servidor de administraci&#243;n del dominio (DAS). </p><p>Haz clic en Examinar archivos para buscar un archivo, o en Examinar
carpetas para buscar un directorio. Como opci&#243;n alternativa, escriba el nombre de
la ruta completa del archivo o directorio. Implementar desde un directorio desplegado
es para desarrolladores avanzados y no es recomendable para entornos de producci&#243;n.</p></li></ul></li>
<li><b>Seleccione la casilla de verificaci&#243;n Precompilar JSP para precompilar los archivos de
JavaServer Pages (JSP).</b><p>Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el
tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez.
Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Ejecutar verificador para verificar los descriptores de
implementaci&#243;n antes de la reimplementaci&#243;n.</b><p>Si esta opci&#243;n est&#225; seleccionada y se produce un error en la
verificaci&#243;n, la reimplementaci&#243;n no se llevar&#225; a cabo. El verificador examinar&#225; la
estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de
aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se
deshabilita por defecto.</p><p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de
actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de
esta opci&#243;n.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Java Web Start para habilitar el acceso
a Java Web Start para un m&#243;dulo de cliente de aplicaciones.</b><p>Esta opci&#243;n est&#225; habilitada o inhabilitada de manera predeterminada en funci&#243;n de
su configuraci&#243;n en la implementaci&#243;n original.</p></li>
<li><b>Seleccione la opci&#243;n Mantener estado para mantener sesiones web, instancias de SFSB
y temporizadores EJB creados con persistencia entre reimplementaciones.</b><p>Esta opci&#243;n se deshabilita por defecto. Esta opci&#243;n solo se admite en
la instancia de servidor predeterminada, denominada <tt>server</tt>. No se admite para ning&#250;n
otro destino, y se hace caso omiso de ella.</p><p>Algunos cambios efectuados en una aplicaci&#243;n entre reimplementaciones impiden que esta opci&#243;n
funcione correctamente. Por ejemplo, no cambie el conjunto de variables de instancia
en la clase de bean SFSB.</p><p>Para las aplicaciones web, esta opci&#243;n solo es aplicable si, en el
archivo <tt>glassfish-web-app.xml </tt>, el atributo <tt>persistence-type</tt> del elemento <tt>session-manager</tt> es <tt>file</tt>.</p><p>Para instancias de bean de sesi&#243;n con estado, el tipo de persistencia
sin alta disponibilidad se establece en el servidor (con la opci&#243;n Tipo
de persistencia SFSB) y se debe configurar como <tt>file</tt>, que es el
valor predeterminado y recomendado.</p><p>Si una sesi&#243;n web, instancia SFSB o temporizador EJB activo no se
conserva o restablece, <b>ninguno</b> de ellos estar&#225; disponible cuando se haya completado
la reimplementaci&#243;n. Sin embargo, la reimplementaci&#243;n proseguir&#225; y se registrar&#225; una advertencia.</p><p>Para conservar datos de estado activo, GlassFish Server serializa los datos y
los guarda en la memoria. Para restaurar los datos, el cargador de
clases de la aplicaci&#243;n que se acaba de volver a implementar deserializa
los datos guardados anteriormente.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Conservaci&#243;n de recursos de &#225;mbito de aplicaci&#243;n
para conservar recursos restringidos al &#225;mbito de aplicaci&#243;n y restaurarlos durante la
reimplementaci&#243;n.</b><p>Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p>

</li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appviewtargets.html">C&#243;mo ver los destinos de las aplicaciones </a></p>

</li>
<li><p><a href="task-endpoint.html">Para ver informaci&#243;n de punto final de un servicio web </a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-apprestart.html">C&#243;mo recargar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="../../../ejb/es/help/task-ejbcontaineravailability.html">C&#243;mo configurar la disponibilidad del contenedor EJB</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
