<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployclient"></a><h3>Implementar un cliente de aplicaciones</h3><a name="indexterm-35"></a><a name="indexterm-36"></a><a name="indexterm-37"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones </p></li>
<li><b>En la tabla Aplicaciones implementadas, haga clic en el bot&#243;n Implementar.</b><p>Se abrir&#225; la p&#225;gina Implementar aplicaciones o M&#243;dulos.</p></li>
<li><b>Especifique la ubicaci&#243;n de la aplicaci&#243;n que quiere implementar. </b><ul>
<li><b>Si la aplicaci&#243;n es un archivo que reside en el equipo cliente
o al que se puede acceder desde el equipo cliente, seleccione la
opci&#243;n Archivo comprimido que se cargar&#225; en el servidor.</b><p>La m&#225;quina cliente es el anfitri&#243;n en el que se ve Consola
de administraci&#243;n mediante un navegador.</p><p>Haga clic en Examinar para buscar el archivo o bien escriba la
ruta completa hasta el archivo.</p></li>
<li><b>Si la aplicaci&#243;n es un archivo que reside en el equipo servidor
o es una aplicaci&#243;n descomprimida desde un directorio desplegado, seleccione la opci&#243;n
Archivo comprimido local o Directorio accesible desde Servidor GlassFish. </b><p>El equipo servidor es el host que se est&#225; ejecutando en el
servidor de administraci&#243;n del dominio (DAS). </p><p>Haz clic en Examinar archivos para buscar un archivo o en Examinar
carpetas para buscar un directorio. Como opci&#243;n alternativa, escriba el nombre de
la ruta completa del archivo o directorio. Implementar desde un directorio desplegado
es para desarrolladores avanzados y no es recomendable para entornos de producci&#243;n.</p></li></ul></li>
<li><b>En la lista desplegable Tipo, seleccione Cliente de aplicaciones.</b><p>Si ha especificado un Archivo empaquetado para ser cargado en el servidor
o un Archivo empaquetado local accesible desde Servidor GlassFish,el tipo de aplicaci&#243;n
se detectar&#225; autom&#225;ticamente. Si ha especificado un Directorio accesible desde Servidor GlassFish,
debe especificar el tipo de manera manual.</p></li>
<li><b>En el campo Nombre de la aplicaci&#243;n, puede mantener el nombre predeterminado,
que es el nombre del directorio o el prefijo del nombre del
archivo, o bien escribir un nombre distinto. </b><p>El nombre predeterminado aparece si decide cargar un archivo. El nombre de
la aplicaci&#243;n debe ser &#250;nico.</p><p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a
continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>).
El identificador de versi&#243;n debe comenzar por una letra o n&#250;mero. Puede
contener caracteres alfanum&#233;ricos m&#225;s los caracteres de gui&#243;n bajo (<tt>_</tt>), gui&#243;n (<tt>-</tt>)
y punto (<tt>.</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo
y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Java Web Start para habilitar el acceso
a Java Web Start para un m&#243;dulo de cliente de aplicaciones.</b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Ejecutar verificador para verificar los descriptores de
implementaci&#243;n antes de la implementaci&#243;n.</b><p>Si esta opci&#243;n est&#225; seleccionada y se produce un error en la
verificaci&#243;n, la implementaci&#243;n no se llevar&#225; a cabo. El verificador examinar&#225; la
estructura y el contenido de los descriptores de implementaci&#243;n. La verificaci&#243;n de
aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se
deshabilita por defecto.</p><p>Los paquetes de verificaci&#243;n se deben haber instalado desde la Herramienta de
actualizaci&#243;n o se registrar&#225; una advertencia y se har&#225; caso omiso de
esta opci&#243;n.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Forzar reimplementaci&#243;n para forzar la reimplementaci&#243;n si
ya se ha implementado la aplicaci&#243;n.</b><p>Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n
que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se
encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>En el campo Descripci&#243;n, escriba una descripci&#243;n de esta aplicaci&#243;n.</b></li>
<li><b>Para agregar instancias de servidor y cl&#250;steres de destino en los que
implementar el m&#243;dulo o aplicaci&#243;n, en de la lista Destinos disponibles y
utilice el bot&#243;n Agregar para moverlos a la lista Destinos seleccionados.</b><p>La opci&#243;n Destino aparece si existen cl&#250;steres o instancias independientes del servidor
aparte de la instancia de servidor predeterminada (<tt>server</tt>). De forma predeterminada, el
m&#243;dulo o aplicaci&#243;n se implementar&#225; en la instancia de servidor predeterminada, denominada
<tt>server</tt>. Utilice el bot&#243;n Agregar todos para implementar en todos los destinos.
Utilice los botones Eliminar y Eliminar todos para eliminar destinos de la
lista Destinos seleccionados.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p>

</li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-endpoint.html">Para ver informaci&#243;n de punto final de un servicio web </a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-apprestart.html">C&#243;mo recargar una aplicaci&#243;n implementada</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
