<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-logging-max-logfiles"></a><h4>Para cambiar el l&#237;mite del n&#250;mero de archivos de registro rotados</h4><a name="indexterm-70"></a><a name="indexterm-71"></a><a name="indexterm-72"></a><p>Cuando GlassFish Server rota un archivo de registro, crea un nuevo archivo
denominado <tt>server.log</tt> y renombra el archivo antiguo con el formato <tt>server.log_ </tt><i>fecha</i>, en
el cual <i>fecha</i> corresponde al valor temporal de fecha y hora de
rotaci&#243;n del archivo.</p>

<p>De forma predeterminada, GlassFish Server limita a 10 el n&#250;mero de archivos
de registro rotados. Al llegar a este l&#237;mite, el archivo de registro
m&#225;s antiguo se elimina cuando GlassFish Server vuelve a rotar un archivo
de registro.</p>

<p>Si es necesario, puede cambiar el l&#237;mite del n&#250;mero de archivos de
registro rotados. Cualquier l&#237;mite nuevo que se establece se aplica a archivos
de registro rotados para acceder al registro y al registro del servidor.</p>

<ul>
<li><b>Defina la propiedad del sistema <tt>com.sun.enterprise.server.logging.max_history_files </tt> para que mantenga el n&#250;mero m&#225;ximo
de archivos de registro.</b><p>Para obtener informaci&#243;n sobre c&#243;mo definir una propiedad del sistema, consulte <a href="task-systemproperties.html">Administraci&#243;n de propiedades del sistema</a>.</p><p>El comportamiento de la propiedad del sistema <tt>com.sun.enterprise.server.logging.max_history_files</tt> es el siguiente:</p>
<ul><li><p>Si la propiedad no est&#225; definida, GlassFish Server mantiene un m&#225;ximo de 10 archivos de registro rotados.</p>

</li>
<li><p>Si la propiedad se define en un n&#250;mero no v&#225;lido o nulo, GlassFish Server mantiene un m&#225;ximo de 10 archivos de registro rotados.</p>

</li>
<li><p>Si la propiedad se establece en 0, GlassFish Server no mantiene archivos de registro rotados.</p>

</li></ul>
</li></ul><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-eelogging.html">Para configurar par&#225;metros generales de registros</a></p>

</li>
<li><p><a href="task-eelogginglevels.html">Para configurar niveles de registro</a></p>

</li>
<li><p><a href="task-logviewer.html">C&#243;mo visualizar archivos de registro para el DAS</a></p>

</li>
<li><p><a href="task-logging-collectlogfiles.html">C&#243;mo crear un archivo ZIP de almacenamiento de todos los archivos de registro </a></p>

</li>
<li><p><a href="task-systemproperties.html">Administraci&#243;n de propiedades del sistema</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
