<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-endpoint"></a><h3>Para ver informaci&#243;n de punto final de un servicio web </h3><a name="indexterm-47"></a><a name="indexterm-48"></a><a name="indexterm-49"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones.</p></li>
<li><b>En la p&#225;gina Aplicaciones, haga clic en el nombre del servicio web
cuya informaci&#243;n de punto final est&#225; viendo.</b><p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a
continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>).
Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n,
consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p><p>Se abrir&#225; la p&#225;gina Editar aplicaci&#243;n.</p></li>
<li><b>En la tabla M&#243;dulos y componentes, haga clic en el v&#237;nculo Ver
punto de ejecuci&#243;n para el subcomponente.</b><p>La p&#225;gina Informaci&#243;n de punto final de servicio web se abre. </p></li>
<li><b>Si est&#225; disponible el v&#237;nculo Probador, haga clic en &#233;l para ver
una p&#225;gina que permita proporcionar par&#225;metros para probar los m&#233;todos del servicio
web.</b><p>El v&#237;nculo Probador s&#243;lo est&#225; visible si Tipo de implementaci&#243;n es distinto
de RI (por ejemplo, 109). La p&#225;gina Probador se abre en una
nueva ventana o ficha del navegador.</p></li>
<li><b>Haga clic en el v&#237;nculo WSDL para ver el archivo Web Services
Definition Language (WSDL) para el punto de ejecuci&#243;n.</b><p>El archivo WSDL se abre en una nueva pesta&#241;a o ventana del
explorador. </p><p>Tenga en cuenta que algunos navegadores tratan de interpretar el c&#243;digo fuente
WSDL al hacer clic en el v&#237;nculo WSDL, de modo que muestran
una p&#225;gina en blanco. Para estos navegadores, utilice el comando Ver c&#243;digo
fuente del navegador en la p&#225;gina en blanco para ver el c&#243;digo
fuente WSDL.</p></li>
<li><b>Haga clic en el v&#237;nculo Nombre de la aplicaci&#243;n o en el
bot&#243;n Atr&#225;s para volver a la p&#225;gina Editar aplicaci&#243;n. </b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p>

</li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar un cliente de aplicaciones</a></p>

</li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p>

</li>
<li><p><a href="task-apprestart.html">C&#243;mo recargar una aplicaci&#243;n implementada</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
