<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-installed-remove"></a><h4>Para ver los componentes instalados</h4><a name="indexterm-123"></a><p>La p&#225;gina Componentes instalados ofrece informaci&#243;n sobre los <a href="ref-uc-concepts.html#ref-uc-about-component">componentes</a> de la <a href="ref-uc-concepts.html#ref-uc-about-repository">imagen de instalaci&#243;n</a>
que est&#225;n instalados.</p>

<p>La desinstalaci&#243;n de un <a href="ref-uc-concepts.html#ref-uc-about-component">componente</a> incluye la eliminaci&#243;n de los elementos siguientes:</p>


<ul><li><p>Todos los archivos y directorios introducidos con la instalaci&#243;n original del componente</p>

</li>
<li><p>Todos los archivos y directorios introducidos con las actualizaciones del componente tras la instalaci&#243;n original</p>

</li></ul>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Herramienta de actualizaci&#243;n.</b><p>Se abrir&#225; la p&#225;gina Complementos disponibles.</p></li>
<li><b>En la p&#225;gina Complementos disponibles, haga clic en la ficha Componentes instalados.</b><p>Se abrir&#225; la p&#225;gina Componentes instalados.</p></li></ol><h6>Pasos siguientes</h6><p>Para desinstalar los componentes instalados en primer lugar detenga el dominio de
GlassFish Server. A continuaci&#243;n, utilice uno de estos comandos: </p>


<ul><li><p><tt><i>as-install-parent</i>/bin/updatetool</tt>, que inicia la utilidad gr&#225;fica Herramienta de actualizaci&#243;n </p>

</li>
<li><p><tt><i>as-install-parent</i>/bin/pkg</tt>, una versi&#243;n de l&#237;nea de comandos de la herramienta de actualizaci&#243;n </p>

</li></ul>
<p>Para obtener informaci&#243;n sobre el uso del comando <tt>pkg</tt>, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=ghapp">Cap&#237;tulo 11, Extending and Updating GlassFish Server de <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>.
La utilidad Herramienta de actualizaci&#243;n tiene su propia ayuda en l&#237;nea. </p>

<p>Reinicie el servidor despu&#233;s de que haya terminado de desinstalar los componentes.
</p>

<h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-uc-update.html">Para ver las actualizaciones disponibles para los componentes </a></p>

</li>
<li><p><a href="task-uc-addon.html">C&#243;mo instalar componentes de complementos</a></p>

</li>
<li><p><a href="task-uc-pkgdetails.html">C&#243;mo ver informaci&#243;n detallada de un componente</a></p>

</li>
<li><p><a href="task-uc-set-proxy.html">C&#243;mo configurar los valores del servidor proxy de red para acceder a los dep&#243;sitos de red</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
