<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jvmoptions" name="task-jvmoptions"></a><a id="GHCOM00174" name="GHCOM00174"></a></p>

<h4><a id="sthref114" name="sthref114"></a>Configurar las Opciones de JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Opciones de JVM para especificar las opciones del iniciador de aplicaciones Java (<code>java</code>) que ejecuta Servidor GlassFish. Las opciones <code>-D</code> designan propiedades que son espec&iacute;ficas de Servidor GlassFish.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Select the configuration that you are changing.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Configuraci&oacute;n de JVM.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n General de JVM.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraci&oacute;n General de JVM, haga clic en el separador Opciones de JVM.</p>
<p>Se abrir&aacute; la p&aacute;gina Opciones de JVM.</p>
</li>
<li>
<p>Para modificar una opci&oacute;n, edite el campo Valor de la opci&oacute;n.</p>
</li>
<li>
<p>Para agregar una opci&oacute;n:</p>
<ol type="a">
<li>
<p>Haga clic en el bot&oacute;n Agregar Opci&oacute;n de JVM.</p>
</li>
<li>
<p>En la fila en blanco que aparece, introduzca la informaci&oacute;n de la opci&oacute;n en el campo Valor.</p>
<p>Si la informaci&oacute;n de la opci&oacute;n contiene uno o m&aacute;s espacios, coloque toda la cadena entre comillas dobles.</p>
</li>
</ol>
</li>
<li>
<p>Para suprimir una opci&oacute;n:</p>
<ol type="a">
<li>
<p>Active la casilla de control que aparece a la izquierda del campo Valor de la opci&oacute;n que desea suprimir.</p>
</li>
<li>
<p>Haga clic en Suprimir.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
<li>
<p>Reinicie el servidor.</p>
</li>
</ol>
<a id="sthref115" name="sthref115"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Definir la Configuraci&oacute;n General de JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Definir la Configuraci&oacute;n de Ruta de Acceso de JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">Desactivar el Gestor de Seguridad</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Definir la Configuraci&oacute;n de Analizador de Perfiles de JVM</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
