<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a><a id="GHJMS00009" name="GHJMS00009"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>Disponibilidad de JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Disponibilidad de JMS para configurar las opciones de disponibilidad para el Java Message Service (JMS).</p>
<p>La p&aacute;gina Disponibilidad de JMS contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar la configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. La configuraci&oacute;n que no tiene valores por defecto no se modifica.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Servicio de Disponibilidad</dt>
<dd>
<p>El tipo de cluster de Message Queue utilizado para proporcionar los servicios JMS a un cluster GlassFish. Si se selecciona la casilla de verificaci&oacute;n Activado, se utiliza un cluster Message Queue mejorado. De lo contrario, se utiliza el cluster Message Queue convencional.</p>
<p>Si se selecciona la casilla de verificaci&oacute;n Activado, se omiten las opciones de Tipo de Almac&eacute;n de Configuraci&oacute;n y Tipo de Almac&eacute;n de Mensajes.</p>
</dd>
<dt>Tipo de Almac&eacute;n de Configuraci&oacute;n</dt>
<dd>
<p>El tipo de almac&eacute;n de datos para datos de configuraci&oacute;n de un cluster Message Queue convencional. El valor <code>masterbroker</code> especifica el uso de un broker maestro para almacenar y gestionar los datos de configuraci&oacute;n. El valor <code>shareddb</code> especifica el uso de una base de datos compartida para almacenar los datos de configuraci&oacute;n.</p>
<p>Esta opci&oacute;n se omite si se activa el Servicio de Disponibilidad.</p>
</dd>
<dt>Tipo de Almac&eacute;n de Mensajes</dt>
<dd>
<p>El tipo de almac&eacute;n de datos para datos de los mensajes en los brokers de un cluster convencional. El valor <code>file</code> especifica un almac&eacute;n de archivos. El valor <code>jdbc</code> especifica un almac&eacute;n JDBC.</p>
<p>Esta opci&oacute;n se omite si se activa el Servicio de Disponibilidad.</p>
</dd>
<dt>Proveedor de Base de Datos</dt>
<dt>Nombre de Usuario de Base de Datos</dt>
<dt>Contrase&ntilde;a de Base de Datos</dt>
<dt>URL de Acceso a Base de Datos</dt>
<dd>
<p>El proveedor de la base de datos, el usuario, la contrase&ntilde;a y la direcci&oacute;n url de acceso de la base de datos JDBC a utilizar en cualquiera de estas situaciones:</p>
<ul>
<li>
<p>Cuando el Servicio de Disponibilidad est&aacute; activado</p>
</li>
<li>
<p>Cuando el Tipo de Almac&eacute;n de Configuraci&oacute;n se define como <code>shareddb</code></p>
</li>
<li>
<p>Cuando Tipo de Almac&eacute;n de Mensajes se define como <code>jdbc</code></p>
</li>
</ul>
<p>Para obtener informaci&oacute;n sobre proveedores compatibles y los formatos de direcciones url de acceso de cada proveedor, consulte la secci&oacute;n sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244"><i>persistencia basada en JDBC</i> en la gu&iacute;a <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales para la disponibilidad de JMS.</p>
<p>Servidor GlassFish no predefine las propiedades adicionales de disponibilidad de JMS.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>Tareas Relacionadas</h5>
<p><a href="task-jmsservice.html">Configurar el Servicio JMS</a></p>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
