<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsservice"></a><h4>Servicio JMS</h4>
<a name="indexterm-43"></a><p>Utilice la p&#225;gina Servicio JMS para ajustar los par&#225;metros de configuraci&#243;n que
se van a utilizar en todas las conexiones JMS.</p>

<p>Para obtener m&#225;s informaci&#243;n sobre c&#243;mo configurar el servicio JMS, consulte el
<a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2418&id=beaob">Cap&#237;tulo 16, Using the Java Message Service de <i>Oracle GlassFish Server 3.1 Application Development Guide</i></a>.</p>

<p>La p&#225;gina Servicio JMS contiene las siguientes opciones.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer las opciones que tienen valores por defecto a estos. Las opciones que no tienen valores por defecto no se modifican.</p>

</dd>
<dt>Ping</dt>
<dd><p>Bot&#243;n para comprobar que el servicio JMS se est&#225; ejecutando en el host JMS predeterminado. Si el servicio JMS est&#225; iniciado y en ejecuci&#243;n, un mensaje informa que el ping se ha realizado correctamente.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>El nombre de la configuraci&#243;n a la que aplicar los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Tipo</dt>
<dd><p>El tipo de acceso para el servicio JMS. Las opciones disponibles son:</p>

<dl><dt>EMBEDDED</dt>
<dd><p>Acceso al servicio JMS en el host local. El servicio JMS se inicia en la misma m&#225;quina JVM que Servidor GlassFish. La inicializaci&#243;n m&#237;nima inicia el agente intermediario predeterminado incrustado al acceder por primera vez a los servicios JMS, en lugar de al iniciar Servidor GlassFish. &#201;ste es el tipo predeterminado de servicio JMS.</p>

</dd>
<dt>LOCAL</dt>
<dd><p>Acceso al servicio JMS en el host local. El proveedor JMS se inicia junto con Servidor GlassFish.</p>

</dd>
<dt>REMOTE</dt>
<dd><p>Acceso al servicio JMS en otro sistema. Si selecciona REMOTE, Servidor GlassFish no iniciar&#225; el servicio JMS la siguiente vez que se inicie el servidor. En su lugar, el servicio JMS se inicia y se administra a trav&#233;s de Message Queue; por tanto, debe iniciar el agente Message Queue por separado. Para obtener m&#225;s informaci&#243;n sobre c&#243;mo iniciar el agente, consulte la secci&#243;n <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2438&id=aeoby">Starting Brokers de <i>Oracle GlassFish Server Message Queue 4.5 Administration Guide</i></a>. Si selecciona este valor y est&#225; utilizando un host remoto, siga las instrucciones de la secci&#243;n <a href="task-jmshostedit.html">Para editar un host JMS</a> para especificar el nombre del host remoto.</p>

</dd>
</dl>
</dd>
<dt>Tiempo de espera de inicio</dt>
<dd><p>El n&#250;mero de segundos que Servidor GlassFish esperar&#225; para que se inicie el servicio JMS antes de anular el inicio. Para un sistema lento o sobrecargado, aumente el valor predeterminado. El valor predeterminado es 60.</p>

</dd>
<dt>Argumentos de inicio</dt>
<dd><p>Los argumentos para personalizar el inicio del servicio JMS. Puede utilizar todos los argumentos disponibles a trav&#233;s del comando <tt><i>as-install-parent</i>/mq/bin/imqbrokerd</tt>.</p>

</dd>
<dt>Volver a conectar habilitada</dt>
<dd><p>Si la se selecciona la casilla de verificaci&#243;n Volver a conectar habilitada, el servicio JMS intentar&#225; volver a conectarse a un servidor de mensajes (o a la lista de direcciones de AddressList) cuando se pierda una conexi&#243;n. Esta opci&#243;n se habilita por defecto.</p>

</dd>
<dt>Intervalo de reconexi&#243;n</dt>
<dd><p>El n&#250;mero de segundos entre los intentos de reconexi&#243;n. Este intervalo se refiere a intentos con cada direcci&#243;n de la AddressList y direcciones sucesivas de la lista. Si es demasiado corto, este intervalo de tiempo no dar&#225; tiempo al agente para recuperar. Si es demasiado largo, la reconexi&#243;n puede suponer un retraso inaceptable. El valor predeterminado es de 5 segundos.</p>

</dd>
<dt>Intentos de reconexi&#243;n</dt>
<dd><p>Especifica el n&#250;mero de intentos de conexi&#243;n (o reconexi&#243;n) para cada direcci&#243;n de la AddressList antes de que el tiempo de ejecuci&#243;n del cliente contin&#250;e con la siguiente direcci&#243;n de la lista. El valor -1 indica que el n&#250;mero de intentos de reconexi&#243;n es ilimitado (el tiempo d ejecuci&#243;n del cliente intenta conectar con la primera direcci&#243;n hasta que lo consigue). El valor predeterminado es 3.</p>

</dd>
<dt>Host JMS predeterminado</dt>
<dd><p>El nombre del host JMS predeterminado. El valor predeterminado es <tt>default_JMS_host</tt>.</p>

</dd>
<dt>Comportamiento de la lista de direcciones</dt>
<dd><p>El orden de intentos de conexi&#243;n. Las opciones disponibles son:</p>

<dl><dt><tt>random</tt></dt>
<dd><p>Selecciona una direcci&#243;n de lista de direcciones de forma aleatoria. Si hay muchos clientes que intentan una conexi&#243;n utilizando la misma f&#225;brica de conexi&#243;n, especifique <tt>RANDOM</tt> para evitar que todos se conecten a la misma direcci&#243;n. &#201;sta es la opci&#243;n predeterminada.</p>

</dd>
<dt><tt>priority</tt></dt>
<dd><p>La reconexi&#243;n siempre intenta volver a conectarse a la primera direcci&#243;n de servidor de AddressList y utiliza otra solamente cuando el primer agente no est&#225; disponible.</p>

</dd>
</dl>
</dd>
<dt>Iteraciones de lista de direcciones</dt>
<dd><p>El n&#250;mero de veces que servicio JMS repite el recorrido por la lista AddressList en un esfuerzo por establecer (o restablecer) una conexi&#243;n. El valor -1 indica que el n&#250;mero de intentos es ilimitado. El valor predeterminado es 3.</p>

</dd>
<dt>Esquema MQ y Servicio MQ</dt>
<dd><p>El nombre de esquema de la direcci&#243;n de Message Queue y el nombre del servicio de conexi&#243;n de Message Queue si no se van a utilizar esquemas o servicios no predeterminados. Consulte <a href="ref-mqschemeservice.html">Sintaxis de las direcciones de esquema MQ y servicio MQ</a> para obtener informaci&#243;n sobre la sintaxis.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales del servicio JMS.</p>

<p>Para obtener informaci&#243;n sobre las propiedades disponibles, consulte <a href="ref-jmsservice-additional-props.html">Propiedades espec&#237;ficas del servicio JMS</a>.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jmsservice.html">C&#243;mo configurar el servicio JMS</a></p>

</li>
<li><p><a href="task-jmshostnew.html">Para crear un host JMS</a></p>

</li>
<li><p><a href="task-jmshostedit.html">Para editar un host JMS</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">Para eliminar un host JMS</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=jms-ping-1"><tt>jms-ping</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
