<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsconnectionproperties"></a><h4>Propiedades espec&#237;ficas de las f&#225;bricas de conexi&#243;n JMS</h4>
<a name="indexterm-33"></a><a name="indexterm-34"></a><p>Las siguientes propiedades adicionales est&#225;n disponibles para las f&#225;bricas de conexi&#243;n JMS.</p>

<dl><dt><tt>ClientID</tt></dt>
<dd><p>Especifica un ID de cliente para una f&#225;brica de conexi&#243;n que utilizar&#225; una suscripci&#243;n duradera.</p>

</dd>
<dt><tt>AddressList</tt></dt>
<dd><p>Indique el nombre (y, de forma opcional, n&#250;mero de puerto) de una instancia o instancias del agente de mensajes con el que se comunicar&#225;n las aplicaciones. Cada una de las direcciones de la lista incluye el nombre del host (y, de forma opcional, el puerto del host y el servicio de conexi&#243;n) para efectuar la conexi&#243;n. Por ejemplo, el valor podr&#237;a ser <tt>earth</tt> o <tt>earth:7677</tt>. Especifique el n&#250;mero de puerto si el agente de mensajes se est&#225; ejecutando en un puerto distinto del predeterminado (7676). Si la configuraci&#243;n de propiedades indica varios hosts y puertos en un entorno de cl&#250;steres, se utiliza el primer host disponible de la lista, a menos que la propiedad <tt>AddressListBehavior</tt> se defina en <tt>RANDOM</tt>.</p>

<p>Para obtener m&#225;s detalles, consulte la <b>Gu&#237;a del desarrollador de Message Queue para clientes Java</b>.</p>

<p>El valor predeterminado es el host local y el n&#250;mero de puerto predeterminado (7676). El cliente intentar&#225; una conexi&#243;n a un agente en el puerto 7676 del host local.</p>

</dd>
<dt><tt>UserName</tt></dt>
<dd><p>El nombre de usuario para la f&#225;brica de conexi&#243;n.</p>

<p>El valor predeterminado es <tt>guest</tt>.</p>

</dd>
<dt><tt>Contrase&#241;a</tt></dt>
<dd><p>La contrase&#241;a para la f&#225;brica de conexi&#243;n.</p>

<p>El valor predeterminado es <tt>guest</tt>.</p>

</dd>
<dt><tt>ReconnectEnabled</tt></dt>
<dd><p>Si est&#225; establecida como <tt>true</tt>, indica que el tiempo de ejecuci&#243;n del cliente intenta volver a conectar con un servidor de mensajes (o la lista de direcciones de <tt>AddressList</tt>) cuando se pierde una conexi&#243;n.</p>

<p>El valor predeterminado es <tt>verdadero</tt>.</p>

</dd>
<dt><tt>ReconnectAttempts</tt></dt>
<dd><p>Especifica el n&#250;mero de intentos de conectar (o volver a conectar) para cada direcci&#243;n de la <tt>AddressList</tt> antes de que el tiempo de ejecuci&#243;n del cliente contin&#250;e con la siguiente direcci&#243;n de la lista. El valor -1 indica que el n&#250;mero de intentos de reconexi&#243;n es ilimitado (el tiempo d ejecuci&#243;n del cliente intenta conectar con la primera direcci&#243;n hasta que lo consigue).</p>

<p>El valor predeterminado es 3.</p>

</dd>
<dt><tt>ReconnectInterval</tt></dt>
<dd><p>Especifica en milisegundos el intervalo entre dos intentos de reconexi&#243;n. Se refiere a intentos en cada direcci&#243;n de la <tt>AddressList</tt> y direcciones sucesivas de la lista. Si el intervalo es demasiado corto, el agente no tiene tiempo de recuperar. Si es demasiado largo, la reconexi&#243;n puede suponer un retraso inaceptable.</p>

<p>El valor predeterminado es 30000.</p>

</dd>
<dt><tt>AddressListBehavior</tt></dt>
<dd><p>Especifica si los intentos de conexi&#243;n se realizan en el orden de las direcciones del atributo <tt>AddressList</tt> (<tt>PRIORITY</tt>) o de forma aleatoria (<tt>RANDOM</tt>).</p>

<p><tt>RANDOM</tt> significa que la reconexi&#243;n selecciona una direcci&#243;n al azar de la <tt>AddressList</tt>. Si es probable que muchos clientes intenten una conexi&#243;n con la misma f&#225;brica de conexi&#243;n, este valor evita que se conecten todos a la misma direcci&#243;n.</p>

<p><tt>PRIORITY</tt> significa que la reconexi&#243;n siempre intenta conectar con la primera direcci&#243;n del servidor en la <tt>AddressList</tt> y utiliza otra direcci&#243;n s&#243;lo si el primer agente no est&#225; disponible.</p>

<p>El valor predeterminado es <tt>RANDOM</tt>.</p>

</dd>
<dt><tt>AddressListIterations</tt></dt>
<dd><p>Especifica el n&#250;mero de veces que el tiempo de ejecuci&#243;n del cliente se repite a trav&#233;s de la <tt>AddressList</tt> en un esfuerzo por establecer (o restablecer) una conexi&#243;n. El valor -1 indica que el n&#250;mero de intentos es ilimitado.</p>

<p>El valor predeterminado es 3.</p>

</dd>
</dl>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
