<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationnew" name="task-jmsdestinationnew"></a><a id="GHJMS00023" name="GHJMS00023"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Crear un Recurso de Destino JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Cuando se crea un recurso de destino JMS, Servidor GlassFish crea un Recurso de Objeto de Administraci&oacute;n para el recurso de destino. Puede visualizar este recurso bajo el nodo Conectores.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos de JMS.</p>
</li>
<li>
<p>En el nodo Recursos de JMS, seleccione el nodo Recursos de Destino JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos de Destino JMS.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos de Destino JMS, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Recurso de Destino JMS.</p>
</li>
<li>
<p>En el campo Nombre JNDI, introduzca el nombre JNDI del recurso.</p>
<p>Es una pr&aacute;ctica recomendada utilizar el prefijo de subcontexto de nomenclatura <code>jms/</code> para recursos de JMS. Por ejemplo: <code>jms/Queue</code>.</p>
</li>
<li>
<p>En el campo Nombre de Destino F&iacute;sico, introduzca el nombre del destino f&iacute;sico que se asociar&aacute; a este recurso.</p>
<p>Servidor GlassFish crear&aacute; el destino f&iacute;sico autom&aacute;ticamente cuando sea necesario y lo suprimir&aacute; cuando se suprima el recurso de destino.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Recurso, seleccione <code>javax.jms.Topic</code> o <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, escriba una descripci&oacute;n del recurso de destino.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n de activaci&oacute;n de Estado para activar el recurso en tiempo de ejecuci&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el &aacute;rea de Propiedades Adicionales, indique las propiedades adicionales para el recurso de destino.</p>
<p>ProductName; no define ninguna propiedad adicional para los recursos de destino JMS.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila vac&iacute;a, escriba el nombre de la propiedad en el campo Nombre y el valor de la propiedad en el campo Valor.</p>
</li>
<li>
<p>In the Targets area, do the following:</p>
<ol type="a">
<li>
<p>From the Available column, select the target or targets to which applications that use the resource will be deployed.</p>
<p>The available targets include the available clusters and server instances, as well as the default server instance, <code>server</code>.</p>
</li>
<li>
<p>Click Add to move the target to the Selected column.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Crear un Recurso de F&aacute;bricas de Conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Editar un Recurso de F&aacute;bricas de Conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suprimir un Recurso de F&aacute;brica de Conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Editar un Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suprimir un Recurso de Destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
