<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationedit" name="task-jmsdestinationedit"></a><a id="GHJMS00024" name="GHJMS00024"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Editar un Recurso de Destino JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos de JMS.</p>
</li>
<li>
<p>En el nodo Recursos de JMS, seleccione el nodo Recursos de Destino JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos de Destino JMS.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos de Destino JMS, haga clic en el nombre del recurso de destino que vaya a editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Recurso de Destino JMS.</p>
</li>
<li>
<p>En el campo Nombre de Destino F&iacute;sico, introduzca el nombre del destino f&iacute;sico que se asociar&aacute; a este recurso.</p>
<p>Servidor GlassFish crear&aacute; el destino f&iacute;sico autom&aacute;ticamente cuando sea necesario y lo suprimir&aacute; cuando se suprima el recurso de destino.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Recurso, seleccione <code>javax.jms.Topic</code> o <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, escriba una descripci&oacute;n del recurso de destino.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n de activaci&oacute;n de Estado para activar el recurso en tiempo de ejecuci&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el &aacute;rea de Propiedades Adicionales, indique las propiedades adicionales para el recurso de destino.</p>
<p>ProductName; no define ninguna propiedad adicional para los recursos de destino JMS.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, escriba el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite su campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, seleccione la casilla de verificaci&oacute;n a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Optionally, click the Targets tab to go to the JMS Destination Resource Targets page. On this page, do the following:</p>
<ol type="a">
<li>
<p>Click Manage Targets to open the Manage Resource Targets page.</p>
<p>On this page, move targets between the Available column and the Selected column. Make sure to place in the Selected column the target or targets to which applications that use the resource will be deployed. The available targets include the available clusters and server instances, as well as the default server instance, <code>server</code>. Click OK to save the changes.</p>
</li>
<li>
<p>Select the checkbox for a target, then click Enable or Disable to enable or disable the resource for that target.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Crear un Recurso de F&aacute;bricas de Conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Editar un Recurso de F&aacute;bricas de Conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suprimir un Recurso de F&aacute;brica de Conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Crear un Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suprimir un Recurso de Destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
