<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmshostnew"></a><h4>Para crear un host JMS</h4><a name="indexterm-14"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, amplie el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione y expanda el nodo Java Message Service.</b></li>
<li><b>En el nodo Java Message Service, seleccione el nodo Hosts JMS.</b><p>Se abrir&#225; la p&#225;gina Hosts JMS.</p></li>
<li><b>En la p&#225;gina Host JMS, haga clic en Nuevo.</b><p>Se mostrar&#225; la p&#225;gina Nuevo host JMS.</p></li>
<li><b>En el campo Nombre, introduzca el nombre del host.</b><p>Por ejemplo:</p><pre>NewJmsHost</pre></li>
<li><b>En el campo Host, introduzca el nombre o la direcci&#243;n IP (Internet
Protocol) del sistema donde se ejecutar&#225; el host JMS (<tt>localhost </tt> o el
nombre del sistema local o remoto).</b></li>
<li><b>En el campo Puerto, introduzca el n&#250;mero de puerto del servicio JMS.</b><p>Modifique este campo s&#243;lo si el servicio JMS que va a utilizar
se ejecuta en un puerto que no es el predeterminado. El puerto
predeterminado es 7676.</p></li>
<li><b>En los campos Nombre de usuario de administraci&#243;n y Contrase&#241;a de administraci&#243;n,
introduzca el nombre de usuario y la contrase&#241;a del agente de Message
Queue.</b><p>&#201;stos son diferentes del nombre de usuario y la contrase&#241;a de GlassFish
Server. Edite estos campos solamente si los valores del agente intermediario de
Message Queue se han modificado mediante el comando <tt><i>as-install-parent</i>/mq/bin/imqusermgr</tt>. Los valores predeterminados
son <tt>admin</tt> y <tt> admin</tt>.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-jmsservice.html">C&#243;mo configurar el servicio JMS</a></p>

</li>
<li><p><a href="task-jmshostedit.html">Para editar un host JMS</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">Para eliminar un host JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestnew.html">Para crear un destino f&#237;sico JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestedit.html">Para editar un destino f&#237;sico JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestdelete.html">Para eliminar un destino f&#237;sico JMS</a></p>

</li>
<li><p><a href="task-jmsflushmessages.html">Para retirar mensajes de un destino f&#237;sico JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldeststats.html">Para ver las estad&#237;sticas para un destino f&#237;sico JMS</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
