<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmsdestinationnew"></a><h3>Para crear un recurso de destino JMS</h3><a name="indexterm-7"></a><a name="indexterm-8"></a><p>Cuando se crea un recurso de destino JMS, Servidor GlassFish crea un recurso
de objeto de administrador para el recurso de destino. Puede visualizar este
recurso bajo el nodo Conectores.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, amplie el nodo Recursos.</b></li>
<li><b>En el nodo Recursos, ampl&#237;e el nodo Recursos JMS.</b></li>
<li><b>En el nodo Recursos JMS, seleccione el nodo Recursos de destino JMS.</b><p>Se abrir&#225; la p&#225;gina Recursos de destino JMS.</p></li>
<li><b>En la p&#225;gina Recursos de destino JMS, haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo recurso de destino JMS.</p></li>
<li><b>En el campo Nombre JNDI, introduzca el nombre JNDI del recurso.</b><p>Es una pr&#225;ctica recomendada utilizar el prefijo de subcontexto de nomenclatura <tt>jms/</tt>
para recursos JMS. Por ejemplo: <tt>jms/Queue</tt>.</p></li>
<li><b>En el campo Nombre de destino f&#237;sico, introduzca el nombre del destino
f&#237;sico que se asociar&#225; a este recurso.</b><p>Servidor GlassFish crear&#225; el destino f&#237;sico autom&#225;ticamente cuando sea necesario y lo
eliminar&#225; cuando se elimine el recurso de destino.</p></li>
<li><b>En la lista desplegable Tipo de recurso, seleccione <tt> javax.jms.Topic</tt> o <tt>javax.jms.Queue</tt>.</b></li>
<li><b>En el campo Descripci&#243;n, escriba una descripci&#243;n del recurso de destino.</b></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar el recurso en
tiempo de ejecuci&#243;n.</b><p>Esta opci&#243;n se habilita por defecto.</p></li>
<li>(Opcional) <b>En el &#225;rea de Propiedades adicionales, indique las propiedades adicionales para el
recurso de destino. </b><p>ProductName; no define ninguna propiedad adicional para los recursos de destino JMS.</p><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-jmsconnectionnew.html">Para crear un recurso de f&#225;brica de conexi&#243;n JMS</a></p>

</li>
<li><p><a href="task-jmsconnectionedit.html">Para editar un recurso de f&#225;brica de conexi&#243;n JMS</a></p>

</li>
<li><p><a href="task-jmsconnectiondelete.html">Para eliminar un recurso de f&#225;brica de conexi&#243;n JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationedit.html">Para editar un recurso de destino JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationdelete.html">Para eliminar un recurso de destino JMS</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
