<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmshostedit" name="task-jmshostedit"></a><a id="GHJMS00028" name="GHJMS00028"></a></p>

<h4><a id="sthref26" name="sthref26"></a>Editar un Host JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Select the instance to configure:</p>
<ul>
<li>
<p>To configure a particular instance, select the instance's config node. For example, for the default instance, <code>server</code>, select the <code>server-config</code> node.</p>
</li>
<li>
<p>To configure the default settings for future instances that use a copy of <code>default-config</code>, select the <code>default-config</code> node.</p>
</li>
</ul>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, ampl&iacute;e el nodo Java Message Service.</p>
</li>
<li>
<p>En el nodo Java Message Service, seleccione el nodo Hosts JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina Hosts JMS.</p>
</li>
<li>
<p>En la p&aacute;gina Hosts JMS, seleccione el host que va a editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Host JMS.</p>
</li>
<li>
<p>En el campo Host, introduzca el nombre o la direcci&oacute;n IP (Internet Protocol) del sistema donde se ejecutar&aacute; el host JMS (<code>localhost</code> o el nombre del sistema local o remoto).</p>
</li>
<li>
<p>En el campo Puerto, introduzca el n&uacute;mero de puerto del servicio JMS.</p>
<p>Modifique este campo s&oacute;lo si el servicio JMS que va a utilizar se ejecuta en un puerto que no es el que se utiliza por defecto. El puerto por defecto es 7676.</p>
</li>
<li>
<p>En los campos Nombre de Usuario Administrador y Contrase&ntilde;a de Administrador, introduzca el nombre de usuario y la contrase&ntilde;a del broker de Message Queue.</p>
<p>&Eacute;stos son diferentes del nombre de usuario y la contrase&ntilde;a de Servidor GlassFish. Edite estos campos solamente si los valores del broker de Message Queue se han modificado mediante el comando <i>as-install-parent</i><code>/mq/bin/imqusermgr</code>. Los valores por defecto son <code>admin</code> y <code>admin</code>.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Configurar el Servicio JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Crear un Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Suprimir un Host JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Crear un Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Editar un Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Suprimir un Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Eliminar Mensajes de un Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Ver Estad&iacute;sticas de un Destino F&iacute;sico JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
