<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-transactionsvcproperties"></a><h4>F&#252;r den Transaktionsdienst spezifische Eigenschaften</h4>
<a name="indexterm-9"></a><a name="indexterm-10"></a><p>Die folgenden Eigenschaften sind f&#252;r die Konfiguration des Transaktionsdienstes verf&#252;gbar.</p>

<dl><dt><tt>oracle-xa-recovery-workaround</tt></dt>
<dd><p>Wenn diese Eigenschaft auf <tt>true</tt> gesetzt ist, wird der Oracle XA Ressource-Workaround zur Wiederherstellung von Transaktionen verwendet. Der Standardwert lautet <tt>true</tt>.</p>

</dd>
<dt><tt>disable-distributed-transaction-logging</tt></dt>
<dd><p>Wenn diese Eigenschaft auf <tt>true</tt> gesetzt ist, ist die Transkationsprotokollierung deaktiviert, was u.&#160;U. die Leistung steigern kann. Wenn das Kontrollk&#228;stchen "Beim Neustart aktiviert" aktiviert ist, wird diese Eigenschaft ignoriert. Der Standardwert ist <tt>false</tt>.</p>

</dd>
<dt><tt>xaresource-txn-timeout</tt></dt>
<dd><p>&#196;ndert die <tt>XAResource-</tt> Zeit&#252;berschreitung. In einigen F&#228;llen kann die <tt>XAResource</tt> Standardzeit&#252;berschreitung dazu f&#252;hren, dass Transaktionen abgebrochen werden; eine &#196;nderung ist daher w&#252;nschenswert. Der Standardwert ist f&#252;r die vewendete <tt>XAResource</tt> spezifisch.</p>

</dd>
<dt><tt>pending-txn-cleanup-interval</tt></dt>
<dd><p>Gibt den Zeitraum (in Sekunden) an, w&#228;hrend dessen ein asynchroner Thread auf anstehende Transaktionen pr&#252;ft und diese abschlie&#223;t. Wenn diese Eigenschaft nicht angegeben wird, gibt es keinen Standardwert. Wenn diese Eigenschaft angegeben, aber kein Wert spezifiziert ist, betr&#228;gt der Standardwert 60.</p>

</dd>
<dt><tt>use-last-agent-optimization</tt></dt>
<dd><p>Wenn diese Eigenschaft auf <tt>true</tt> gesetzt ist, ist Last-Agent-Optimierung aktiviert, was den Durchsatz an Transaktionen erh&#246;ht. Wenn eine Nicht-XA-Ressource in derselben Transaktion zusammen mit XA-Ressourcen verwendet wird, ist die Nicht-XA-Ressource der letzte Agent. Der Standardwert lautet <tt>true</tt>.</p>

</dd>
<dt><tt>delegated-recovery</tt></dt>
<dd><p>Wenn diese Eigenschaft auf <tt>true</tt> gesetzt ist, ist die clusterweite Wiederherstellung aktiviert. Der Standardwert lautet "false".</p>

</dd>
<dt><tt>wait-time-before-recovery-insec</tt></dt>
<dd><p>Gibt die Wartezeit (in Sekunden) an, nach der eine Instanz die Wiederherstellung f&#252;r eine ausgefallene Instanz startet. </p>

</dd>
<dt><tt>db-logging-resource</tt></dt>
<dd><p>Gibt den JNDI-Namen der JDBC-Ressource f&#252;r die Datenbank an, in der Transaktionen protokolliert werden. Weitere Informationen finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2418&id=beanm">Kapitel 14, Using the Transaction Service in <i>Oracle GlassFish Server 3.1 Application Development Guide</i></a>. Hierf&#252;r gibt es keinen Standardwert.</p>

</dd>
<dt><tt>xa-servername</tt></dt>
<dd><p>Gibt den Hostnamen an, den der Transktionsdienst verwendet, um die vom installierten GlassFish-Server verwalteten Transaktionen zu identifizieren. Dies kann u. U. n&#252;tzlich sein zur Wiederherstellung von Transaktionen aus der Protokolldatei, die auf einem anderen Host, auf dem GlassFish-Server ausgef&#252;hrt wird, erstellt worden ist.</p>

</dd>
</dl>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
