<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setkeyptinterval"></a><h3>So legen Sie das Schl&#252;sselpunktintervall fest</h3><a name="indexterm-6"></a><a name="indexterm-7"></a><p>Schl&#252;sselpunktoperationen komprimieren die Transaktionsprotokolldatei. Das Schl&#252;sselpunktintervall entspricht der Anzahl von Transaktionen zwischen
Schl&#252;sselpunktvorg&#228;ngen, die f&#252;r das Protokoll durchgef&#252;hrt werden. Schl&#252;sselpunktoperationen k&#246;nnen die Gr&#246;&#223;e der
Transaktionsprotokolldateien verringern. Ein hoher Wert f&#252;r Schl&#252;sselpunktintervalle f&#252;hrt zu gr&#246;&#223;eren Transaktionsprotokolldateien, einer
geringeren Anzahl von Schl&#252;sselpunktvorg&#228;ngen sowie m&#246;glicherweise einer besseren Leistung. Ein kleinerer Wert
f&#252;r Schl&#252;sselpunktintervalle (z. B. 256) f&#252;hrt zu kleineren Protokolldateien, jedoch aufgrund h&#228;ufigerer
Schl&#252;sselpunktoperationen zu einer beeintr&#228;chtigten Leistung.</p>

<ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Knoten "Konfiguration".</b></li>
<li><b>W&#228;hlen Sie die zu konfigurierende Instanz:</b><ul>
<li><b>Um eine bestimmte Instanz zu konfigurieren, w&#228;hlen Sie den Konfigurationsknoten der Instanz
aus. F&#252;r die Standardinstanz <tt>server</tt> w&#228;hlen Sie z. B. den Knoten <tt>server-config</tt>.</b></li>
<li><b>Um die Standardeinstellungen f&#252;r alle Instanzen zu konfigurieren, w&#228;hlen Sie den Knoten
<tt>default-config</tt>.</b></li></ul></li>
<li><b>W&#228;hlen Sie den Knoten "Transaktionsdienst".</b><p>Die Seite "Transaktionsdienst" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie im Feld "Schl&#252;sselpunktintervall" die Anzahl der Transaktionen zwischen Schl&#252;sselpunktvorg&#228;ngen ein.</b><p>Der Standardwert betr&#228;gt 65.536.</p></li>
<li><b>Klicken Sie auf "Speichern".</b></li></ol><p></b>Siehe auch</b></p>
<ul><li><p><a href="task-configtransservice.html">So konfigurieren Sie den Transaktionsdienst</a></p>

</li>
<li><p><a href="task-configtransrecovery.html">So konfigurieren Sie die Wiederherstellung von Transaktionen in GlassFish-Server</a></p>

</li>
<li><p><a href="task-settranstimeout.html">So legen Sie einen Zeit&#252;berschreitungswert f&#252;r Transaktionen fest</a></p>

</li>
<li><p><a href="task-settranslog.html">So legen Sie den Speicherort f&#252;r Transaktionsprotokolle fest</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
