<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 1997, 2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at packager/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>Copyright</title>
</head>
<body>
<!-- help content -->
<a name="wp1022127"> </a>
<h2 class="pHeading2">Copyright
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Copyright &copy; 2005, 2010, Oracle et/ou ses affili&eacute;s. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">Ce logiciel et la documentation qui l&rsquo;accompagne sont prot&eacute;g&eacute;s par les lois sur la propri&eacute;t&eacute; intellectuelle. Sauf disposition de votre contrat de licence ou de la loi, vous ne pouvez pas copier, reproduire, traduire, diffuser, modifier, breveter, transmettre, distribuer, exposer, ex&eacute;cuter, publier ou afficher le logiciel, m&ecirc;me partiellement, sous quelque forme et par quelque proc&eacute;d&eacute; que ce soit. Par ailleurs, il est interdit de proc&eacute;der &agrave; toute ing&eacute;nierie inverse du logiciel, de le d&eacute;sassembler ou de le d&eacute;compiler, except&eacute; &agrave; des fins d&rsquo;interop&eacute;rabilit&eacute; avec des logiciels tiers ou tel que prescrit par la loi.
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">
  Les informations fournies dans ce document sont susceptibles de modification sans pr&eacute;avis. Par ailleurs, Oracle Corporation ne garantit pas qu&rsquo;elles soient exemptes d&rsquo;erreurs et vous invite, le cas &eacute;ch&eacute;ant, &agrave; lui en faire part par &eacute;crit.
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">
  Si ce logiciel, ou la documentation qui l&rsquo;accompagne, est conc&eacute;d&eacute; sous licence au Gouvernement des &Eacute;tats-Unis, ou &agrave; toute entit&eacute; qui d&eacute;livre la licence de ce logiciel ou l&rsquo;utilise pour le compte du Gouvernement des &Eacute;tats-Unis, la notice suivante s&rsquo;applique :
</p>
<a name="wp1022136"> </a>
<p class="pParagraph">
  U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are &quot;commercial computer software&quot; or &quot;commercial technical data&quot; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065.
</p>
<a name="wp1022137"> </a>
<p class="pParagraph">
  Ce logiciel ou mat&eacute;riel a &eacute;t&eacute; d&eacute;velopp&eacute; pour un usage g&eacute;n&eacute;ral dans le cadre d&rsquo;applications de gestion des informations. Ce logiciel ou mat&eacute;riel n&rsquo;est pas con&ccedil;u ni n&rsquo;est destin&eacute; &agrave; &ecirc;tre utilis&eacute; dans des applications &agrave; risque, notamment dans des applications pouvant causer des dommages corporels. Si vous utilisez ce logiciel ou mat&eacute;riel dans le cadre d&rsquo;applications dangereuses, il est de votre responsabilit&eacute; de prendre toutes les mesures de secours, de sauvegarde, de redondance et autres mesures n&eacute;cessaires &agrave; son utilisation dans des conditions optimales de s&eacute;curit&eacute;. Oracle Corporation et ses affili&eacute;s d&eacute;clinent toute responsabilit&eacute; quant aux dommages caus&eacute;s par l&rsquo;utilisation de ce logiciel ou mat&eacute;riel pour ce type d&rsquo;applications.
</p>
<a name="wp1022138"> </a>
<p class="pParagraph">
  Oracle et Java sont des marques d&eacute;pos&eacute;es d&rsquo;Oracle Corporation et/ou de ses affili&eacute;s. Tout autre nom mentionn&eacute; peut correspondre &agrave; des marques appartenant &agrave; d&rsquo;autres propri&eacute;taires qu&rsquo;Oracle.
</p>
<a name="wp1022139"> </a>
<p class="pParagraph">
  AMD, Opteron, le logo AMD et le logo AMD Opteron sont des marques ou des marques d&eacute;pos&eacute;es d&rsquo;Advanced Micro Devices. Intel et Intel Xeon sont des marques ou des marques d&eacute;pos&eacute;es d&rsquo;Intel Corporation. Toutes les marques SPARC sont utilis&eacute;es sous licence et sont des marques ou des marques d&eacute;pos&eacute;es de SPARC International, Inc. UNIX est une marque d&eacute;pos&eacute;e conc&eacute;d&eacute;e sous licence par X/Open Company, Ltd.
</p>
<a name="wp1022140"> </a>
<p class="pParagraph">
  Ce logiciel ou mat&eacute;riel et la documentation qui l&rsquo;accompagne peuvent fournir des informations ou des liens donnant acc&egrave;s &agrave; des contenus, des produits et des services &eacute;manant de tiers. Oracle Corporation et ses affili&eacute;s d&eacute;clinent toute responsabilit&eacute; ou garantie expresse quant aux contenus, produits ou services &eacute;manant de tiers. En aucun cas, Oracle Corporation et ses affili&eacute;s ne sauraient &ecirc;tre tenus pour responsables des pertes subies, des co&ucirc;ts occasionn&eacute;s ou des dommages caus&eacute;s par l&rsquo;acc&egrave;s &agrave; des contenus, produits ou services tiers, ou &agrave; leur utilisation.
</p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">Notices l&eacute;gales</a>
</body>
</html>




