<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmshostedit"></a><h4>Modification d&#8217;un h&#244;te JMS</h4>
<a name="indexterm-48"></a><p>Utilisez la page Modification d&#8217;un h&#244;te JMS pour modifier les param&#232;tres d&#8217;un
h&#244;te JMS. </p>

<p>La page Modification d&#8217;un h&#244;te JMS contient les options suivantes. </p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Nom</dt>
<dd><p>Le nom de l&#8217;h&#244;te. Le champ Nom est en lecture seule. Vous pouvez sp&#233;cifier le champ Nom uniquement lorsque vous cr&#233;ez un nouvel h&#244;te JMS.</p>

</dd>
<dt>H&#244;te</dt>
<dd><p>Le nom ou l&#8217;adresse IP du syst&#232;me sur lequel l&#8217;h&#244;te JMS s&#8217;ex&#233;cutera (<tt>localhost</tt> ou le nom du syst&#232;me local ou distant).</p>

</dd>
<dt>Port</dt>
<dd><p>Le num&#233;ro de port du service JMS. Ne modifiez ce champ que si le service JMS &#224; utiliser n&#8217;utilise pas le port par d&#233;faut. Le port par d&#233;faut est 7676.</p>

</dd>
<dt>Nom d&#8217;utilisateur admin et Mot de passe Admin</dt>
<dd><p>Le nom d&#8217;utilisateur et le mot de passe du courtier Message Queue. Ceux-ci diff&#232;rent du nom d&#8217;utilisateur et du mot de passe du GlassFish Server. Modifiez ces champs uniquement si les valeurs du courtier Message Queue ont &#233;t&#233; modifi&#233;es &#224; l&#8217;aide de la commande <tt><i>as-install-parent</i>/mq/bin/imqusermgr</tt>. Les valeurs par d&#233;faut sont <tt>admin</tt> et <tt> admin</tt>.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jmsservice.html">Configuration du service JMS</a></p>

</li>
<li><p><a href="task-jmshostnew.html">Cr&#233;ation d'un h&#244;te JMS</a></p>

</li>
<li><p><a href="task-jmshostedit.html">Modification d'un h&#244;te JMS</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">Suppression d'un h&#244;te JMS</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jms-host-1"><tt>create-jms-host</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jms-hosts-1"><tt>list-jms-hosts</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jms-host-1"><tt>delete-jms-host</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=jms-ping-1"><tt>jms-ping</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
