<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsconnectionedit"></a><h4>Modifier l&#8217;usine de connexion JMS</h4>
<a name="indexterm-31"></a><a name="indexterm-32"></a><p>Utilisez la page Modifier l&#8217;usine de connexion JMS pour modifier les param&#232;tres
d&#8217;une usine de connexion JMS. </p>

<p>La page Modifier l&#8217;usine de connexion JMS contient les options suivantes. </p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom du pool</dt>
<dd><p>Nom unique du pool de connexions de connecteur cr&#233;&#233; pour la fabrique de connexion. Ce nom est &#233;galement le nom JNDI de la fabrique de connexion. Le nom du pool est un champ en lecture seule.</p>

</dd>
<dt>Type de ressource</dt>
<dd><p>Le type de l&#8217;usine de connexion. Le type de ressource est un champ en lecture seule. Vous pouvez sp&#233;cifier le type de ressource uniquement lorsque vous cr&#233;ez une nouvelle usine de connexion JMS.</p>

</dd>
<dt>Description</dt>
<dd><p>Une description de l&#8217;usine de connexion.</p>

</dd>
<dt>Statut</dt>
<dd><p>Le statut de l&#8217;usine de connexion. L&#8217;usine de connexion peut &#234;tre activ&#233;e ou d&#233;sactiv&#233;e. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Taille initiale et minimale du pool</dt>
<dd><p>Nombre minimum de connexions dans le pool pour l&#8217;usine de connexion. La valeur par d&#233;faut est 8.</p>

</dd>
<dt>Taille maximale du pool</dt>
<dd><p>Nombre maximum de connexions dans le pool. La valeur par d&#233;faut est 32.</p>

</dd>
<dt>Valeur de redimensionnement du pool</dt>
<dd><p>Nombre de connexions &#224; supprimer lorsque le d&#233;lai d&#8217;inactivit&#233; du pool expire. La valeur par d&#233;faut est 2.</p>

</dd>
<dt>D&#233;lai d&#8217;inactivit&#233;</dt>
<dd><p>Temps maximum en secondes durant lequel une connexion demeure inactive dans le pool. La valeur par d&#233;faut est 300.</p>

</dd>
<dt>Attente max.</dt>
<dd><p>Dur&#233;e pendant laquelle l&#8217;application demandant une connexion doit patienter avant d&#8217;&#234;tre notifi&#233;e de l&#8217;expiration de la connexion. La valeur par d&#233;faut est 60 000.</p>

</dd>
<dt>Sur tout &#233;chec</dt>
<dd><p>Si la case Fermer toutes les connexions est coch&#233;e, GlassFish Server interrompt toutes les connexions du pool et les r&#233;tablit si une seule connexion &#233;choue. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Prise en charge des transactions</dt>
<dd><p>La valeur peut &#234;tre l&#8217;une des suivantes&#160;:</p>

<dl><dt>XATransaction</dt>
<dd><p>La ressource peut &#234;tre utilis&#233;e pour des transactions impliquant l&#8217;utilisation de plusieurs ressources dans une &#233;tendue de transaction. Il s&#8217;agit de la valeur par d&#233;faut pour une usine de connexion JMS. </p>

<p>Par exemple, les transactions peuvent impliquer cette ressource ainsi qu&#8217;une ressource JDBC, une ressource de connecteur ou une autre ressource d&#8217;usine de connexion JMS. Cette valeur offre un maximum de flexibilit&#233;. Une ressource qui est configur&#233;e comme XATransaction participera aux op&#233;rations de validation &#224; deux phases.</p>

</dd>
<dt>LocalTransaction</dt>
<dd><p>La ressource peut &#234;tre utilis&#233;e soit pour les transactions qui impliquent uniquement une ressource dans l&#8217;&#233;tendue de la transaction soit en tant que dernier agent dans une transaction distribu&#233;e qui implique plus d&#8217;une ressource XA.</p>

<p>Cette valeur permet de bien meilleures performances. Une ressource qui est configur&#233;e en tant que LocalTransaction ne sera pas utilis&#233;e dans les op&#233;rations de validation &#224; deux phases.</p>

</dd>
<dt>NoTransaction</dt>
<dd><p>La ressource ne peut participer &#224; aucune transaction. Dans les applications JMS, l&#8217;utilisation de cette configuration est limit&#233;e.</p>

</dd>
</dl>
</dd>
<dt>Validation des connexions</dt>
<dd><p>Si la case Requis est s&#233;lectionn&#233;e, les connexions sont valid&#233;es avant d&#8217;&#234;tre donn&#233;es &#224; l&#8217;application. Si la validation d&#8217;une ressource &#233;choue, elle est d&#233;truite et une nouvelle ressource est cr&#233;&#233;e et renvoy&#233;e. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s pour l&#8217;usine de connexion.</p>

<p>Pour plus d&#8217;informations sur les propri&#233;t&#233;s disponibles, reportez-vous &#224; la rubrique <a href="ref-jmsconnectionproperties.html">Propri&#233;t&#233;s sp&#233;cifiques aux usines de connexion JMS</a>.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jmsconnectionnew.html">Pour cr&#233;er une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsconnectionedit.html">Modifier une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsconnectiondelete.html">Supprimer une ressource d'usine de connexion JMS</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jms-resource-1"><tt>create-jms-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jms-resources-1"><tt>list-jms-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jms-resource-1"><tt>delete-jms-resource</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
