<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsservice-additional-props"></a><h4>Propri&#233;t&#233;s sp&#233;cifiques au service JMS</h4>
<a name="indexterm-44"></a><a name="indexterm-45"></a><p>Les propri&#233;t&#233;s suivantes de configuration du courtier Message Queue de Oracle sont
disponibles pour le service JMS. </p>

<dl><dt><tt>instance-name</tt></dt>
<dd><p>Indique le nom complet de l&#8217;instance du courtier Message Queue. La valeur par d&#233;faut est <tt> imqbroker</tt>.</p>

</dd>
<dt><tt>instance-name-suffix</tt></dt>
<dd><p>Sp&#233;cifie un suffixe &#224; ajouter au nom complet de l&#8217;instance du courtier Message Queue. Le suffixe est s&#233;par&#233; du nom de l&#8217;instance par un tiret (<tt>_</tt>). Par exemple, si le nom de l&#8217;instance est <tt>imqbroker</tt>, l&#8217;ajout du suffixe <tt>xyz</tt> donne le nom <tt> imqbroker_xyz</tt>.</p>

</dd>
<dt><tt>append-version</tt></dt>
<dd><p>Si la valeur est <tt>true</tt>, ajoute au nom d&#8217;instance du courtier Message Queue les num&#233;ros de version minimum et maximum, pr&#233;c&#233;d&#233;s par des tirets (<tt>_</tt>). Par exemple, si le nom de l&#8217;instance est <tt>imqbroker</tt>, l&#8217;ajout des num&#233;ros de version donne le nom <tt>imqbroker_8_0 </tt>. La valeur par d&#233;faut est <tt>faux</tt>.</p>

</dd>
<dt><tt>user-name</tt></dt>
<dd><p>Le nom d&#8217;utilisateur pour cr&#233;er la connexion JMS. Requis uniquement si le nom d&#8217;utilisateur ou le mot de passe par d&#233;faut de <tt>guest</tt>/<tt>guest</tt> n&#8217;est pas disponible dans le courtier. La valeur par d&#233;faut est <tt>guest</tt>.</p>

</dd>
<dt><tt>password</tt></dt>
<dd><p>Le mot de passe pour cr&#233;er la connexion JMS. Requis uniquement si le nom d&#8217;utilisateur ou le mot de passe par d&#233;faut de <tt>guest</tt>/<tt>guest</tt> n&#8217;est pas disponible dans le courtier. La valeur par d&#233;faut est <tt>guest</tt>.</p>

</dd>
</dl>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
