<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsdestinationedit"></a><h4>Modification d&#8217;une ressource destination JMS</h4>
<a name="indexterm-39"></a><a name="indexterm-40"></a><p>Utilisez la page Modification d&#8217;une ressource destination JMS pour modifier les param&#232;tres
pour une ressource de destination JMS. </p>

<p>La page Modification d&#8217;une ressource destination JMS contient les options suivantes. </p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom JNDI</dt>
<dd><p>Un nom unique qui identifie la ressource de destination. Le champ Nom JNDI est en lecture seule. Vous pouvez sp&#233;cifier le nom JNDI uniquement lorsque vous cr&#233;ez une nouvelle ressource de destination JMS.</p>

</dd>
<dt>Nom de la destination physique</dt>
<dd><p>Le nom de la destination physique associ&#233;e &#224; cette ressource.</p>

<p>GlassFish Server cr&#233;e la destination physique automatiquement lorsque c&#8217;est n&#233;cessaire et la supprime lorsque vous supprimez la ressource de destination. </p>

</dd>
<dt>Type de ressource</dt>
<dd><p>Le type de la ressource de destination. Les choix disponibles sont <tt>javax.jms.Topic</tt> et <tt>javax.jms.Queue</tt>. </p>

</dd>
<dt>Description</dt>
<dd><p>Une description de la ressource de destination.</p>

</dd>
<dt>Statut</dt>
<dd><p>Le statut de la ressource de destination. La ressource de destination peut &#234;tre activ&#233;e ou d&#233;sactiv&#233;e. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s pour la ressource de destination. GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les ressources de destination JMS.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jmsdestinationnew.html">Cr&#233;er une ressource de destination JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationedit.html">Modifier une ressource de destination JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationdelete.html">Supprimer une ressource de destination JMS</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jms-resource-1"><tt>create-jms-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jms-resources-1"><tt>list-jms-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jms-resource-1"><tt>delete-jms-resource</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
