<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsphysicaldestnew"></a><h4>Nouvelle destination physique JMS</h4>
<a name="indexterm-51"></a><a name="indexterm-52"></a><p>Utilisez la page Nouvelle destination physique JMS pour cr&#233;er une nouvelle destination
physique JMS. </p>

<p>Vous n&#8217;avez g&#233;n&#233;ralement pas besoin de cr&#233;er de destinations physiques, car vous sp&#233;cifiez
un nom de destination physique lorsque vous cr&#233;ez une ressource de destination
JMS , et GlassFish Server cr&#233;e automatiquement la destination physique si n&#233;cessaire.</p>

<p>La page Nouvelle destination physique JMS contient les options suivantes. </p>

<dl><dt>Nom</dt>
<dd><p>Le nom de la destination physique.</p>

</dd>
<dt>Type</dt>
<dd><p>Le type de la destination physique. Les choix disponibles sont <tt>javax.jms.Topic</tt> et <tt>javax.jms.Queue</tt>. </p>

</dd>
<dt>Nombre maximum de messages non consomm&#233;s</dt>
<dd><p>Le nombre maximal de messages non consomm&#233;s autoris&#233; pour la destination. Une valeur de -1 signifie que le nombre de messages non consomm&#233;s est illimit&#233;. La valeur par d&#233;faut est &#8211;1.</p>

</dd>
<dt>Taille maximum d&#8217;un message</dt>
<dd><p>La taille maximum, en octets, d&#8217;un message. Une valeur de &#8211;1 fait r&#233;f&#233;rence &#224; une taille de message illimit&#233;e. La valeur par d&#233;faut est &#8211;1.</p>

</dd>
<dt>M&#233;moire totale maximum</dt>
<dd><p>La m&#233;moire totale maximale, en octets, pour les messages non consomm&#233;s. Une valeur de -1 signifie que la taille de la m&#233;moire pour les messages non consomm&#233;s est illimit&#233;e. La valeur par d&#233;faut est &#8211;1.</p>

</dd>
<dt>Comportement aux limites de seuil</dt>
<dd><p>Le comportement que le courtier doit suivre lorsque la limite de m&#233;moire seuil est atteinte. Les choix disponibles sont les suivants :</p>

<dl><dt><tt>Reject newest messages</tt></dt>
<dd><p>Refusez les messages les plus r&#233;cents et informez le client producteur &#224; l&#8217;aide d&#8217;une exception uniquement si le message est persistant. Ceci est la valeur par d&#233;faut.</p>

</dd>
<dt><tt>Slow down producers</tt></dt>
<dd><p>Ralentissez la vitesse &#224; laquelle les producteurs de messages envoient des messages. </p>

</dd>
<dt><tt>Throw out oldest</tt></dt>
<dd><p>Effacez les messages les plus anciens. </p>

</dd>
<dt><tt>Throw out lowest-priority messages</tt></dt>
<dd><p>Effacez les messages dont le niveau de priorit&#233; est le plus bas. </p>

</dd>
</dl>
<p>Si la valeur est <tt>Throw out oldest</tt> ou <tt>Throw out lowest-priority messages</tt> et que le param&#232;tre Utiliser la file d&#8217;attente des messages bloqu&#233;s est d&#233;fini sur la valeur True, les messages en trop sont transf&#233;r&#233;s vers la file d&#8217;attente des messages bloqu&#233;s. </p>

</dd>
<dt>Nombre maximum de producteurs</dt>
<dd><p>Le nombre maximal de producteurs de messages qui peuvent &#234;tre associ&#233;s &#224; cette destination physique. Lorsque cette limite est atteinte, aucun nouveau producteur ne peut &#234;tre cr&#233;&#233;. Une valeur de -1 indique un nombre illimit&#233; de producteurs. La valeur par d&#233;faut est 100.</p>

</dd>
<dt>Nombre maximum de messages lors de la distribution par lots</dt>
<dd><p>Le nombre maximal de messages qui peuvent &#234;tre transmis aux utilisateurs dans un seul lot. Une valeur de -1 indique un nombre illimit&#233; de messages. La valeur par d&#233;faut est 1000.</p>

</dd>
<dt>Utiliser la file d&#8217;attente des messages bloqu&#233;s</dt>
<dd><p>Si la valeur est d&#233;finie sur True, les messages bloqu&#233;s sont plac&#233;s dans la file d&#8217;attente des messages bloqu&#233;s. Si cette valeur est d&#233;finie sur False, les messages bloqu&#233;s sont ignor&#233;s. Cette option est d&#233;finie sur True par d&#233;faut.</p>

</dd>
<dt>Valider le sch&#233;ma XML</dt>
<dd><p>Si la valeur est d&#233;finie sur True, l&#8217;ex&#233;cution du client Message Queue tentera de valider un message XML par rapport aux d&#233;finitions de sch&#233;ma XML (ou par rapport au DTD, si aucun XSD n&#8217;est sp&#233;cifi&#233;) avant de l&#8217;envoyer au courtier. Si le sch&#233;ma sp&#233;cifi&#233; est introuvable ou le message ne peut pas &#234;tre valid&#233;, le message n&#8217;est pas envoy&#233; et une exception est g&#233;n&#233;r&#233;e. Cette option est d&#233;finie sur False par d&#233;faut.</p>

</dd>
<dt>Liste URI du sch&#233;ma XML</dt>
<dd><p>Une liste s&#233;par&#233;e par des espaces de cha&#238;nes d&#8217;URI de d&#233;finition de sch&#233;ma XML (XSD). Si la validation de sch&#233;ma XML est activ&#233;e, les URI pointent vers l&#8217;emplacement d&#8217;un ou plusieurs XSDs &#224; utiliser pour la validation de sch&#233;ma XML. </p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jmsservice.html">Configuration du service JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestnew.html">Cr&#233;ation d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestedit.html">Modification d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestdelete.html">Suppression d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsflushmessages.html">Suppression des messages &#224; partir d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldeststats.html">Affichage des statistiques d'une destination physique JMS</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jmsdest-1"><tt>create-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jmsdest-1"><tt>list-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jmsdest-1"><tt>delete-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=flush-jmsdest-1"><tt>flush-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=jms-ping-1"><tt>jms-ping</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
