<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmsconnectionedit"></a><h4>Modifier une ressource d&#8217;usine de connexion JMS</h4><a name="indexterm-3"></a><a name="indexterm-4"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le noeud Connecteurs, d&#233;veloppez le noeud Ressources JMS.</b></li>
<li><b>Sous le noeud Ressources JMS, s&#233;lectionnez le noeud Usines de connexion JMS.
</b><p>La page Usines de connexion JMS s&#8217;ouvre. </p></li>
<li><b>Sur la page Usines de connexion JMS, cliquez sur le nom de
l&#8217;usine de connexion que vous modifiez.</b><p>La page Modifier l&#8217;usine de connexion JMS s&#8217;ouvre.</p></li>
<li><b>Dans le champ Description, saisissez une description de l&#8217;usine de connexion.</b></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Statut pour activer la ressource au moment
de l&#8217;ex&#233;cution.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Taille initiale et minimale du pool, sp&#233;cifiez le nombre
minimum de connexions dans le pool.</b><p>La valeur par d&#233;faut est 8.</p></li>
<li><b>Dans le champ Taille maximale du pool, sp&#233;cifiez le nombre maximum de
connexions dans le pool.</b><p>La valeur par d&#233;faut est 32.</p></li>
<li><b>Dans le champ Valeur de redimensionnement du pool, sp&#233;cifiez le nombre de
connexions &#224; supprimer lorsque le d&#233;lai d&#8217;inactivit&#233; du pool expire. </b><p>La valeur par d&#233;faut est 2.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;inactivit&#233;, sp&#233;cifiez le temps maximum (en secondes) pendant
lequel une connexion peut rester inactive dans le pool.</b><p>La valeur par d&#233;faut est 300.</p></li>
<li><b>Dans le champ Attente max., sp&#233;cifiez le temps pendant lequel l&#8217;application demandant
une connexion patientera avant d&#8217;obtenir une expiration de la connexion.</b><p>La valeur par d&#233;faut est 60 000.</p></li>
<li><b>Si la case &#201;chec sur tout Fermer toutes les connexions est coch&#233;e,
GlassFish Server interrompt toutes les connexions du pool et les r&#233;tablit si
une seule connexion &#233;choue. </b><p>Si vous ne s&#233;lectionnez pas cette case, les connexions individuelles ne seront
r&#233;tablies que lorsqu&#8217;elles seront utilis&#233;es.</p></li>
<li><b>Pour une ressource d&#8217;usine de connexion JMS, sp&#233;cifiez la valeur de Prise
en charge des transactions comme suit :</b><ul>
<li><b>Choisissez <tt>XATransaction</tt> (valeur par d&#233;faut) si la ressource peut &#234;tre utilis&#233;e pour
des transactions impliquant l&#8217;utilisation de plusieurs ressources dans le cadre d&#8217;une transaction.</b><p>Par exemple, cette ressource plus une ressource JDBC, une ressource de connecteur
ou une autre ressource de fabrique de connexion JMS. Cette valeur offre
un maximum de flexibilit&#233;. Les ressources configur&#233;es <tt>XATransaction</tt> participent &#224; des op&#233;rations
de validation &#224; deux phases.</p></li>
<li><b>Choisissez <tt>LocalTransaction</tt> si la ressource peut &#234;tre utilis&#233;e soit pour des transactions
impliquant une seule ressource dans le cadre de la transaction, soit comme
dernier agent dans une transaction distribu&#233;e impliquant plusieurs ressources XA.</b><p>Cette valeur permet de bien meilleures performances. Les ressources configur&#233;es <tt>LocalTransaction</tt> ne
sont pas utilis&#233;es dans les op&#233;rations de validation &#224; deux phases.</p></li>
<li><b>Choisissez <tt>NoTransaction</tt> si la ressource ne peut participer &#224; aucune transaction.</b><p>Dans les applications JMS, l&#8217;utilisation de cette configuration est limit&#233;e.</p></li></ul></li>
<li><b>S&#233;lectionnez la case Validation de la connexion pour activer la validation de
la connexion.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li>(Facultatif) <b>Dans le tableau Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s pour l&#8217;usine de
connexion.</b><p>Pour plus d&#8217;informations sur les propri&#233;t&#233;s disponibles, reportez-vous &#224; la rubrique <a href="ref-jmsconnectionproperties.html">Propri&#233;t&#233;s sp&#233;cifiques aux usines de connexion JMS</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jmsconnectionnew.html">Pour cr&#233;er une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsconnectiondelete.html">Supprimer une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationnew.html">Cr&#233;er une ressource de destination JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationedit.html">Modifier une ressource de destination JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationdelete.html">Supprimer une ressource de destination JMS</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
