<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmsdestinationedit"></a><h3>Modifier une ressource de destination JMS</h3><a name="indexterm-9"></a><a name="indexterm-10"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le noeud Connecteurs, d&#233;veloppez le noeud Ressources JMS.</b></li>
<li><b>Sous le noeud Ressources JMS, s&#233;lectionnez le noeud Ressources de destination JMS.
</b><p>La page Ressources de destination JMS s&#8217;ouvre.</p></li>
<li><b>Sur la page Ressources de destination JMS, cliquez sur le nom de
la ressource de destination que vous modifiez.</b><p>La page Modifier la ressource de destination JMS s&#8217;ouvre. </p></li>
<li><b>Dans le champ Nom de la destination physique, saisissez le nom de
la destination physique &#224; associer &#224; cette ressource.</b><p>GlassFish Server cr&#233;e la destination physique automatiquement lorsque c&#8217;est n&#233;cessaire et la
supprime lorsque vous supprimez la ressource de destination. </p></li>
<li><b>Dans la liste d&#233;roulante Type de ressource, s&#233;lectionnez <tt>javax.jms.Topic</tt> ou <tt>javax.jms.Queue</tt>.</b></li>
<li><b>Dans le champ Description, saisissez une description de la ressource de destination.</b></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Statut pour activer la ressource au moment
de l&#8217;ex&#233;cution.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li>(Facultatif) <b>Dans la zone Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s pour la ressource
de destination. </b><p>GlassFish Server ne d&#233;finit pas d&#8217;autres propri&#233;t&#233;s pour les ressources de destination
JMS.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-jmsconnectionnew.html">Pour cr&#233;er une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsconnectionedit.html">Modifier une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsconnectiondelete.html">Supprimer une ressource d'usine de connexion JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationnew.html">Cr&#233;er une ressource de destination JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationdelete.html">Supprimer une ressource de destination JMS</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
