<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmshostnew"></a><h4>Cr&#233;ation d&#8217;un h&#244;te JMS</h4><a name="indexterm-14"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud Java Message Service.</b></li>
<li><b>Sous le noeud Java Message Service, s&#233;lectionnez le noeud H&#244;tes JMS.</b><p>La page H&#244;tes JMS s&#8217;ouvre.</p></li>
<li><b>Sur la page H&#244;tes JMS, cliquez sur Nouveau.</b><p>La page Nouvel h&#244;te JMS appara&#238;t.</p></li>
<li><b>Dans le champ Nom, saisissez le nom de l&#8217;h&#244;te.</b><p>Exemple&#160;:</p><pre>NewJmsHost</pre></li>
<li><b>Dans le champ H&#244;te, saisissez le nom ou l&#8217;adresse IP du syst&#232;me
sous lequel l&#8217;h&#244;te JMS fonctionnera (<tt>localhost</tt> ou le nom du syst&#232;me local
ou distant).</b></li>
<li><b>Dans le champ Port, indiquez le num&#233;ro de port du service JMS.</b><p>Ne modifiez ce champ que si le service JMS &#224; utiliser n&#8217;utilise
pas le port par d&#233;faut. Le port par d&#233;faut est 7676.</p></li>
<li><b>Dans les champs Nom d&#8217;utilisateur Admin et Mot de passe Admin, saisissez
le nom d&#8217;utilisateur et le mot de passe du courtier Message Queue.</b><p>Ceux-ci diff&#232;rent du nom d&#8217;utilisateur et du mot de passe du GlassFish
Server. Modifiez ces champs uniquement si les valeurs du courtier Message Queue
ont &#233;t&#233; modifi&#233;es &#224; l&#8217;aide de la commande <tt><i>as-install-parent</i>/mq/bin/imqusermgr</tt>. Les valeurs par
d&#233;faut sont <tt>admin</tt> et <tt> admin</tt>.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jmsservice.html">Configuration du service JMS</a></p>

</li>
<li><p><a href="task-jmshostedit.html">Modification d'un h&#244;te JMS</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">Suppression d'un h&#244;te JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestnew.html">Cr&#233;ation d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestedit.html">Modification d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestdelete.html">Suppression d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsflushmessages.html">Suppression des messages &#224; partir d'une destination physique JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldeststats.html">Affichage des statistiques d'une destination physique JMS</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
