<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstanceconfigproperties"></a><h4>Propriedades do sistema da inst&#226;ncia</h4>
<a name="indexterm-213"></a><a name="indexterm-214"></a><a name="indexterm-215"></a><p>A p&#225;gina Propriedades do sistema exibe uma lista das propriedades do sistema
Java que est&#227;o definidas para a inst&#226;ncia atual do Servidor GlassFish. As
propriedades do sistema Java s&#227;o transmitidas para o iniciador de aplicativo Java
atrav&#233;s da op&#231;&#227;o <tt>-D</tt> do iniciador de aplicativo Java quando o Servidor
GlassFish &#233; iniciado.</p>

<p>Essas propriedades substituem as defini&#231;&#245;es de propriedade para configura&#231;&#245;es de porta na
configura&#231;&#227;o da inst&#226;ncia. As configura&#231;&#245;es de porta predefinidas devem ser substitu&#237;das se,
por exemplo, duas inst&#226;ncias em cluster residirem no mesmo host. Nessa situa&#231;&#227;o,
as configura&#231;&#245;es de porta para uma inst&#226;ncia devem ser substitu&#237;das porque ambas
as inst&#226;ncias compartilham a mesma configura&#231;&#227;o.</p>

<p>Para obter informa&#231;&#245;es sobre as configura&#231;&#245;es de porta predefinidas, consulte <a href="../../../common/pt_BR/help/ref-predefinedconfigsysproperties.html">Predefined Configuration System Properties</a>.</p>

<p>O campo Nome da inst&#226;ncia &#233; um campo de somente leitura que
exibe o nome da inst&#226;ncia atual.</p>

<p>S&#227;o exibidas as seguintes informa&#231;&#245;es para cada propriedade:</p>

<dl><dt>Nome da vari&#225;vel da inst&#226;ncia</dt>
<dd><p>Nome da propriedade do sistema.</p>

</dd>
<dt>Valor atual</dt>
<dd><p>Valor atualmente definido para a propriedade. Este campo &#233; somente leitura.</p>

</dd>
<dt>Novo valor</dt>
<dd><p>Valor com o qual a propriedade ser&#225; definida depois que as altera&#231;&#245;es forem salvas.</p>

</dd>
</dl>
<p>A tabela Propriedades adicionais tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Adicionar propriedade</dt>
<dd><p>Bot&#227;o para adicionar uma propriedade. Se clicar neste bot&#227;o, uma linha &#233; adicionada &#224; tabela Propriedades adicionais.</p>

</dd>
<dt>Excluir propriedades</dt>
<dd><p>Bot&#227;o para excluir uma ou mais propriedades selecionadas. Qualquer propriedade exclu&#237;da volta ao seu valor padr&#227;o ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-change-standalone-instance-ports.html">Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-config-sys-properties-defaults.html">Para definir os valores padr&#227;o para configura&#231;&#227;o das propriedades do sistema</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-system-properties-1"><tt>create-system-properties</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-system-property-1"><tt>delete-system-property</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-system-properties-1"><tt>list-system-properties</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
