<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterinstancenew"></a><h4>Nova inst&#226;ncia do servidor em clusters</h4>
<a name="indexterm-175"></a><a name="indexterm-176"></a><a name="indexterm-177"></a><p>Utilize a p&#225;gina Nova inst&#226;ncia do servidor em cluster para adicionar uma
inst&#226;ncia do Servidor GlassFish a um cluster existente.</p>

<p>A p&#225;gina Nova inst&#226;ncia do servidor em cluster cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Nome do cluster</dt>
<dd><p>Nome atribu&#237;do ao cluster quando o cluster &#233; criado. Este campo &#233; somente leitura.</p>

</dd>
<dt>Nome da inst&#226;ncia</dt>
<dd><p>O nome da inst&#226;ncia que est&#225; sendo criada. </p>

<p>O nome deve cumprir os seguintes requisitos:</p>


<ul><li><p>O nome deve come&#231;ar com uma letra, um n&#250;mero ou um sublinhado.</p>

</li>
<li><p>O nome pode conter somente os seguintes caracteres:</p>


<ul><li><p>Letras min&#250;sculas</p>

</li>
<li><p>Letras mai&#250;sculas</p>

</li>
<li><p>N&#250;meros</p>

</li>
<li><p>H&#237;fen</p>

</li>
<li><p>Per&#237;odo</p>

</li>
<li><p>Sublinhado</p>

</li></ul>
</li>
<li><p>O nome deve ser &#250;nico no dom&#237;nio e n&#227;o deve ser o nome de outra inst&#226;ncia, um cluster, uma configura&#231;&#227;o nomeada ou um n&#243; do Servidor GlassFish.</p>

</li>
<li><p>O nome n&#227;o deve ser <tt>domain</tt>, <tt>server</tt>, nem nenhuma outra palavra-chave que esteja reservada pelo Servidor GlassFish.</p>

</li></ul>
</dd>
<dt>N&#243;</dt>
<dd><p>Lista suspensa dos n&#243;s existentes que definem os hosts nos quais a inst&#226;ncia pode estar. &#201; necess&#225;rio selecionar um n&#243; na lista. Caso a inst&#226;ncia deva ser criada no host onde o servidor de administra&#231;&#227;o do dom&#237;nio (DAS) estiver sendo executado, selecione o n&#243; predefinido <tt>localhost-<i>dom&#237;nio</i></tt>.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-create-clustered-instance.html">Para adicionar uma inst&#226;ncia do Servidor GlassFish a um cluster</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-instance-1"><tt>create-instance</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
