<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterapplications"></a><h4>Aplicativos</h4>
<a name="indexterm-171"></a><a name="indexterm-172"></a><p>Utilize a p&#225;gina Aplicativos para realizar as seguintes tarefas no cluster atual:</p>


<ul><li><p>Exibindo e gerenciando aplicativos que j&#225; est&#227;o implantados no cluster</p>

</li>
<li><p>Implantando mais aplicativos no cluster</p>

</li></ul>
<p>O campo Nome do cluster &#233; um campo de somente leitura que
exibe o nome do cluster atual.</p>

<p>A p&#225;gina Aplicativos exibe uma lista dos aplicativos que est&#227;o implantados no
cluster atual. Para cada aplicativo, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do aplicativo.</p>

<p>O nome pode incluir um identificador de vers&#227;o opcional, que segue o nome e &#233; separado do nome por dois pontos (<tt>:</tt>). Para obter mais informa&#231;&#245;es sobre vers&#245;es de aplicativos e m&#243;dulos, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions no <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Ativo</dt>
<dd><p>Indica&#231;&#227;o de que o aplicativo est&#225; ativo:</p>


<ul><li><p>Se o aplicativo estiver ativado, uma marca de sele&#231;&#227;o (&#10003;) &#233; exibida.</p>

</li>
<li><p>Se o aplicativo estiver desativado, um xis (&#10003;) &#233; exibido.</p>

</li></ul>
</dd>
<dt>Balanceador de carga ativado</dt>
<dd><p>Indica&#231;&#227;o de que o aplicativo est&#225; ativado para balanceamento de carga:</p>


<ul><li><p>Se o aplicativo estiver ativado para balanceamento de carga, uma marca de sele&#231;&#227;o (&#10003;) &#233; exibida.</p>

</li>
<li><p>Se o aplicativo estiver desativado para balanceamento de carga, um xis (&#10003;) &#233; exibido.</p>

</li></ul>
</dd>
<dt>Mecanismos</dt>
<dd><p>Os tipos de cont&#234;ineres que o aplicativo utiliza. Os tipos de cont&#234;ineres podem ser:</p>


<ul><li><p><tt>web</tt></p>

</li>
<li><p><tt>webservices</tt></p>

</li>
<li><p><tt>ejb</tt></p>

</li>
<li><p><tt>connector</tt></p>

</li>
<li><p><tt>appclient</tt></p>

</li>
<li><p><tt>weld</tt> &#8212; o cont&#234;iner para Contextos e Inje&#231;&#227;o de depend&#234;ncia para aplicativos da plataforma Java EE</p>

</li></ul>
</dd>
</dl>
<p>A tabela Aplicativos implementados tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Implementar</dt>
<dd><p>Bot&#227;o para implementar um aplicativo.</p>

</dd>
<dt>Cancelar implementa&#231;&#227;o</dt>
<dd><p>Bot&#227;o para cancelar a implementa&#231;&#227;o de um ou mais aplicativos selecionados.</p>

<p>A desimplanta&#231;&#227;o de um aplicativo remove o aplicativo de todos os destinos e do dom&#237;nio. Quando um aplicativo &#233; desimplantado, a aplicativo n&#227;o estar&#225; mais na lista na p&#225;gina <a href="../../../common/pt_BR/help/ref-applications.html">Aplicativos</a> que exibe todos os aplicativos implantados no Servidor GlassFish.</p>

<p>Para remover aplicativos somente do destino atual, utilize o bot&#227;o Remover desta p&#225;gina.</p>

</dd>
<dt>Remover</dt>
<dd><p>Bot&#227;o para remover um ou mais aplicativos selecionados. </p>

<p>A remo&#231;&#227;o de um aplicativo remove o aplicativo somente do destino atual. Quando um aplicativo &#233; removido de um destino, a aplica&#231;&#227;o continua estando na lista na p&#225;gina <a href="../../../common/pt_BR/help/ref-applications.html">Aplicativos</a> que exibe todos os aplicativos implantados no Servidor GlassFish. O aplicativo tamb&#233;m permanece implantado nos outros destinos nos quais estava implantado.</p>

<p>Para remover aplicativos de todos os destino e do dom&#237;nio, utilize o bot&#227;o Desimplantar desta p&#225;gina.</p>

</dd>
<dt>Mais a&#231;&#245;es</dt>
<dd><p>Lista suspensa que realiza a&#231;&#245;es adicionais em um ou mais aplicativos selecionados.</p>

<dl><dt>Ativar</dt>
<dd><p>Ativa um ou mais aplicativos selecionados.</p>

</dd>
<dt>Desativar</dt>
<dd><p>Desativa um ou mais aplicativos selecionados.</p>

</dd>
<dt>Ativar balanceador de carga</dt>
<dd><p>Ativa um ou mais aplicativos selecionados para balanceamento de carga (LB).</p>

</dd>
<dt>Desativar balanceador de carga</dt>
<dd><p>Desativa um ou mais aplicativos selecionados para balanceamento de carga (LB).</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-cluster-app-deploy.html">Para implantar um aplicativo em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">Para listar aplicativos que est&#227;o implantados em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">Para desimplantar aplicativos de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">Para remover aplicativos de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">Para editar um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">Para ativar ou desativar um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">Para ativar ou desativar o balanceamento de carga de um aplicativo que est&#225; implantado em um cluster</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=deploy-1"><tt>deploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-1"><tt>disable</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-http-lb-application-1"><tt>disable-http-lb-application</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-1"><tt>enable</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-http-lb-application-1"><tt>enable-http-lb-application</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-applications-1"><tt>list-applications</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
