<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>Novo Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Novo cluster para criar um cluster.</p>
<p>A p&aacute;gina Novo cluster cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome do cluster</dt>
<dd>
<p>O nome do cluster.</p>
<p>O nome deve cumprir os seguintes requisitos:</p>
<ul>
<li>
<p>O nome pode conter somente caracteres ASCII.</p>
</li>
<li>
<p>O nome deve come&ccedil;ar com uma letra, um n&uacute;mero ou um sublinhado.</p>
</li>
<li>
<p>O nome pode conter somente os seguintes caracteres:</p>
<ul>
<li>
<p>Letras min&uacute;sculas</p>
</li>
<li>
<p>Letras mai&uacute;sculas</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>H&iacute;fen</p>
</li>
<li>
<p>Per&iacute;odo</p>
</li>
<li>
<p>Sublinhado</p>
</li>
</ul>
</li>
<li>
<p>O nome deve ser &uacute;nico no dom&iacute;nio e n&atilde;o deve ser o nome de outro cluster, uma configura&ccedil;&atilde;o nomeada, uma inst&acirc;ncia do GlassFish Server ou um n&oacute;.</p>
</li>
<li>
<p>O nome n&atilde;o deve ser <code>domain</code>, <code>server</code>, nem nenhuma outra palavra-chave que esteja reservada pelo GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>Lista drop-down das configura&ccedil;&otilde;es nomeadas existentes que o cluster pode utilizar. Um cluster precisa de uma configura&ccedil;&atilde;o nomeada que defina a configura&ccedil;&atilde;o de todas as inst&acirc;ncias adicionadas ao cluster. &Eacute; necess&aacute;rio selecionar uma configura&ccedil;&atilde;o na lista. O cluster utilizar&aacute; a configura&ccedil;&atilde;o selecionada quando o cluster for criado.</p>
</dd>
<dt>Criar c&oacute;pia da configura&ccedil;&atilde;o selecionada</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, a configura&ccedil;&atilde;o selecionada ser&aacute; copiada quando o cluster for criado. Foi designado &agrave; c&oacute;pia da configura&ccedil;&atilde;o o nome <i>cluster-name</i><code>-config</code>, em que <i>cluster-name</i> &eacute; o nome do cluster digitado no campo Nome do Cluster.</p>
<p>Se <code>default-config</code> estiver selecionado na lista drop-down Configura&ccedil;&atilde;o, &eacute; necess&aacute;rio selecionar esta op&ccedil;&atilde;o. A configura&ccedil;&atilde;o <code>default-config</code> pode ser apenas copiada, n&atilde;o referenciada.</p>
</dd>
<dt>Referenciar a configura&ccedil;&atilde;o selecionada</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, o cluster utilizar&aacute; a configura&ccedil;&atilde;o nomeada existente especificada.</p>
<p>Se <code>default-config</code> estiver selecionado na lista drop-down Configura&ccedil;&atilde;o, esta op&ccedil;&atilde;o <i>n&atilde;o</i> deve ser selecionada. A configura&ccedil;&atilde;o <code>default-config</code> n&atilde;o pode ser referenciada, somente copiada.</p>
</dd>
<dt>Inst&acirc;ncias do servidor a serem criadas</dt>
<dd>
<p>Lista das inst&acirc;ncias do GlassFish Server que ser&atilde;o criadas quando o cluster for criado. Para cada inst&acirc;ncia, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas:</p>
<dl>
<dt>Nome da inst&acirc;ncia</dt>
<dd>
<p>O nome da inst&acirc;ncia.</p>
</dd>
<dt>Peso</dt>
<dd>
<p>Inteiro que representa o valor de balanceamento de carga da inst&acirc;ncia.</p>
<p>O peso do balanceamento de carga determina a propor&ccedil;&atilde;o de todas as solicita&ccedil;&otilde;es do cluster que a inst&acirc;ncia deve processar.</p>
<p>Por exemplo, em um cluster com duas inst&acirc;ncias, &eacute; poss&iacute;vel processar uma das quatro solicita&ccedil;&otilde;es em uma inst&acirc;ncia e processar tr&ecirc;s das quatro solicita&ccedil;&otilde;es na outra inst&acirc;ncia. Nesse caso, defina como 1 o peso da inst&acirc;ncia que processa uma das quatro solicita&ccedil;&otilde;es e como 3 o peso da outra inst&acirc;ncia. Se preferir utilizar porcentagem, defina os pesos das inst&acirc;ncias como 25 e 75, respectivamente.</p>
<p>O peso default &eacute; 100.</p>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>Lista drop-down dos n&oacute;s existentes nos quais a inst&acirc;ncia pode estar. &Eacute; necess&aacute;rio selecionar um n&oacute; na lista. O inst&acirc;ncia residir&aacute; no n&oacute; selecionado quando o cluster for criado.</p>
</dd>
</dl>
<p>A tabela Inst&acirc;ncias do servidor a serem criadas tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar uma inst&acirc;ncia. Se clicar neste bot&atilde;o, uma linha &eacute; adicionada &agrave; tabela Inst&acirc;ncias do servidor a serem criadas.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar uma inst&acirc;ncia.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>Tarefas relacionadas</h5>
<p><a href="task-create-cluster.html">Para Criar um Cluster</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>Subcomando asadmin Equivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
