<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clustergeneral"></a><h4>Informa&#231;&#245;es gerais</h4>
<a name="indexterm-164"></a><a name="indexterm-165"></a><a name="indexterm-166"></a><a name="indexterm-167"></a><p>A p&#225;gina Informa&#231;&#245;es gerais cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Iniciar cluster</dt>
<dd><p>Bot&#227;o para iniciar o cluster. Se todas as inst&#226;ncias do cluster estiverem em execu&#231;&#227;o, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Interromper cluster</dt>
<dd><p>Bot&#227;o para interromper o cluster. Se todas as inst&#226;ncias do cluster estiverem interrompidas, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Migrar temporizadores EJB</dt>
<dd><p>Bot&#227;o para migrar os temporizadores da tecnologia Enterprise JavaBeans (EJB) de uma inst&#226;ncia interrompida do Servidor GlassFish para uma inst&#226;ncia em execu&#231;&#227;o no cluster. Ao clicar neste bot&#227;o, a p&#225;gina <a href="ref-migrateejbtimers.html">Migrar temporizadores EJB</a> se abre. Se todas as inst&#226;ncias do cluster estiverem em execu&#231;&#227;o, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Efetuar rota&#231;&#227;o de log</dt>
<dd><p>Bot&#227;o para efetuar rota&#231;&#227;o de arquivo log no cluster. Quando o arquivo de log sofre rota&#231;&#227;o, o arquivo &#233; renomeado com um nome com carimbo de data e hora no formato <tt>server.log_</tt><i> data-e-hora</i><tt></tt>, e um arquivo de log vazio &#233; criado para novas mensagens de log. As altera&#231;&#245;es s&#227;o aplicadas dinamicamente. N&#227;o &#233; necess&#225;rio reiniciar o servidor.</p>

</dd>
<dt>Nome do cluster</dt>
<dd><p>Nome atribu&#237;do ao cluster quando o cluster &#233; criado. Este campo &#233; somente leitura.</p>

</dd>
<dt>JVM</dt>
<dd><p>Se voc&#234; clicar em JVM Report, ser&#225; aberta uma janela separada que exibe relat&#243;rios sobre o Java Virtual Machine, incluindo um relat&#243;rio de resumo, um relat&#243;rio de gerenciamento de mem&#243;ria e de coleta de erros,um relat&#243;rio de carregamento de classe e um despejo de segmentos atual.</p>

</dd>
<dt>Configura&#231;&#227;o</dt>
<dd><p>Nome selecionado para o cluster quando o cluster foi criado. Ao clicar na configura&#231;&#227;o, a p&#225;gina <a href="../../../common/pt_BR/help/ref-configuration.html">Configura&#231;&#245;es</a> do cluster se abre. Este campo &#233; somente leitura.</p>

</dd>
<dt>GMS</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o servi&#231;o de gerenciamento de grupos (GMS) ser&#225; iniciado em cada inst&#226;ncia do Servidor GlassFish do cluster e do servidor de administra&#231;&#227;o do dom&#237;nio (DAS). O DAS participa de cada cluster no qual o GMS estiver ativado. O GMS oferece monitoramento de cluster, associa&#231;&#227;o de cluster e servi&#231;os de comunica&#231;&#227;o do grupo. Por padr&#227;o, a op&#231;&#227;o est&#225; ativa.</p>

</dd>
<dt>Porta multicast</dt>
<dd><p>N&#250;mero da porta de comunica&#231;&#227;o na qual o GMS escuta os eventos do grupo. Esta op&#231;&#227;o deve especificar um n&#250;mero de porta v&#225;lido no intervalo de 2048 a 32000. O padr&#227;o &#233; um valor gerado automaticamente dentro deste intervalo.</p>

</dd>
<dt>Endere&#231;o do multicast</dt>
<dd><p>Endere&#231;o no qual o GMS escuta os eventos do grupo. Esta op&#231;&#227;o deve especificar um endere&#231;o de multicast no intervalo de 224.0.0.0 a 239.255.255.255. O padr&#227;o &#233; 228.9.<i>XX</i>.<i>YY</i>, em que <i>XX</i> e <i>YY</i> s&#227;o valores independentes gerados automaticamente entre 0 e 255.</p>

</dd>
<dt>Endere&#231;o da interface de vincula&#231;&#227;o</dt>
<dd><p>Endere&#231;o do protocolo de Internet (IP) da interface de rede ao qual o GMS se vincula. Esta op&#231;&#227;o deve especificar o endere&#231;o IP de uma interface de rede local. O padr&#227;o corresponde a todos os endere&#231;os p&#250;blicos de interface de rede.</p>

<p>Em uma m&#225;quina com v&#225;rios endere&#231;os (multihome), esta op&#231;&#227;o configura a interface de rede usada para o GMS. A m&#225;quina com v&#225;rios endere&#231;os (multihome) possui duas ou mais interfaces de rede.</p>

<p>Para especificar um endere&#231;o que seja v&#225;lido para todas as inst&#226;ncias do Servidor GlassFish do cluster, utilize uma propriedade do sistema para definir o endere&#231;o de forma individual de cada inst&#226;ncia.</p>

<p>Por exemplo, utilize a p&#225;gina <a href="ref-clustersystemproperties.html">Propriedades do sistema do cluster</a> para criar a propriedade do sistema <tt>GMS-BIND-INTERFACE-ADDRESS-<i>nome-do-cluster</i></tt>. A seguir, defina a op&#231;&#227;o Endere&#231;o de vincula&#231;&#227;o nesta p&#225;gina como <tt>${GMS-BIND-INTERFACE-ADDRESS-<i>nome-do-cluster</i>}</tt> para especificar a propriedade do sistema. Finalmente, defina em cada inst&#226;ncia do cluster a propriedade do sistema <tt>GMS-BIND-INTERFACE-ADDRESS-<i>nome-do-cluster</i></tt> como o endere&#231;o da interface de rede na m&#225;quina da inst&#226;ncia.</p>

</dd>
<dt>Status</dt>
<dd><p>Indica&#231;&#227;o do n&#250;mero de inst&#226;ncias do cluster que est&#227;o e n&#227;o est&#227;o em execu&#231;&#227;o. Este campo &#233; somente leitura.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-gmscluster.html">Para configurar as defini&#231;&#245;es do servi&#231;o de gerenciamento de grupos de um cluster</a></p>

</li>
<li><p><a href="task-migrate-ejb-timers.html">Para migrar temporizadores EJB</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=migrate-timers-1"><tt>migrate-timers</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=rotate-log-1"><tt>rotate-log</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
