<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstanceresources"></a><h4>Recursos</h4>
<a name="indexterm-210"></a><a name="indexterm-211"></a><a name="indexterm-212"></a><p>Utilize a p&#225;gina Recursos para realizar as seguintes tarefas na inst&#226;ncia independente
selecionada do Servidor GlassFish:</p>


<ul><li><p>Exibindo e gerenciando os recursos existentes da inst&#226;ncia</p>

</li>
<li><p>Criando recursos adicionais para a inst&#226;ncia</p>

</li></ul>
<p>O campo Nome da inst&#226;ncia &#233; um campo de somente leitura que
exibe o nome da inst&#226;ncia atual.</p>

<p>A p&#225;gina Recursos exibe uma lista de recursos existentes da inst&#226;ncia. Para
cada recurso, as informa&#231;&#245;es abaixo s&#227;o fornecidas.</p>

<dl><dt>Nome do recurso</dt>
<dd><p>Nome atribu&#237;do ao recurso quando o recurso &#233; criado. Ao clicar no nome, abre-se uma das seguintes p&#225;ginas para editar o recurso, dependendo do tipo do recurso:</p>


<ul><li><p>Edit JDBC Resource</p>

</li>
<li><p>Editar sess&#227;o JavaMail</p>

</li>
<li><p>Editar recurso personalizado</p>

</li>
<li><p>Novo recurso personalizado</p>

</li>
<li><p>Editar recurso externo</p>

</li>
<li><p>Editar recurso do conector</p>

</li>
<li><p>Editar recurso do objeto de admin</p>

</li></ul>
</dd>
<dt>Ativo</dt>
<dd><p>Indica&#231;&#227;o de que o recurso est&#225; ativado:</p>


<ul><li><p>Se o recurso estiver ativado, uma marca de sele&#231;&#227;o (&#10003;) &#233; exibida.</p>

</li>
<li><p>Se o recurso estiver desativado, um xis (&#10003;) &#233; exibido.</p>

</li></ul>
</dd>
<dt>Tipo</dt>
<dd><p>O tipo do recurso de destino.</p>

</dd>
</dl>
<p>A tabela Recurso tamb&#233;m cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Ativar</dt>
<dd><p>Bot&#227;o utilizado para ativar um ou mais recursos selecionados.</p>

</dd>
<dt>Desativar</dt>
<dd><p>Bot&#227;o utilizado para desativar um ou mais recursos selecionados.</p>

</dd>
<dt>Novo</dt>
<dd><p>Lista suspensa que cria um recurso do tipo selecionado. Ao selecionar um tipo de recurso na lista, uma das p&#225;ginas seguintes se abre para a cria&#231;&#227;o de um recurso do tipo selecionado:</p>


<ul><li><p>New JDBC Resource</p>

</li>
<li><p>Nova f&#225;brica de conex&#245;es JMS</p>

</li>
<li><p>Novo recurso de destino JMS</p>

</li>
<li><p>Nova sess&#227;o JavaMail</p>

</li>
<li><p>Novo recurso personalizado</p>

</li>
<li><p>Novo recurso externo</p>

</li>
<li><p>Novo recurso do conector</p>

</li>
<li><p>Novo recurso do objeto de admin</p>

</li></ul>
</dd>
<dt>Filtro</dt>
<dd><p>Lista suspensa que filtra por tipo a lista de recursos exibidos.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-standalone-instance-resource-create.html">Para criar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">Para listar um recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Para ativar e desativar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Para editar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
