<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-recovertransactions"></a><h4>Recuperar transa&#231;&#245;es </h4>
<a name="indexterm-181"></a><p>Utilize a p&#225;gina Recuperar transa&#231;&#245;es para recuperar transa&#231;&#245;es de uma inst&#226;ncia do
Servidor GlassFish.</p>

<p>Se a inst&#226;ncia estiver em execu&#231;&#227;o, a p&#225;gina Recuperar transa&#231;&#245;es cont&#233;m somente
o texto <b>A recupera&#231;&#227;o &#233; realizada pelo pr&#243;prio servidor em execu&#231;&#227;o</b> e o bot&#227;o OK.</p>

<p>Se a inst&#226;ncia n&#227;o estiver em execu&#231;&#227;o, a p&#225;gina Recuperar transa&#231;&#245;es cont&#233;m
as seguintes op&#231;&#245;es.</p>

<dl><dt>Nome da inst&#226;ncia</dt>
<dd><p>Nome atribu&#237;do &#224; inst&#226;ncia quando a inst&#226;ncia foi criada. Este campo &#233; somente leitura.</p>

</dd>
<dt>Servidor de destino</dt>
<dd><p>Outra inst&#226;ncia que pode recuperar as transa&#231;&#245;es na inst&#226;ncia atual.</p>

</dd>
<dt>Diret&#243;rio do log de transa&#231;&#245;es</dt>
<dd><p>Diret&#243;rio no qual os logs de transa&#231;&#227;o s&#227;o armazenados. O padr&#227;o &#233; <tt>/logs/tx</tt> no diret&#243;rio do dom&#237;nio.</p>

<p>Os logs de transa&#231;&#227;o s&#227;o mantidos no subdiret&#243;rio <tt>tx</tt> do diret&#243;rio especificado pela configura&#231;&#227;o do Local do log de transa&#231;&#227;o do Servi&#231;o de transa&#231;&#227;o na configura&#231;&#227;o do cluster. O valor padr&#227;o do Local do log de transa&#231;&#227;o &#233; o diret&#243;rio especificado pelo campo Raiz de log da p&#225;gina Atributos do dom&#237;nio, que est&#225; localizado na guia Avan&#231;ado do n&#243; do Servidor GlassFish.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-recovertransactions.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><tt>recover-transactions</tt>(1)</p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
