<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustersystemproperties" name="ref-clustersystemproperties"></a><a id="GHCLU00013" name="GHCLU00013"></a></p>

<h4><a id="sthref296" name="sthref296"></a><a id="sthref297" name="sthref297"></a>Propriedades do Sistema do Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Propriedades do sistema do cluster exibe uma lista das propriedades do sistema Java que est&atilde;o definidas para o cluster selecionado. Propriedades do sistema Java s&atilde;o especificadas para o acionador da aplica&ccedil;&atilde;o Java por meio da op&ccedil;&atilde;o <code>-D</code> do acionador da aplica&ccedil;&atilde;o Java quando GlassFish Server for iniciado.</p>
<p>O campo Nome do cluster &eacute; um campo somente para leitura que exibe o nome do cluster selecionado.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome da vari&aacute;vel da inst&acirc;ncia</dt>
<dd>
<p>Nome da propriedade do sistema.</p>
</dd>
<dt>Valor atual</dt>
<dd>
<p>Valor atualmente definido para a propriedade. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Novo valor</dt>
<dd>
<p>Valor com o qual a propriedade ser&aacute; definida depois que as altera&ccedil;&otilde;es forem salvas.</p>
</dd>
</dl>
<p>A tabela Propriedades adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Se clicar neste bot&atilde;o, uma linha &eacute; adicionada &agrave; tabela Propriedades adicionais.</p>
</dd>
<dt>Deletar propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada volta ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
<a id="sthref298" name="sthref298"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-config-sys-properties-defaults.html">Para definir os valores Default para configura&ccedil;&atilde;o das propriedades do sistema</a></p>
<a id="sthref299" name="sthref299"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
