<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a><a id="GHCLU00026" name="GHCLU00026"></a></p>

<h4><a id="sthref354" name="sthref354"></a>Editar Servi&ccedil;o de Gerenciamento de Grupo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Servi&ccedil;o de gerenciamento de grupos para alterar as defini&ccedil;&otilde;es do GMS.</p>
<p>O servi&ccedil;o de gerenciamento de grupos (GMS) &eacute; um servi&ccedil;o em processo que oferece monitoramento de cluster, associa&ccedil;&atilde;o de cluster e servi&ccedil;os de comunica&ccedil;&atilde;o de grupos. O GMS est&aacute; constru&iacute;do sobre uma pilha configur&aacute;vel de protocolos de monitoramento da integridade e de descoberta da associa&ccedil;&atilde;o do grupo. O GMS realiza as seguintes fun&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Notifica os m&oacute;dulos registrados em uma inst&acirc;ncia do GlassFish Server quando uma ou mais inst&acirc;ncias do membro s&atilde;o adicionadas ou removidas de um cluster, ou quando tais inst&acirc;ncias sejam suspeitas de ter falhas ou realmente tenham falhas.</p>
</li>
<li>
<p>Oferece a capacidade de enviar e receber mensagens entre um grupo de processos.</p>
</li>
</ul>
<p>A p&aacute;gina Servi&ccedil;o de gerenciamento de grupos cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar com os valores default as defini&ccedil;&otilde;es que apresentam valores default. As defini&ccedil;&otilde;es que n&atilde;o apresentam valores default n&atilde;o s&atilde;o alteradas.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Maximum Missed Heartbeats (M&aacute;ximo de pulsa&ccedil;&otilde;es perdidas)</dt>
<dd>
<p>N&uacute;mero de tentativas de monitoramento ap&oacute;s o qual a inst&acirc;ncia do servidor &eacute; suspeita de ter falha. O default &eacute; 3.</p>
</dd>
<dt>Heartbeat Frequency (Frequ&ecirc;ncia das pulsa&ccedil;&otilde;es)</dt>
<dd>
<p>Per&iacute;odo de tempo entre as tentativas de monitoramento. O default &eacute; 2000 milissegundos.</p>
</dd>
<dt>Group Discovery Timeout (Time-out para descoberta de grupo)</dt>
<dd>
<p>Quantidade de tempo que o GMS espera a descoberta de outros membros do grupo. O default &eacute; 5000 milissegundos.</p>
</dd>
<dt>Tempo de Espera para Verifica&ccedil;&atilde;o de Falha)</dt>
<dd>
<p>Per&iacute;odo de tempo ap&oacute;s o qual uma suspeita de falha &eacute; marcada como verificada. O default &eacute; 1500 milissegundos.</p>
</dd>
<dt>Propriedades adicionais</dt>
<dd>
<p>Tabela de propriedades adicionais do Servi&ccedil;o de gerenciamento de grupos.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais do GMS.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome da propriedade.</p>
</dd>
<dt>Valor</dt>
<dd>
<p>Valor da propriedade definida para a inst&acirc;ncia selecionada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Descri&ccedil;&atilde;o textual que oferece mais informa&ccedil;&otilde;es sobre a propriedade.</p>
</dd>
</dl>
<p>A tabela Propriedades adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Se clicar neste bot&atilde;o, uma linha &eacute; adicionada &agrave; tabela Propriedades adicionais.</p>
</dd>
<dt>Deletar propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada volta ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Para Ativar o Servi&ccedil;o de Gerenciamento de Grupos</a></p>
</li>
<li>
<p><a href="task-gms.html">Para Configurar o Servi&ccedil;o de Gerenciamento de Grupos</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Para Configurar Defini&ccedil;&otilde;es do Servi&ccedil;o de Gerenciamento de Grupos de um Cluster</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
