<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterinstances"></a><h4>Inst&#226;ncias do servidor em clusters</h4>
<a name="indexterm-173"></a><a name="indexterm-174"></a><p>Utilize a p&#225;gina Inst&#226;ncias do servidor em clusters para criar e gerenciar
as inst&#226;ncias do Servidor GlassFish no cluster atual.</p>

<p>O campo Nome do cluster &#233; um campo de somente leitura que
exibe o nome do cluster atual.</p>

<p>A p&#225;gina Inst&#226;ncias do servidor em clusters exibe uma lista de inst&#226;ncias
que s&#227;o membros do cluster atual. Para cada inst&#226;ncia, s&#227;o fornecidas as
seguintes informa&#231;&#245;es:</p>

<dl><dt>Nome</dt>
<dd><p>Nome atribu&#237;do &#224; inst&#226;ncia quando a inst&#226;ncia foi criada. Ao clicar no nome da inst&#226;ncia, a p&#225;gina <a href="ref-clusterinstanceedit.html">Informa&#231;&#245;es gerais</a> se abre.</p>

</dd>
<dt>Peso do balanceador de cargas</dt>
<dd><p>Inteiro que representa o valor de balanceamento de carga da inst&#226;ncia.</p>

<p>O peso do balanceamento de carga determina a propor&#231;&#227;o de todas as solicita&#231;&#245;es do cluster que a inst&#226;ncia deve processar.</p>

<p>Por exemplo, em um cluster com duas inst&#226;ncias, &#233; poss&#237;vel processar uma das quatro solicita&#231;&#245;es em uma inst&#226;ncia e processar tr&#234;s das quatro solicita&#231;&#245;es na outra inst&#226;ncia. Nesse caso, defina como 1 o peso da inst&#226;ncia que processa uma das quatro solicita&#231;&#245;es e como 3 o peso da outra inst&#226;ncia. Se preferir utilizar porcentagem, defina os pesos das inst&#226;ncias como 25 e 75, respectivamente.</p>

<p>O peso padr&#227;o &#233; 100. </p>

</dd>
<dt>Configura&#231;&#227;o</dt>
<dd><p>Configura&#231;&#227;o nomeada que a inst&#226;ncia faz refer&#234;ncia. Ao clicar na configura&#231;&#227;o, a p&#225;gina Configura&#231;&#245;es da inst&#226;ncia se abre.</p>

</dd>
<dt>N&#243;</dt>
<dd><p>O nome do n&#243; no qual a inst&#226;ncia reside. Ao clicar no nome do n&#243;, a p&#225;gina <a href="ref-nodeedit.html">Editar n&#243;</a> se abre.</p>

</dd>
<dt>Status</dt>
<dd><p>Indica se a inst&#226;ncia est&#225; em execu&#231;&#227;o, se requer reinicializa&#231;&#227;o para que seja atualizada com as altera&#231;&#245;es na configura&#231;&#227;o ou se n&#227;o est&#225; em execu&#231;&#227;o. Este campo &#233; somente leitura.</p>

</dd>
</dl>
<p>A tabela Inst&#226;ncias do servidor tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para adicionar uma inst&#226;ncia ao cluster.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para remover uma ou mais inst&#226;ncias selecionadas do cluster.</p>


<hr><p><b>Cuidado - </b>Se estiver utilizando um cluster Java Message Service (JMS) com um broker mestre, n&#227;o exclua a inst&#226;ncia que est&#225; associada ao broker mestre. Se esta inst&#226;ncia deve ser exclu&#237;da, utilize o subcomando <tt>change-master-broker</tt>(1) para atribuir o broker mestre a outra inst&#226;ncia.</p>


<hr>
</dd>
<dt>Iniciar</dt>
<dd><p>Bot&#227;o para iniciar uma ou mais inst&#226;ncias selecionadas no cluster.</p>

</dd>
<dt>Interromper </dt>
<dd><p>Bot&#227;o para interromper uma ou mais inst&#226;ncias selecionadas no cluster.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-create-clustered-instance.html">Para adicionar uma inst&#226;ncia do Servidor GlassFish a um cluster</a></p>

</li>
<li><p><a href="task-delete-clustered-instances.html">Para excluir inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">Para iniciar inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Para interromper inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><tt>create-instance</tt>(1)</p>

</li>
<li><p><tt>delete-instance</tt>(1)</p>

</li>
<li><p><tt>list-instances</tt>(1)</p>

</li>
<li><p><tt>start-instance</tt>(1)</p>

</li>
<li><p><tt>stop-instance</tt>(1)</p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
