<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstancegeneral"></a><h4>Informa&#231;&#245;es gerais</h4>
<a name="indexterm-205"></a><a name="indexterm-206"></a><a name="indexterm-207"></a><p>A p&#225;gina Informa&#231;&#245;es gerais cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Iniciar</dt>
<dd><p>Bot&#227;o para iniciar a inst&#226;ncia. Se a inst&#226;ncia estiver em execu&#231;&#227;o, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Interromper </dt>
<dd><p>Bot&#227;o para interromper a inst&#226;ncia. Se a inst&#226;ncia estiver interrompida, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Reiniciar</dt>
<dd><p>Bot&#227;o para reiniciar a inst&#226;ncia. Se a inst&#226;ncia estiver interrompida, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Exibir arquivos de log</dt>
<dd><p>Bot&#227;o para exibir os arquivos de log da inst&#226;ncia.</p>

</dd>
<dt>Efetuar rota&#231;&#227;o de log</dt>
<dd><p>Bot&#227;o para efetuar rota&#231;&#227;o do arquivo log da inst&#226;ncia. Quando o arquivo de log sofre rota&#231;&#227;o, o arquivo &#233; renomeado com um nome com carimbo de data e hora no formato <tt>server.log_</tt><i> data-e-hora</i><tt></tt>, e um arquivo de log vazio &#233; criado para novas mensagens de log. As altera&#231;&#245;es s&#227;o aplicadas dinamicamente. N&#227;o &#233; necess&#225;rio reiniciar o servidor.</p>

</dd>
<dt>Recuperar transa&#231;&#245;es</dt>
<dd><p>Bot&#227;o para recuperar transa&#231;&#245;es da inst&#226;ncia.</p>

</dd>
<dt>Nome</dt>
<dd><p>Nome atribu&#237;do &#224; inst&#226;ncia quando a inst&#226;ncia foi criada. Este campo &#233; somente leitura.</p>

</dd>
<dt>JVM</dt>
<dd><p>Se voc&#234; clicar em JVM Report, ser&#225; aberta uma janela separada que exibe relat&#243;rios sobre o Java Virtual Machine, incluindo um relat&#243;rio de resumo, um relat&#243;rio de gerenciamento de mem&#243;ria e de coleta de erros,um relat&#243;rio de carregamento de classe e um despejo de segmentos atual.</p>

</dd>
<dt>Status</dt>
<dd><p>Indica&#231;&#227;o de que a inst&#226;ncia est&#225; ou n&#227;o em execu&#231;&#227;o. Este campo &#233; somente leitura.</p>

</dd>
<dt>N&#243;</dt>
<dd><p>O nome do n&#243; no qual a inst&#226;ncia reside. Ao clicar no nome do n&#243;, a p&#225;gina <a href="ref-nodeedit.html">Editar n&#243;</a> se abre.</p>

</dd>
<dt>Configura&#231;&#227;o</dt>
<dd><p>Configura&#231;&#227;o nomeada que a inst&#226;ncia faz refer&#234;ncia. Ao clicar na configura&#231;&#227;o, a p&#225;gina Configura&#231;&#245;es da inst&#226;ncia se abre.</p>

</dd>
<dt>Depura&#231;&#227;o</dt>
<dd><p>Indica&#231;&#227;o de se o depurador <a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">Java Platform Debugger Architecture (JPDA)</a> est&#225; ativado para a inst&#226;ncia. Este campo &#233; somente leitura.</p>

<p>Se uma inst&#226;ncia &#233; iniciada a partir do Console de Administra&#231;&#227;o, a depura&#231;&#227;o JPDA n&#227;o est&#225; ativada para a inst&#226;ncia. Para iniciar uma inst&#226;ncia com a depura&#231;&#227;o JPDA ativada, utilize o subcomando <tt>start-instance</tt>(1).</p>

</dd>
<dt>HTTP Ports (Portas HTTP)</dt>
<dd><p>Lista separada por v&#237;rgula dos n&#250;meros das portas na qual a inst&#226;ncia escuta os seguintes tipos de solicita&#231;&#245;es:</p>


<ul><li><p>Solicita&#231;&#245;es de administra&#231;&#227;o</p>

</li>
<li><p>Solicita&#231;&#245;es HTTP</p>

</li>
<li><p>Solicita&#231;&#245;es HTTPS</p>

</li></ul>
<p>Este campo &#233; somente leitura.</p>

</dd>
<dt>IIOP Ports (Portas IIOP)</dt>
<dd><p>Lista separada por v&#237;rgula dos n&#250;meros das portas que a inst&#226;ncia utiliza nos seguintes tipos de conex&#245;es:</p>


<ul><li><p>Conex&#227;o IIOP segura</p>

</li>
<li><p>Conex&#245;es IIOP seguras com autentica&#231;&#227;o do cliente</p>

</li>
<li><p>Conex&#245;es IIOP</p>

</li></ul>
<p>Este campo &#233; somente leitura.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-start-standalone-instances.html">Para iniciar inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para interromper inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para exibir arquivos de log de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><tt>generate-jvm-report</tt>(1)</p>

</li>
<li><p><tt>start-instance</tt>(1)</p>

</li>
<li><p><tt>stop-instance</tt>(1)</p>

</li>
<li><p><tt>rotate-log</tt>(1)</p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
