<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstanceproperties"></a><h4>Propriedades da inst&#226;ncia</h4>
<a name="indexterm-216"></a><a name="indexterm-217"></a><a name="indexterm-218"></a><p>A p&#225;gina Propriedades da inst&#226;ncia exibe uma lista das propriedades que est&#227;o
definidas para a inst&#226;ncia atual do Servidor GlassFish. Estas propriedades acrescentam informa&#231;&#245;es
opcionais de configura&#231;&#227;o sobre a inst&#226;ncia.</p>

<p>O campo Nome da inst&#226;ncia &#233; um campo de somente leitura que
exibe o nome da inst&#226;ncia atual.</p>

<p>S&#227;o exibidas as seguintes informa&#231;&#245;es para cada propriedade:</p>

<dl><dt>Nome</dt>
<dd><p>O nome da propriedade.</p>

</dd>
<dt>Valor</dt>
<dd><p>Valor da propriedade definida para a inst&#226;ncia selecionada.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Descri&#231;&#227;o textual que oferece mais informa&#231;&#245;es sobre a propriedade.</p>

</dd>
</dl>
<p>A tabela Propriedades adicionais tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Adicionar propriedade</dt>
<dd><p>Bot&#227;o para adicionar uma propriedade. Se clicar neste bot&#227;o, uma linha &#233; adicionada &#224; tabela Propriedades adicionais.</p>

</dd>
<dt>Excluir propriedades</dt>
<dd><p>Bot&#227;o para excluir uma ou mais propriedades selecionadas. Qualquer propriedade exclu&#237;da volta ao seu valor padr&#227;o ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>

</dd>
</dl>
<p>O Servidor GlassFish define as seguintes propriedades da inst&#226;ncia:</p>

<dl><dt><tt>rendezvousOccurred</tt></dt>
<dd><p>Especifica se a inst&#226;ncia contatou o servidor de administra&#231;&#227;o de dom&#237;nio (DAS). Os valores poss&#237;veis s&#227;o os seguintes:</p>

<dl><dt><tt>verdadeiro</tt></dt>
<dd><p>A inst&#226;ncia contatou o DAS.</p>

</dd>
<dt><tt>falso</tt></dt>
<dd><p>A inst&#226;ncia <b>n&#227;o</b> contatou o DAS.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-set-props-standalone-instance.html">Para definir propriedades somente da inst&#226;ncia de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><tt>get</tt>(1)</p>

</li>
<li><p><tt>list</tt>(1)</p>

</li>
<li><p><tt>set</tt>(1)</p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
