<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterinstanceedit"></a><h4>Informa&#231;&#245;es gerais</h4>
<a name="indexterm-178"></a><a name="indexterm-179"></a><a name="indexterm-180"></a><p>A p&#225;gina Informa&#231;&#245;es gerais cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Iniciar</dt>
<dd><p>Bot&#227;o para iniciar a inst&#226;ncia. Se a inst&#226;ncia estiver em execu&#231;&#227;o, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Interromper </dt>
<dd><p>Bot&#227;o para interromper a inst&#226;ncia. Se a inst&#226;ncia estiver interrompida, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Reiniciar</dt>
<dd><p>Bot&#227;o para reiniciar a inst&#226;ncia. Se a inst&#226;ncia estiver interrompida, este bot&#227;o est&#225; desativado.</p>

</dd>
<dt>Exibir arquivos de log</dt>
<dd><p>Bot&#227;o para exibir os arquivos de log da inst&#226;ncia.</p>

</dd>
<dt>Recuperar transa&#231;&#245;es</dt>
<dd><p>Bot&#227;o para recuperar transa&#231;&#245;es da inst&#226;ncia.</p>

</dd>
<dt>Nome do cluster</dt>
<dd><p>Nome atribu&#237;do ao cluster quando o cluster &#233; criado. Ao clicar no nome do cluster, a p&#225;gina <a href="ref-clustergeneral.html">Informa&#231;&#245;es gerais</a> se abre.</p>

</dd>
<dt>Nome da inst&#226;ncia</dt>
<dd><p>Nome atribu&#237;do &#224; inst&#226;ncia quando a inst&#226;ncia foi adicionada ao cluster. Este campo &#233; somente leitura.</p>

</dd>
<dt>Status</dt>
<dd><p>Indica se a inst&#226;ncia est&#225; em execu&#231;&#227;o, se requer reinicializa&#231;&#227;o para que seja atualizada com as altera&#231;&#245;es na configura&#231;&#227;o ou se n&#227;o est&#225; em execu&#231;&#227;o. Este campo &#233; somente leitura.</p>

</dd>
<dt>JVM</dt>
<dd><p>Se voc&#234; clicar em JVM Report, ser&#225; aberta uma janela separada que exibe relat&#243;rios sobre o Java Virtual Machine, incluindo um relat&#243;rio de resumo, um relat&#243;rio de gerenciamento de mem&#243;ria e de coleta de erros,um relat&#243;rio de carregamento de classe e um despejo de segmentos atual.</p>

</dd>
<dt>N&#243;</dt>
<dd><p>O nome do n&#243; no qual a inst&#226;ncia reside. Ao clicar no nome do n&#243;, a p&#225;gina <a href="ref-nodeedit.html">Editar n&#243;</a> se abre.</p>

</dd>
<dt>Configura&#231;&#227;o</dt>
<dd><p>Configura&#231;&#227;o nomeada que a inst&#226;ncia faz refer&#234;ncia. Ao clicar na configura&#231;&#227;o, a p&#225;gina <a href="../../../common/pt_BR/help/ref-configuration.html">Configura&#231;&#245;es</a> da inst&#226;ncia se abre.</p>

</dd>
<dt>HTTP Ports (Portas HTTP)</dt>
<dd><p>Lista separada por v&#237;rgula dos n&#250;meros das portas na qual a inst&#226;ncia escuta os seguintes tipos de solicita&#231;&#245;es:</p>


<ul><li><p>Solicita&#231;&#245;es de administra&#231;&#227;o</p>

</li>
<li><p>Solicita&#231;&#245;es HTTP</p>

</li>
<li><p>Solicita&#231;&#245;es HTTPS</p>

</li></ul>
<p>Este campo &#233; somente leitura.</p>

</dd>
<dt>IIOP Ports (Portas IIOP)</dt>
<dd><p>Lista separada por v&#237;rgula dos n&#250;meros das portas que a inst&#226;ncia utiliza nos seguintes tipos de conex&#245;es:</p>


<ul><li><p>Conex&#227;o IIOP segura</p>

</li>
<li><p>Conex&#245;es IIOP seguras com autentica&#231;&#227;o do cliente</p>

</li>
<li><p>Conex&#245;es IIOP</p>

</li></ul>
<p>Este campo &#233; somente leitura.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-start-clustered-instances.html">Para iniciar inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Para interromper inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">Para exibir arquivos de log de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-recovertransactions.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=restart-instance-1"><tt>restart-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-instance-1"><tt>stop-instance</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
