<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-availabilityservice"></a><h4>Servi&#231;o de disponibilidade</h4>
<a name="indexterm-219"></a><p>Utilize a p&#225;gina Servi&#231;o de disponibilidade para alterar as configura&#231;&#245;es de disponibilidade
de um cluster.</p>

<p>A p&#225;gina Servi&#231;o de disponibilidade cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Configuration Name</dt>
<dd><p>O nome da configura&#231;&#227;o para a qual as defini&#231;&#245;es nesta p&#225;gina se aplicam. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar com os valores padr&#227;o as configura&#231;&#245;es que apresentam valores padr&#227;o. As configura&#231;&#245;es que n&#227;o apresentam valores padr&#227;o n&#227;o s&#227;o alteradas.</p>

</dd>
<dt>Servi&#231;o de disponibilidade</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Ativo estiver marcada, a disponibilidade est&#225; ativada para o cluster. Por padr&#227;o, essa op&#231;&#227;o est&#225; selecionada.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Tabela de propriedades adicionais do Servi&#231;o de disponibilidade.</p>

<p>O Servidor GlassFish n&#227;o define propriedades adicionais do Servi&#231;o de disponibilidade.</p>

<p>S&#227;o exibidas as seguintes informa&#231;&#245;es para cada propriedade:</p>

<dl><dt>Nome</dt>
<dd><p>O nome da propriedade.</p>

</dd>
<dt>Valor</dt>
<dd><p>Valor da propriedade definida para a inst&#226;ncia selecionada.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Descri&#231;&#227;o textual que oferece mais informa&#231;&#245;es sobre a propriedade.</p>

</dd>
</dl>
<p>A tabela Propriedades adicionais tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Adicionar propriedade</dt>
<dd><p>Bot&#227;o para adicionar uma propriedade. Se clicar neste bot&#227;o, uma linha &#233; adicionada &#224; tabela Propriedades adicionais.</p>

</dd>
<dt>Excluir propriedades</dt>
<dd><p>Bot&#227;o para excluir uma ou mais propriedades selecionadas. Qualquer propriedade exclu&#237;da volta ao seu valor padr&#227;o ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-availabilityservice.html">Para configurar as defini&#231;&#245;es de disponibilidade de um cluster</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
