<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-mon-resource-clustered-instance" name="task-mon-resource-clustered-instance"></a><a id="GHCLU00055" name="GHCLU00055"></a></p>

<h4><a id="sthref116" name="sthref116"></a><a id="sthref117" name="sthref117"></a><a id="sthref118" name="sthref118"></a><a id="sthref119" name="sthref119"></a>Para Exibir Dados de Monitoramento de Recursos de uma Inst&acirc;ncia Clusterizada do GlassFish Server</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref120" name="sthref120"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Antes de exibir os dados de monitoramento, &eacute; preciso <a href="../../../common/pt_BR/help/missingtopic.html">configurar o servi&ccedil;o de monitoramento</a>.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandido, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es gerais do cluster se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias Clusterizadas do Servidor relativa ao cluster se abre.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia da qual visualizar os dados de monitoramento do recurso.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es gerais, clique na guia Monitor.</p>
<p>A p&aacute;gina Monitoramento da Aplica&ccedil;&atilde;o &eacute; exibida.</p>
</li>
<li>
<p>Clique na guia Recursos.</p>
<p>A p&aacute;gina Monitoramento do recurso &eacute; exibida.</p>
</li>
<li>
<p>Na lista drop-down Exibir, selecione o recurso cujos dados de monitoramento deseja visualizar.</p>
</li>
<li>
<p>Para atualizar os dados de monitoramento exibidos, clique em Atualizar.</p>
</li>
</ol>
<a id="sthref121" name="sthref121"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="../../../common/pt_BR/help/missingtopic.html">Para configurar o servi&ccedil;o de monitoramento</a></p>
</li>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia do GlassFish Server a um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias Clusterizadas do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias Clusterizadas do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias Clusterizadas do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades Somente da Inst&acirc;ncia de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados de Monitoramento de Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados de Monitoramento de Servidores Virtuais de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
