<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-change-standalone-instance-ports"></a><h4>Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish independente</h4><a name="indexterm-131"></a><a name="indexterm-132"></a><a name="indexterm-133"></a><p>Os n&#250;meros de porta de uma inst&#226;ncia independente do Servidor GlassFish s&#227;o
definidos inicialmente na configura&#231;&#227;o que a inst&#226;ncia faz refer&#234;ncia. &#201; necess&#225;rio modificar
estes n&#250;meros de porta se, por exemplo, duas inst&#226;ncias que fazem refer&#234;ncia
&#224; mesma configura&#231;&#227;o residirem no mesmo host. Nesse caso, os n&#250;meros de
porta de uma inst&#226;ncia devem ser modificados porque ambas as inst&#226;ncias fazem
refer&#234;ncia a mesma configura&#231;&#227;o.</p>

<p>Os n&#250;meros de porta de uma inst&#226;ncia s&#227;o armazenados como propriedades de
sistema Java. Estas propriedades s&#227;o transmitidas para o iniciador de aplicativo Java
atrav&#233;s da op&#231;&#227;o <tt>-D</tt> do iniciador de aplicativo Java quando o Servidor
GlassFish &#233; iniciado. </p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Inst&#226;ncias independentes.</b><p>A p&#225;gina Inst&#226;ncia de servidor independente &#233; exibida.</p></li>
<li><b>Selecione a inst&#226;ncia cujos n&#250;meros de porta deseja modificar.</b><p>A p&#225;gina Informa&#231;&#245;es gerais da inst&#226;ncia se abre.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es gerais, clique na guia  Propriedades.</b><p>A p&#225;gina Propriedades do sistema &#233; exibida.</p><p>Esta p&#225;gina exibe os valores atuais das seguintes propriedades do sistema para
a inst&#226;ncia:</p>
<ul><li><p><a href="../../../common/pt_BR/help/ref-predefinedconfigsysproperties.html">N&#250;meros de porta predefinidos na configura&#231;&#227;o da inst&#226;ncia</a></p>

</li>
<li><p>Propriedades personalizadas definidas para a inst&#226;ncia, se houver</p>

</li></ul>
</li>
<li><b>Digite o novo valor de cada propriedade que estiver sendo modificada no
campo Valor de substitui&#231;&#227;o.</b></li>
<li><b>Defina os valores de quaisquer propriedades adicionais que forem necess&#225;rias.</b><ol style="list-style-type: lower-alpha">
<li><b>Na tabela Propriedades adicionais, clique em Adicionar propriedade.</b><p>Uma linha &#233; adicionada &#224; tabela Propriedades adicionais.</p></li>
<li><b>No campo Nome da vari&#225;vel, digite o nome da propriedade.</b></li>
<li><b>No campo Valor de substitui&#231;&#227;o, digite o valor.</b></li></ol></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Para criar uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Para excluir inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">Para iniciar inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para interromper inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para exibir arquivos de log de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">Para implantar um aplicativo em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">Para listar aplicativos que est&#227;o implantados em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Para desimplantar aplicativos de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Para remover aplicativos de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Para editar um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Para ativar ou desativar um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Para ativar ou desativar o balanceamento de carga de um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Para criar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">Para listar um recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Para ativar e desativar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Para editar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Para definir propriedades somente da inst&#226;ncia de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Para exibir dados de monitoramento de aplicativo de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Para exibir dados de monitoramento de servidor virtual de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Para exibir dados de monitoramento de recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
