<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-migrate-ejb-timers"></a><h4>Para migrar temporizadores EJB</h4><a name="indexterm-158"></a><a name="indexterm-159"></a><a name="indexterm-160"></a><p>Se uma inst&#226;ncia do Servidor GlassFish for interrompida, os temporizadores da tecnologia
Enterprise JavaBeans (EJB) instalados em tal inst&#226;ncia tamb&#233;m interrompem a execu&#231;&#227;o. Se
a inst&#226;ncia foi interrompida de forma anormal ou inesperada, para permitir que
estes temporizadores funcionem enquanto a inst&#226;ncia estiver interrompida, &#233; necess&#225;rio migrar os
temporizadores para uma inst&#226;ncia do servidor em execu&#231;&#227;o no cluster.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Clusters.</b></li>
<li><b>No n&#243; Clusters da &#225;rvore de navega&#231;&#227;o, selecione o cluster.</b><p>A p&#225;gina Informa&#231;&#245;es gerais do cluster se abre.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es gerais, clique Migrar temporizadores EJB.</b><p>A p&#225;gina Migrar temporizadores EJB &#233; exibida.</p>
<hr><p><b>Observa&#231;&#227;o - </b>Se todas as inst&#226;ncias do cluster estiverem em execu&#231;&#227;o, o bot&#227;o Migrar
temporizadores EJB est&#225; desativado.</p>


<hr>
</li>
<li><b>Na p&#225;gina Migrar temporizadores EJB, selecione a inst&#226;ncia da qual e para
a qual migrar os temporizadores.</b><ol style="list-style-type: lower-alpha">
<li><b>Na lista suspensa Origem, selecione a inst&#226;ncia interrompida da qual migrar os
temporizadores.</b></li>
<li>(Opcional) <b>Na lista suspensa Destino, selecione a inst&#226;ncia em execu&#231;&#227;o para a qual
migrar os temporizadores. </b></li>
<li><b>Clique em OK.</b></li></ol></li>
<li><b>Interrompa e reinicie a inst&#226;ncia para a qual migrou os temporizadores EJB.</b><p>Se a inst&#226;ncia de origem estiver em execu&#231;&#227;o ou se a inst&#226;ncia
de destino n&#227;o estiver em execu&#231;&#227;o, o Console de Administra&#231;&#227;o exibe uma
mensagem de erro.</p></li></ol>

<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
