<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-start-cluster"></a><h4>Para iniciar um cluster</h4><a name="indexterm-8"></a><p>Ao iniciar um cluster, todas as inst&#226;ncias do Servidor GlassFish do cluster
que ainda n&#227;o est&#227;o em execu&#231;&#227;o s&#227;o iniciadas. </p>

<h6>Antes de come&#231;ar</h6><p>Certifique-se de que os pr&#233;-requisitos seguintes sejam cumpridos:</p>


<ul><li><p>Todos os n&#243;s nos quais se encontram as inst&#226;ncias do cluster est&#227;o ativados para comunica&#231;&#227;o remota.</p>

</li>
<li><p>O usu&#225;rio do servidor de administra&#231;&#227;o de dom&#237;nio (DAS) pode usar shell seguro (SSH) para efetuar logon no host de qualquer n&#243; em que se encontrem as inst&#226;ncias do cluster.</p>

</li></ul>
<p>Se nenhum destes pr&#233;-requisitos for cumprido, inicie o cluster iniciando cada inst&#226;ncia
individualmente na linha de comando utilizando o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-local-instance-1"><tt>start-local-instance</tt>(1)</a>.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Clusters.</b><p>A p&#225;gina Clusters &#233; exibida.</p></li>
<li><b>Na p&#225;gina Clusters, marque a caixa de sele&#231;&#227;o ao lado do nome
do cluster.</b></li>
<li><b>Clique em Iniciar cluster.</b><p>Voc&#234; &#233; solicitado a confirmar que deseja iniciar o cluster.</p></li>
<li><b>Confirme que deseja iniciar o cluster.</b><p>O cluster &#233; iniciado. O status de cada inst&#226;ncia do cluster &#233;
atualizado na p&#225;gina Clusters quando a inst&#226;ncia for iniciada.</p></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-create-cluster.html">Para criar um cluster</a></p>

</li>
<li><p><a href="task-delete-cluster.html">Para excluir um cluster</a></p>

</li>
<li><p><a href="task-availabilityservice.html">Para configurar as defini&#231;&#245;es de disponibilidade de um cluster</a></p>

</li>
<li><p><a href="task-stop-cluster.html">Para interromper um cluster</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">Para modificar a configura&#231;&#227;o de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">Para implantar um aplicativo em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">Para listar aplicativos que est&#227;o implantados em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">Para desimplantar aplicativos de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">Para remover aplicativos de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">Para editar um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">Para ativar ou desativar um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">Para ativar ou desativar o balanceamento de carga de um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">Para criar um recurso para um cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">Para listar um recurso de um cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">Para ativar ou desativar globalmente um recurso</a></p>

</li>
<li><p><a href="task-cluster-resource-edit.html">Para editar um recurso de um cluster</a></p>

</li>
<li><p><a href="task-upgrade-components.html">Para atualizar componentes sem perda de servi&#231;o</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
