<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-cluster-resource-edit"></a><h4>Para editar um recurso de um cluster</h4><a name="indexterm-39"></a><a name="indexterm-40"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Clusters.</b></li>
<li><b>No n&#243; Clusters expandido, selecione o n&#243; do cluster.</b><p>A p&#225;gina Informa&#231;&#245;es gerais do cluster se abre.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es gerais, clique na guia Recursos. </b><p>A p&#225;gina Recursos do cluster se abre.</p></li>
<li><b>Clique no nome do recurso.</b><p>A p&#225;gina para a edi&#231;&#227;o do recurso se abre.</p></li>
<li><b>Na p&#225;gina para edi&#231;&#227;o do recurso, fa&#231;a as altera&#231;&#245;es necess&#225;rias e salve-as.</b><p>Para obter detalhes, consulte a ajuda on-line da p&#225;gina de edi&#231;&#227;o de
recursos.</p></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-create-cluster.html">Para criar um cluster</a></p>

</li>
<li><p><a href="task-delete-cluster.html">Para excluir um cluster</a></p>

</li>
<li><p><a href="task-availabilityservice.html">Para configurar as defini&#231;&#245;es de disponibilidade de um cluster</a></p>

</li>
<li><p><a href="task-start-cluster.html">Para iniciar um cluster</a></p>

</li>
<li><p><a href="task-stop-cluster.html">Para interromper um cluster</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">Para modificar a configura&#231;&#227;o de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">Para implantar um aplicativo em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">Para listar aplicativos que est&#227;o implantados em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">Para desimplantar aplicativos de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">Para remover aplicativos de um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">Para editar um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">Para ativar ou desativar um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">Para ativar ou desativar o balanceamento de carga de um aplicativo que est&#225; implantado em um cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">Para criar um recurso para um cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">Para listar um recurso de um cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">Para ativar ou desativar globalmente um recurso</a></p>

</li>
<li><p><a href="task-upgrade-components.html">Para atualizar componentes sem perda de servi&#231;o</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
