<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-config-sys-properties-defaults"></a><h3>Para definir os valores padr&#227;o para configura&#231;&#227;o das propriedades do sistema</h3><p>Os valores padr&#227;o das propriedades de configura&#231;&#227;o s&#227;o definidos na configura&#231;&#227;o que
o cluster ou a inst&#226;ncia fazem refer&#234;ncia.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; da configura&#231;&#227;o.</b></li>
<li><b>Na lista dos tipos de propriedades do n&#243; expandido, selecione Propriedades do
sistema.</b><p>A p&#225;gina Propriedades do sistema da configura&#231;&#227;o selecionada se abre.</p><p>Esta p&#225;gina exibe os valores atuais das seguintes propriedades do sistema para
a configura&#231;&#227;o:</p>
<ul><li><p>N&#250;meros de porta predefinidos quando a configura&#231;&#227;o foi criada</p>

</li>
<li><p>Propriedades personalizadas adicionadas &#224; configura&#231;&#227;o, se houver</p>

</li></ul>
</li>
<li><b>Para certificar-se de que as altera&#231;&#245;es sejam aplicadas sem ter que reiniciar
o cluster ou a inst&#226;ncia, selecione a op&#231;&#227;o Reconfigura&#231;&#227;o din&#226;mica.</b></li>
<li><b>Digite o novo valor da propriedade no campo Valor padr&#227;o de cada
propriedade cujo valor padr&#227;o estiver sendo definido.</b></li>
<li><b>Defina os valores padr&#227;o de quaisquer propriedades adicionais que forem necess&#225;rias.</b><ol style="list-style-type: lower-alpha">
<li><b>Na tabela Propriedades adicionais, clique em Adicionar propriedade.</b><p>Uma linha &#233; adicionada &#224; tabela Propriedades adicionais.</p></li>
<li><b>No campo Nome da vari&#225;vel, digite o nome da propriedade.</b></li>
<li><b>No campo Valor padr&#227;o, digite o valor.</b></li></ol></li>
<li><b>Clique em Salvar.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-change-clustered-instance-ports.html">Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
