<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-gmsenable"></a><h3>Para ativar o servi&#231;o de gerenciamento de grupos</h3><a name="indexterm-150"></a><a name="indexterm-151"></a><p>O servi&#231;o de gerenciamento de grupos (GMS) &#233; um servi&#231;o em processo
que oferece monitoramento de cluster, associa&#231;&#227;o de cluster e servi&#231;os de comunica&#231;&#227;o
de grupos. O GMS realiza as seguintes fun&#231;&#245;es:</p>


<ul><li><p>Notifica os m&#243;dulos registrados em uma inst&#226;ncia do Servidor GlassFish quando uma ou mais inst&#226;ncias do membro s&#227;o adicionadas ou removidas de um cluster, ou quando tais inst&#226;ncias sejam suspeitas de ter falhas ou realmente tenham falhas.</p>

</li>
<li><p>Oferece a capacidade de enviar e receber mensagens entre um grupo de processos.</p>

</li></ul>
<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Clusters.</b></li>
<li><b>Selecione o cluster para o qual estiver ativando o servi&#231;o de gerenciamento
de grupos (GMS).</b><p>A p&#225;gina Informa&#231;&#245;es gerais do cluster se abre.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o GMS ativado para ativar o GMS do
cluster.</b><p>Por padr&#227;o, essa op&#231;&#227;o est&#225; selecionada. Para desativar o GMS do cluster,
desmarque a caixa de sele&#231;&#227;o GMS ativado.</p><p>Se ativado, o servi&#231;o de gerenciamento de grupos (GMS) &#233; iniciado em
cada inst&#226;ncia do servidor do cluster e do servidor de administra&#231;&#227;o do
dom&#237;nio (DAS). O DAS participa de cada cluster no qual o GMS
estiver ativado.</p></li>
<li><b>Clique em Salvar.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-gmscluster.html">Para configurar as defini&#231;&#245;es do servi&#231;o de gerenciamento de grupos de um cluster</a></p>

</li>
<li><p><a href="task-gms.html">Para configurar o servi&#231;o de gerenciamento de grupos</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
