<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-recovertransactions-standalone-instance"></a><h4>Para recuperar transa&#231;&#245;es de uma inst&#226;ncia independente do Servidor GlassFish</h4><a name="indexterm-99"></a><a name="indexterm-100"></a><a name="indexterm-101"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Inst&#226;ncias independentes.</b><p>A p&#225;gina Inst&#226;ncia de servidor independente &#233; exibida.</p></li>
<li><b>Selecione a inst&#226;ncia para a qual &#233; necess&#225;ria a recupera&#231;&#227;o de transa&#231;&#245;es.</b><p>A p&#225;gina Informa&#231;&#245;es gerais da inst&#226;ncia se abre.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es gerais, clique em Recuperar transa&#231;&#245;es.</b><p>A p&#225;gina Recuperar transa&#231;&#245;es se abre.</p><p>O conte&#250;do da p&#225;gina depende se a inst&#226;ncia est&#225; ou n&#227;o em
execu&#231;&#227;o.</p>
<ul><li><p>Se a inst&#226;ncia estiver em execu&#231;&#227;o, a p&#225;gina Recuperar transa&#231;&#245;es cont&#233;m somente o texto <b>A recupera&#231;&#227;o &#233; realizada pelo pr&#243;prio servidor em execu&#231;&#227;o</b> e o bot&#227;o OK.</p>

</li>
<li><p>Se a inst&#226;ncia n&#227;o estiver em execu&#231;&#227;o, a p&#225;gina Recuperar transa&#231;&#245;es cont&#233;m op&#231;&#245;es adicionais.</p>

</li></ul>
</li>
<li><b>Na lista suspensa Servidor de destino, selecione outra inst&#226;ncia que pode recuperar
as transa&#231;&#245;es na inst&#226;ncia atual.</b><p>Selecione, para uma inst&#226;ncia independente, a inst&#226;ncia denominada <tt>server</tt>, que representa o
servidor de administra&#231;&#227;o de dom&#237;nio (DAS).</p></li>
<li><b>No campo Diret&#243;rio do log de transa&#231;&#227;o, digite o diret&#243;rio em que
os logs de transa&#231;&#227;o s&#227;o armazenados.</b><p>O padr&#227;o &#233; <tt>/logs/tx</tt> no diret&#243;rio do dom&#237;nio. Os logs de transa&#231;&#227;o
s&#227;o mantidos no subdiret&#243;rio <tt>tx</tt> do diret&#243;rio especificado pela configura&#231;&#227;o do Local
do log de transa&#231;&#227;o do Servi&#231;o de transa&#231;&#227;o na configura&#231;&#227;o do cluster.
O valor padr&#227;o do Local do log de transa&#231;&#227;o &#233; o diret&#243;rio
especificado pelo campo Raiz de log da p&#225;gina Atributos do dom&#237;nio, que
est&#225; localizado na guia Avan&#231;ado do n&#243; do Servidor GlassFish.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Para criar uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Para excluir inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">Para iniciar inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para interromper inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para exibir arquivos de log de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">Para implantar um aplicativo em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">Para listar aplicativos que est&#227;o implantados em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Para desimplantar aplicativos de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Para remover aplicativos de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Para editar um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Para ativar ou desativar um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Para ativar ou desativar o balanceamento de carga de um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Para criar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">Para listar um recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Para ativar e desativar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Para editar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Para definir propriedades somente da inst&#226;ncia de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Para exibir dados de monitoramento de aplicativo de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Para exibir dados de monitoramento de servidor virtual de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Para exibir dados de monitoramento de recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
