<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-config-sys-properties-defaults" name="task-config-sys-properties-defaults"></a><a id="GHCLU00086" name="GHCLU00086"></a></p>

<h4>Para definir os valores Default para configura&ccedil;&atilde;o das propriedades do sistema</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Os valores default das propriedades de configura&ccedil;&atilde;o s&atilde;o definidos na configura&ccedil;&atilde;o que o cluster ou a inst&acirc;ncia fazem refer&ecirc;ncia.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; da configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Na lista dos tipos de propriedades do n&oacute; expandido, selecione Propriedades do sistema.</p>
<p>A p&aacute;gina Propriedades do sistema da configura&ccedil;&atilde;o selecionada se abre.</p>
<p>Esta p&aacute;gina exibe os valores atuais das seguintes propriedades do sistema para a configura&ccedil;&atilde;o:</p>
<ul>
<li>
<p><a href="../../../common/pt_BR/help/missingtopic.html">N&uacute;meros de porta predefinidos quando a configura&ccedil;&atilde;o foi criada</a></p>
</li>
<li>
<p>Propriedades personalizadas adicionadas &agrave; configura&ccedil;&atilde;o, se houver</p>
</li>
</ul>
</li>
<li>
<p>Para certificar-se de que as altera&ccedil;&otilde;es sejam aplicadas sem ter que reiniciar o cluster ou a inst&acirc;ncia, selecione a op&ccedil;&atilde;o Reconfigura&ccedil;&atilde;o din&acirc;mica.</p>
</li>
<li>
<p>Digite o novo valor da propriedade no campo Valor default de cada propriedade cujo valor default estiver sendo definido.</p>
</li>
<li>
<p>Defina os valores default de quaisquer propriedades adicionais que forem necess&aacute;rias.</p>
<ol type="a">
<li>
<p>Na tabela Propriedades adicionais, clique em Adicionar propriedade.</p>
<p>Uma linha &eacute; adicionada &agrave; tabela Propriedades adicionais.</p>
</li>
<li>
<p>No campo Nome da vari&aacute;vel, digite o nome da propriedade.</p>
</li>
<li>
<p>No campo Valor Default, digite o valor.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref243" name="sthref243"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia Standalone do GlassFish Server</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
