<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-delete-clustered-instances"></a><h3>Para excluir inst&#226;ncias do Servidor GlassFish em cluster</h3><a name="indexterm-48"></a><a name="indexterm-49"></a><a name="indexterm-50"></a>
<hr><p><b>Cuidado - </b>Se estiver utilizando um cluster Java Message Service (JMS) com um broker
mestre, n&#227;o exclua a inst&#226;ncia que est&#225; associada ao broker mestre. Se
esta inst&#226;ncia deve ser exclu&#237;da, utilize o subcomando <tt>change-master-broker</tt>(1) para atribuir o
broker mestre a outra inst&#226;ncia.</p>


<hr>
<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Clusters.</b></li>
<li><b>No n&#243; Clusters expandido, selecione o n&#243; do cluster.</b><p>A p&#225;gina Informa&#231;&#245;es gerais do cluster se abre.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es gerais, clique na guia Inst&#226;ncias. </b><p>A p&#225;gina Inst&#226;ncias do servidor em clusters do cluster se abre.</p></li>
<li><b>Para cada inst&#226;ncia que estiver sendo exclu&#237;da, selecione a caixa de sele&#231;&#227;o
ao lado da inst&#226;ncia na tabela Inst&#226;ncias do servidor.</b></li>
<li><b>Clique em Excluir.</b><p>Voc&#234; &#233; solicitado a confirmar que deseja excluir as inst&#226;ncias.</p></li>
<li><b>Confirme que deseja excluir as inst&#226;ncias.</b><p>As inst&#226;ncias s&#227;o exclu&#237;das e removidas da tabela de inst&#226;ncias da p&#225;gina.</p></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-create-clustered-instance.html">Para adicionar uma inst&#226;ncia do Servidor GlassFish a um cluster</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">Para iniciar inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Para interromper inst&#226;ncias do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">Para exibir arquivos de log de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-recovertransactions.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">Para definir propriedades somente da inst&#226;ncia de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">Para exibir dados de monitoramento de aplicativo de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">Para exibir dados de monitoramento de servidor virtual de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">Para exibir dados de monitoramento de recurso de uma inst&#226;ncia do Servidor GlassFish em cluster</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
