<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-mon-server-standalone-instance"></a><h3>Para exibir dados de monitoramento de servidor virtual de uma inst&#226;ncia do Servidor GlassFish independente</h3><a name="indexterm-142"></a><a name="indexterm-143"></a><a name="indexterm-144"></a><a name="indexterm-145"></a><p><b>Antes de come&#231;ar</b></p><p>Antes de exibir os dados de monitoramento, &#233; preciso configurar o servi&#231;o de monitoramento.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Inst&#226;ncias independentes.</b><p>A p&#225;gina Inst&#226;ncia de servidor independente &#233; exibida.</p></li>
<li><b>Selecione a inst&#226;ncia cujos dados de monitoramento dos servidores virtuais deseja visualizar.</b><p>A p&#225;gina Informa&#231;&#245;es gerais da inst&#226;ncia se abre.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es gerais, clique na guia Monitor.</b><p>A p&#225;gina Monitoramento do aplicativo &#233; exibida.</p></li>
<li><b>Clique na guia Servidor.</b><p>A p&#225;gina Monitoramento do servidor &#233; exibida.</p></li>
<li><b>Na lista suspensa Exibir, selecione o componente cujos dados de monitoramento deseja
visualizar.</b></li>
<li><b>Para atualizar os dados de monitoramento exibidos, clique em Atualizar.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p>Para configurar o servi&#231;o de monitora&#231;&#227;o</p>

</li>
<li><p><a href="task-create-standalone-instance.html">Para criar uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Para excluir inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">Para iniciar inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para interromper inst&#226;ncias independentes do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para exibir arquivos de log de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transa&#231;&#245;es de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">Para implantar um aplicativo em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">Para listar aplicativos que est&#227;o implantados em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Para desimplantar aplicativos de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Para remover aplicativos de uma inst&#226;ncia independente do Servidor GlassFish</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Para editar um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Para ativar ou desativar um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Para ativar ou desativar o balanceamento de carga de um aplicativo que est&#225; implantado em uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Para criar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">Para listar um recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Para ativar e desativar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Para editar um recurso para uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Para modificar os n&#250;meros de porta de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Para definir propriedades somente da inst&#226;ncia de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Para exibir dados de monitoramento de aplicativo de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Para exibir dados de monitoramento de recurso de uma inst&#226;ncia do Servidor GlassFish independente</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
