<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-start-clustered-instances" name="task-start-clustered-instances"></a><a id="GHCLU00047" name="GHCLU00047"></a></p>

<h4><a id="sthref76" name="sthref76"></a><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>Para Iniciar Inst&acirc;ncias Clusterizadas do GlassFish Server</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref79" name="sthref79"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de que os pr&eacute;-requisitos seguintes sejam cumpridos:</p>
<ul>
<li>
<p>Todos os n&oacute;s nos quais se encontram as inst&acirc;ncias est&atilde;o ativados para comunica&ccedil;&atilde;o remota.</p>
</li>
<li>
<p>O usu&aacute;rio do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS) pode usar shell seguro (SSH) para efetuar log-in no host de qualquer n&oacute; em que se encontrem as inst&acirc;ncias.</p>
</li>
</ul>
<p>Se algum desses pr&eacute;-requisitos n&atilde;o for atendido, inicie cada inst&acirc;ncia individualmente pela linha de comandos, usando o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00237"><code>start-local-instance</code>(1)</a>.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandido, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es gerais do cluster se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias Clusterizadas do Servidor relativas ao cluster se abre.</p>
</li>
<li>
<p>Para cada inst&acirc;ncia que estiver sendo iniciada, marque a caixa de sele&ccedil;&atilde;o ao lado da inst&acirc;ncia na tabela Inst&acirc;ncias do servidor.</p>
</li>
<li>
<p>Clique em Iniciar.</p>
<p>Voc&ecirc; &eacute; solicitado a confirmar que deseja iniciar as inst&acirc;ncias.</p>
</li>
<li>
<p>Confirme que deseja iniciar as inst&acirc;ncias.</p>
<p>O status de cada inst&acirc;ncia &eacute; atualizado na tabela Inst&acirc;ncias do servidor quando a inst&acirc;ncia for iniciada.</p>
</li>
</ol>
<a id="sthref80" name="sthref80"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia do GlassFish Server a um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias Clusterizadas do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias Clusterizadas do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades Somente da Inst&acirc;ncia de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados de Monitoramento de Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados de Monitoramento de Servidores Virtuais de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Para Exibir Dados de Monitoramento de Recursos de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
