<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jndiexternalresourceedit"></a><h4>Para editar un recurso JNDI externo</h4><a name="indexterm-17"></a><a name="indexterm-18"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Recursos.</b></li>
<li><b>En el nodo Recursos, expanda el nodo JNDI.</b></li>
<li><b>En el nodo JNDI, seleccione Recursos externos.</b><p>Se abrir&#225; la p&#225;gina Recursos externos.</p></li>
<li><b>En la p&#225;gina Recursos externos, haga clic en el nombre del recurso
que va a editar.</b><p>Se abrir&#225; la p&#225;gina Editar recurso externo.</p></li>
<li><b>Para modificar el tipo de recurso, realice una de las acciones siguientes.</b><ul>
<li><b>En la lista desplegable, seleccione una definici&#243;n de tipo.</b></li>
<li><b>Seleccione el segundo bot&#243;n de opci&#243;n y escriba una definici&#243;n de tipo
completamente cualificada que siga el formato <tt><i>xxx</i>.<i>xxx</i></tt>.</b></li></ul></li>
<li><b>En el campo Clase de f&#225;brica, escriba un dep&#243;sito externo de clase
de f&#225;brica JNDI para el recurso externo.</b><p>La Clase de f&#225;brica es el nombre especificado por el usuario para
la clase de f&#225;brica, como <tt>com.sun.jndi.ldap</tt>. Esta clase implementa la interfaz <tt>javax.naming.spi.InitialContextFactory</tt>.</p></li>
<li><b>En el campo B&#250;squeda JNDI, escriba el valor JNDI que buscar en
el dep&#243;sito externo.</b><p>Por ejemplo, cuando se crea un recurso externo para conectar a un
dep&#243;sito externo, para probar una clase de bean, la b&#250;squeda JNDI puede
seguir el formato: <tt>cn=<i>testmybean</i></tt>.</p></li>
<li><b>En el campo Descripci&#243;n, escriba una breve descripci&#243;n del recurso.</b><p>Esta descripci&#243;n es un valor de cadena y puede incluir un m&#225;ximo
de 250 caracteres.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar el recurso.</b><p>De forma predeterminada, el recurso est&#225; habilitado, lo cual significa que est&#225;
disponible en cuanto se crea.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique propiedades adicionales del recurso externo.</b><p>GlassFish Server no define ninguna propiedad adicional para los recursos externos.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite su campo Valor.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-jndicustomresourcenew.html">Para crear un recurso JNDI personalizado</a></p>

</li>
<li><p><a href="task-jndicustomresourceedit.html">Para editar un recurso JNDI personalizado</a></p>

</li>
<li><p><a href="task-jndicustomresourcedelete.html">Para eliminar un recurso JNDI personalizado</a></p>

</li>
<li><p><a href="task-jndiexternalresourcecreate.html">Para crear un recurso JNDI externo</a></p>

</li>
<li><p><a href="task-jndiexternalresourcedelete.html">Para eliminar un recurso JNDI externo</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
