<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-applications"></a><h4>Aplicativos</h4>
<a name="indexterm-162"></a><p>A p&#225;gina Aplicativos exibe uma lista dos aplicativos que s&#227;o implantados no
Servidor GlassFish. &#201; poss&#237;vel visualizar e gerenciar os aplicativos implantados, e voc&#234;
pode implantar mais aplicativos.</p>

<p>Para cada aplicativo, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do aplicativo.</p>

<p>O nome pode incluir um identificador de vers&#227;o opcional, que segue o nome e &#233; separado do nome por dois pontos (<tt>:</tt>). Para obter mais informa&#231;&#245;es sobre vers&#245;es de aplicativos e m&#243;dulos, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions no <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Ativado ou status</dt>
<dd><p>Uma marca de sele&#231;&#227;o se o aplicativo estiver ativado ou um X se o aplicativo estiver desativado, somente se a inst&#226;ncia padr&#227;o do servidor ,<tt>server</tt>, existir.</p>

<p>Se os clusters ou outras inst&#226;ncias de servidores independentes existirem, selecione Ativado em Destinos para visualizar os destinos nos quais o aplicativo est&#225; implantado.</p>

</dd>
<dt>Mecanismos</dt>
<dd><p>Os tipos de recipientes usados pelo aplicativo. Os tipos de recipientes podem ser:</p>


<ul><li><p><tt>web</tt></p>

</li>
<li><p><tt>webservices</tt></p>

</li>
<li><p><tt>ejb</tt></p>

</li>
<li><p><tt>connector</tt></p>

</li>
<li><p><tt>appclient</tt></p>

</li>
<li><p><tt>weld</tt> (o container para Contextos e Inje&#231;&#227;o de depend&#234;ncia para aplicativos da plataforma Java EE)</p>

</li></ul>
</dd>
<dt>A&#231;&#227;o</dt>
<dd><p>Links para as a&#231;&#245;es que voc&#234; pode executar no componente ap&#243;s a implanta&#231;&#227;o: Reimplantar e Recarregar para todos os componentes e Iniciar para aplicativos Web.</p>

</dd>
</dl>
<p>A tabela Aplicativos implementados tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Implementar</dt>
<dd><p>Bot&#227;o para implementar um aplicativo.</p>

</dd>
<dt>Cancelar implementa&#231;&#227;o</dt>
<dd><p>Bot&#227;o para cancelar a implementa&#231;&#227;o de um ou mais aplicativos selecionados.</p>

</dd>
<dt>Ativar</dt>
<dd><p>Bot&#227;o para ativar um ou mais aplicativos selecionados, somente se a inst&#226;ncia padr&#227;o do servidor, <tt>server</tt>, existir.</p>

</dd>
<dt>Desativar</dt>
<dd><p>Bot&#227;o para desativar um ou mais aplicativos selecionados, somente se a inst&#226;ncia padr&#227;o do servidor, <tt>server</tt>, existir.</p>

</dd>
<dt>Filtro</dt>
<dd><p>Lista suspensa que filtra os aplicativos por mecanismo.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-applistdeployed.html">Para exibir uma lista de aplicativos implantados</a></p>

</li>
<li><p><a href="task-appdeployweb.html">Para implantar um aplicativo Web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p>

</li>
<li><p><a href="task-appviewtargets.html">Para visualizar destinos do aplicativo</a></p>

</li>
<li><p><a href="task-endpoint.html">Para visualizar as informa&#231;&#245;es do ponto final para um servi&#231;o Web</a></p>

</li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar um cliente de aplicativo</a></p>

</li>
<li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-apprestart.html">Para recarregar um aplicativo implantado</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
