<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-predefinedconfigsysproperties"></a><h4>Propriedades Predefinidas do Sistema </h4>
<p>O Servidor GlassFish define as seguintes propriedades do sistema de configura&#231;&#227;o:</p>

<dl><dt><tt>ASADMIN_LISTENER_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero das portas HTTP ou HTTPS para administra&#231;&#227;o. Essa &#233; a porta no URL especificada no navegador da Web para gerenciar a inst&#226;ncia, por exemplo, <tt>http://localhost:4949 </tt>. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>HTTP_LISTENER_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero de porta que &#233; utilizada para interpretar pedidos HTTP. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>HTTP_SSL_LISTENER_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero da porta que &#233; utilizada para interpretar pedidos HTTPS. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>IIOP_LISTENER_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero da porta que &#233; utilizada para conex&#245;es IIOP. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>IIOP_SSL_LISTENER_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero da porta que &#233; utilizada para conex&#245;es IIOP seguras. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>IIOP_SSL_MUTUALAUTH_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero da porta que &#233; utilizada para conex&#245;es IIOP seguras com autentica&#231;&#227;o do cliente. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>JAVA_DEBUGGER_PORT</tt></dt>
<dd><p>Esta propriedade especifica o n&#250;mero da porta que &#233; utilizada para as conex&#245;es com o depurador <a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">Java Platform Debugger Architecture (JPDA)</a>. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>JMS_PROVIDER_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero da porta para o provedor Java Message Service. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>JMX_SYSTEM_CONNECTOR_PORT</tt></dt>
<dd><p>Essa propriedade especifica o n&#250;mero da porta na qual o conector JMX escuta. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt><tt>OSGI_SHELL_TELNET_PORT</tt></dt>
<dd><p>Esta propriedade especifica o n&#250;mero da porta que &#233; utilizada para as conex&#245;es com o <a href="http://felix.apache.org/site/apache-felix-remote-shell.html">shell remoto Apache Felix</a>. Este shell utiliza o servi&#231;o de shell Felix para interagir com o subsistema de gerenciamento do m&#243;dulo OSGi. Os valores v&#225;lidos s&#227;o 1&#8211;65535. Em UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1&#8211;1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
</dl>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
