<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Usu&#225;rios do Arquivo</h4>
<a name="indexterm-214"></a><p>Use a p&#225;gina Usu&#225;rios do Arquivo para gerenciar os usu&#225;rios do realm
do <tt>arquivo</tt>. Usu&#225;rios e grupos do dom&#237;nio <tt>arquivo</tt> s&#227;o listados no arquivo principal,
cuja localiza&#231;&#227;o est&#225; especificada na propriedade <tt>arquivo</tt>.</p>

<p>Um usu&#225;rio do dom&#237;nio <tt>arquivo</tt> pode pertencer a um <b> grupo Java</b>, uma categoria
de usu&#225;rios classificada por caracter&#237;sticas comuns. Por exemplo, os clientes de um
aplicativo de e-commerce podem pertencer ao grupo <tt>CLIENTE</tt>, mas os grandes consumidores
podem pertencer ao grupo <tt>PREFERENCIAL</tt>.  A categoriza&#231;&#227;o de usu&#225;rios em grupos
facilita ainda mais o controle do acesso de um grande n&#250;mero de
usu&#225;rios.</p>

<p>Inicialmente, ap&#243;s a instala&#231;&#227;o do Servidor GlassFish, o &#250;nico usu&#225;rio &#233; o
administrador especificado durante a instala&#231;&#227;o.  Por padr&#227;o, esse usu&#225;rio pertence ao
grupo <tt>asadmin</tt>, no <tt>dom&#237;nio admin</tt>, o que lhe direitos para modificar o Servidor
GlassFish.  Todos os usu&#225;rios atribu&#237;dos a esse grupo ter&#227;o privil&#233;gios de
administrador, ou seja, eles ter&#227;o acesso &#224; ferramenta <tt>asadmin</tt> e ao Console
de Administra&#231;&#227;o.</p>

<p>A p&#225;gina Usu&#225;rios do Arquivo exibe uma lista de usu&#225;rios do dom&#237;nio
selecionado. Para cada usu&#225;rio, as seguintes informa&#231;&#245;es s&#227;o fornecidas:</p>

<dl><dt>ID do Usu&#225;rio</dt>
<dd><p>O nome de usu&#225;rio.</p>

</dd>
<dt>Lista de Grupos</dt>
<dd><p>Os grupos aos quais o usu&#225;rio pertence.</p>

</dd>
</dl>
<p>A tabela Usu&#225;rios do Arquivo tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo usu&#225;rio.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais usu&#225;rios selecionados.</p>

</dd>
</dl>
<a name="gkool"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-fileuserscreate.html">Para adicionar um usu&#225;rio ao dom&#237;nio arquivo</a></p>

</li>
<li><p><a href="task-fileusersedit.html">Para editar informa&#231;&#245;es do usu&#225;rio do dom&#237;nio arquivo</a></p>

</li>
<li><p><a href="task-fileusersdelete.html">Para excluir um usu&#225;rio do dom&#237;nio arquivo</a></p>

</li></ul>
<a name="gkonn"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-file-users-1"><tt>list-file-users</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-file-user-1"><tt>create-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-file-user-1"><tt>update-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-file-user-1"><tt>delete-file-user</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
