<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-manageadminrealm"></a><h4>Usu&#225;rios Administrativos</h4>
<a name="indexterm-215"></a><p>Use a p&#225;gina Usu&#225;rios Administrativos para gerenciar os usu&#225;rios do <tt>realm-admin</tt>. O <tt>realm-admin</tt>
&#233; um arquivo realm. Usu&#225;rios e grupos do dom&#237;nio <tt>arquivo</tt> s&#227;o listados
no arquivo principal, cuja localiza&#231;&#227;o est&#225; especificada na propriedade <tt>arquivo</tt>.</p>

<p>Inicialmente, ap&#243;s a instala&#231;&#227;o do Servidor GlassFish, o &#250;nico usu&#225;rio &#233; o
administrador especificado durante a instala&#231;&#227;o.  Por padr&#227;o, esse usu&#225;rio pertence ao
grupo <tt>asadmin</tt>, no <tt>dom&#237;nio admin</tt>, o que lhe direitos para modificar o Servidor
GlassFish.  Todos os usu&#225;rios atribu&#237;dos a esse grupo ter&#227;o privil&#233;gios de
administrador, ou seja, eles ter&#227;o acesso &#224; ferramenta <tt>asadmin</tt> e ao Console
de Administra&#231;&#227;o.</p>

<p>A p&#225;gina Usu&#225;rios Administrativos exibe uma lista de usu&#225;rios do realm selecionado.
Para cada usu&#225;rio, as seguintes informa&#231;&#245;es s&#227;o fornecidas:</p>

<dl><dt>ID do Usu&#225;rio</dt>
<dd><p>O nome de usu&#225;rio.</p>

</dd>
<dt>Lista de Grupos</dt>
<dd><p>Os grupos aos quais o usu&#225;rio pertence.</p>

</dd>
</dl>
<p>A tabela Usu&#225;rios Administrativos tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo usu&#225;rio.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais usu&#225;rios selecionados.</p>

</dd>
</dl>
<a name="gkomt"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-adminuserscreate.html">Para adicionar um usu&#225;rio ao realm administrativo</a></p>

</li>
<li><p><a href="task-adminusersedit.html">Para editar informa&#231;&#245;es do usu&#225;rio do realm administrativo</a></p>

</li>
<li><p><a href="task-adminusersdelete.html">Para excluir um usu&#225;rio do realm administrativo</a></p>

</li></ul>
<a name="gkonq"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-file-users-1"><tt>list-file-users</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-file-user-1"><tt>create-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-file-user-1"><tt>update-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-file-user-1"><tt>delete-file-user</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
