<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-monitoringservice"></a><h4>Servi&#231;o de Monitoramento</h4>
<a name="indexterm-242"></a><p>Use a p&#225;gina Servi&#231;o de Monitoramento para configurar as op&#231;&#245;es de monitoramento
para componentes ou servi&#231;os individuais.</p>

<p>&#201; preciso implementar um aplicativo, componente ou servi&#231;o, antes de configurar o
monitoramento para o mesmo.</p>

<p>A p&#225;gina Servi&#231;o de Monitoramento cont&#233;m estas op&#231;&#245;es:</p>

<dl><dt>Configuration Name</dt>
<dd><p>O nome da configura&#231;&#227;o para a qual as defini&#231;&#245;es nesta p&#225;gina se aplicam. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Monitoring Service</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Servi&#231;o de Monitoramento Ativado estiver selecionada, o monitoramento &#233; ativado para o Servidor GlassFish. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Monitoramento MBeans</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Monitoramento MBeans Ativado estiver selecionada, todos os MBeans necess&#225;rios para o monitoramento s&#227;o implementados no Servidor GlassFish. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

<p>Se a caixa de sele&#231;&#227;o n&#227;o estiver selecionada, n&#227;o &#233; poss&#237;vel exibir os dados de monitoramento no Console de Administra&#231;&#227;o, mesmo se a caixa de sele&#231;&#227;o Monitorando Servi&#231;o estiver selecionada.  Em vez disso, &#233; preciso usar a linha de comando para exibir os dados do monitoramento. Caso voc&#234; cancele a sele&#231;&#227;o da caixa de sele&#231;&#227;o, o per&#237;metro da mem&#243;ria do Servidor GlassFish &#233; reduzido. </p>

</dd>
<dt>DTrace</dt>
<dd><p>Se a caixa de sele&#231;&#227;o DTrace Ativado for selecionada, e se voc&#234; tem o Oracle Enterprise Manager DTrace Monitoring, poder&#225; usar o recurso DTrace do Solaris. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
</dl>
<p>Para cada componente dispon&#237;vel, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Componente</dt>
<dd><p>O nome do componente do Servidor GlassFish.</p>

</dd>
<dt>N&#237;vel de Monitoramento</dt>
<dd><p>O n&#237;vel de monitoramento definido pelo componente. Para componente, os n&#237;veis dispon&#237;veis s&#227;o BAIXO, ALTO e DESLIG. O n&#237;vel padr&#227;o &#233; DESLIG. N&#227;o h&#225; diferen&#231;as entre os n&#237;veis de monitoramento oferecidos pelas op&#231;&#245;es BAIXO e ALTO, nesta vers&#227;o. </p>

</dd>
</dl>
<p>A tabela Configura&#231;&#245;es do N&#237;vel do Componente tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Alterar N&#237;vel</dt>
<dd><p>Bot&#227;o para alterar o n&#237;vel de monitoramento para um ou mais componentes selecionados.</p>

</dd>
<dt>N&#237;vel</dt>
<dd><p>Lista suspensa a partir da qual &#233; poss&#237;vel selecionar um n&#237;vel de monitoramento a ser aplicado em todos os componentes selecionados.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-confmonitor.html">Para configurar o servi&#231;o de monitoramento</a></p>

</li>
<li><p><a href="task-appmonitoringdata.html">Para exibir dados de monitoramento do aplicativo</a></p>

</li>
<li><p><a href="task-servermonitoringdata.html">Para exibir dados de monitoramento do servidor</a></p>

</li>
<li><p><a href="task-resourcemonitoringdata.html">Para exibir dados de monitoramento do recurso</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-monitoring-1"><tt>enable-monitoring</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-monitoring-1"><tt>disable-monitoring</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=monitor-1"><tt>monitor</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
