<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfig"></a><h4>Seguran&#231;a de Mensagens</h4>
<a name="indexterm-228"></a><p>Use a p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens para exibir e modificar
as configura&#231;&#245;es dispon&#237;veis para provedores de seguran&#231;a de mensagens.</p>

<p>Para configurar a seguran&#231;a de mensagens, voc&#234; precisa de uma compreens&#227;o b&#225;sica
de conceitos de seguran&#231;a e de servi&#231;os da Web. Para obter mais
informa&#231;&#245;es, consulte o <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2435&id=ablrk">Cap&#237;tulo 3, Administering Message Security, no <i>Oracle GlassFish Server 3.1 Security Guide</i></a> e o <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=gbbjk">Cap&#237;tulo 6, Administering Web Applications, no <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>.</p>

<p>O Servidor GlassFish implementa a seguran&#231;a de mensagens usando provedores de seguran&#231;a
de mensagens integrados em sua camada de processamento SOAP. Os provedores de
seguran&#231;a de mensagens dependen de outros recursos de seguran&#231;a de Servidor GlassFish.</p>

<p>Para cada configura&#231;&#227;o, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Camada de Autentica&#231;&#227;o</dt>
<dd><p>A camada de mensagens na qual a autentica&#231;&#227;o &#233; realizada. Por padr&#227;o, uma configura&#231;&#227;o SOAP &#233; fornecida. Tamb&#233;m &#233; poss&#237;vel fornecer uma configura&#231;&#227;o HttpServlet.</p>

</dd>
<dt>Provedor Padr&#227;o</dt>
<dd><p>O provedor do servidor padr&#227;o desta configura&#231;&#227;o. Por padr&#227;o, nenhum provedor de servidor padr&#227;o est&#225; configurado.</p>

</dd>
<dt>Provedor de Cliente Padr&#227;o</dt>
<dd><p>O provedor de cliente padr&#227;o desta configura&#231;&#227;o. Por padr&#227;o, nenhum provedor de cliente padr&#227;o est&#225; configurado.</p>

</dd>
</dl>
<p>A tabela Configura&#231;&#227;o de Seguran&#231;a de Mensagens tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar uma nova configura&#231;&#227;o.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir uma ou mais configura&#231;&#245;es selecionadas.</p>

</dd>
</dl>
<a name="gkoky"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Servidor GlassFish para uso pelos provedores de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p>

</li></ul>
<a name="gkong"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>



<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
