<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-endpoint"></a><h4>Informa&#231;&#245;es do ponto final dos servi&#231;os Web</h4>
<a name="indexterm-169"></a><a name="indexterm-170"></a><a name="indexterm-171"></a><p>Usa a p&#225;gina Informa&#231;&#245;es do ponto final dos servi&#231;os Web para visualizar
informa&#231;&#245;es sobre um ponto final dos servi&#231;os Web.</p>

<p>A p&#225;gina Informa&#231;&#245;es do ponto final dos servi&#231;os Web, cont&#233;m as seguintes
informa&#231;&#245;es.</p>

<dl><dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo implementado. Clique neste link ou no bot&#227;o Voltar para retornar &#224; p&#225;gina Editar Aplicativo.</p>

<p>O nome pode incluir um identificador de vers&#227;o opcional, que segue o nome e &#233; separado do nome por dois pontos (<tt>:</tt>). Para obter mais informa&#231;&#245;es sobre vers&#245;es de aplicativos e m&#243;dulos, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions no <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Testador</dt>
<dd><p>O link do Testador &#233; vis&#237;vel se o Tipo de implementa&#231;&#227;o n&#227;o for RI (por exemplo, se for 109). Clique neste link para visualizar uma p&#225;gina que permite fornecer par&#226;metros para testar os m&#233;todos dos servi&#231;os Web.</p>

</dd>
<dt>WSDL</dt>
<dd><p>A Web Services Definition Language (WSDL) para o ponto final. Clique neste link para exibir a p&#225;gina WSDL em uma guia ou janela separada do navegador.</p>

<p>Observe que alguns navegadores da Web tentam interpretar a fonte da WSDL ao clicar no link WSDL e exibe uma p&#225;gina em branco. Em tais navegadores, utilize o comando Exibir fonte na p&#225;gina em branco para visualizar a fonte da WSDL.</p>

</dd>
<dt>Nome do ponto final</dt>
<dd><p>O nome do ponto final.</p>

</dd>
<dt>Nome do servi&#231;o</dt>
<dd><p>O nome do servi&#231;o Web.</p>

</dd>
<dt>Nome da porta</dt>
<dd><p>O nome da porta do servi&#231;o Web.</p>

</dd>
<dt>Tipo de implementa&#231;&#227;o</dt>
<dd><p>O tipo de implementa&#231;&#227;o para o servi&#231;o Web (por exemplo, RI ou 109).</p>

</dd>
<dt>Tipo de implementa&#231;&#227;o</dt>
<dd><p>O tipo de implementa&#231;&#227;o para o servi&#231;o Web (por exemplo, SERVLET ou EJB).</p>

</dd>
<dt>Nome da classe de implementa&#231;&#227;o</dt>
<dd><p>O nome da classe de implementa&#231;&#227;o do servi&#231;o Web.</p>

</dd>
<dt>URI do endere&#231;o do ponto final</dt>
<dd><p>O URI do endere&#231;o do ponto final.</p>

</dd>
<dt>Namespace</dt>
<dd><p>O namespace de destino associado com o servi&#231;o Web.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Descri&#231;&#227;o do ponto final, se houver um.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-endpoint.html">Para visualizar as informa&#231;&#245;es do ponto final para um servi&#231;o Web</a></p>

</li>
<li><p><a href="task-applistdeployed.html">Para exibir uma lista de aplicativos implantados</a></p>

</li>
<li><p><a href="task-appdeployweb.html">Para implantar um aplicativo Web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p>

</li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar um cliente de aplicativo</a></p>

</li>
<li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-apprestart.html">Para recarregar um aplicativo implantado</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
