<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-update"></a><h4>Atualiza&#231;&#245;es Dispon&#237;veis</h4>
<a name="indexterm-255"></a><p>A p&#225;gina Atualiza&#231;&#245;es Dispon&#237;veis fornece informa&#231;&#245;es sobre as vers&#245;es mais recentes dos
<a href="ref-uc-concepts.html#ref-uc-about-component">componentes</a> da <a href="ref-uc-concepts.html#ref-uc-about-repository">imagem de instala&#231;&#227;o</a> instalados.</p>

<p>Para instalar as atualiza&#231;&#245;es dispon&#237;veis, pare primeiro o dom&#237;nio do Servidor GlassFish.
A seguir, use um destes comandos:</p>


<ul><li><p><tt>glassfish3/bin/updatetool</tt>, que inicia o utilit&#225;rio gr&#225;fico da Ferramenta de atualiza&#231;&#227;o</p>

</li>
<li><p><tt>glassfish3/bin/pkg</tt>, a vers&#227;o de linha de comando da Ferramenta de atualiza&#231;&#227;o</p>

</li></ul>
<p>Para obter informa&#231;&#245;es sobre como utilizar o comando <tt>pkg</tt>, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=ghapp">Cap&#237;tulo 11, Extending and Updating GlassFish Server, no <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>. O
utilit&#225;rio Ferramenta de atualiza&#231;&#227;o tem sua pr&#243;pria ajuda on-line.</p>

<p>Reinicie o servidor ap&#243;s ter terminado de instalar as atualiza&#231;&#245;es.</p>

<p>A p&#225;gina Atualiza&#231;&#245;es Dispon&#237;veis cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Caminho da Instala&#231;&#227;o</dt>
<dd><p>O caminho do sistema de arquivos do diret&#243;rio raiz ou de n&#237;vel superior da imagem de instala&#231;&#227;o.</p>

</dd>
<dt>Atualiza&#231;&#245;es Dispon&#237;veis</dt>
<dd><p>Para cada componente para o qual uma nova vers&#227;o est&#225; dispon&#237;vel, esta tabela fornece as seguintes informa&#231;&#245;es:</p>

<dl><dt>Componente</dt>
<dd><p>O nome do componente.</p>

</dd>
<dt>Categoria</dt>
<dd><p>A categoria de software que &#233; associada ao componente; por exemplo, Servidores de Aplicativos, Ferramentas do Sistema e Bancos de Dados. A categoria &#233; atribu&#237;da pelo autor do componente quando o componente &#233; criado.</p>

</dd>
<dt>Vers&#227;o Instalada</dt>
<dd><p>O n&#250;mero de vers&#227;o do pacote em que o componente atual &#233; fornecido.</p>

</dd>
<dt>Nova Vers&#227;o</dt>
<dd><p>O n&#250;mero da vers&#227;o da atualiza&#231;&#227;o dispon&#237;vel.</p>

</dd>
<dt>Alterar</dt>
<dd><p>Diferen&#231;a de tamanho entre a vers&#227;o instalada e a atualiza&#231;&#227;o dispon&#237;vel.</p>

</dd>
<dt>Origem</dt>
<dd><p>O nome do <a href="ref-uc-concepts.html#ref-uc-about-repository">Reposit&#243;rio de rede</a> a partir do qual o componente deve ser obtido.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>
<p><a href="task-uc-update.html">Para exibir as atualiza&#231;&#245;es dispon&#237;veis para componentes </a></p>

<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>



<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
