<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-configurationsystemproperties"></a><h4>Propriedades do Sistema</h4>
<a name="indexterm-242"></a><a name="indexterm-243"></a><p>A p&#225;gina Propriedades do sistema exibe uma lista das propriedades do sistema
Java que est&#227;o definidas na configura&#231;&#227;o nomeada selecionada. As propriedades do sistema
Java s&#227;o transmitidas para o iniciador de aplicativo Java atrav&#233;s da op&#231;&#227;o
<tt>-D</tt> do iniciador de aplicativo Java quando o Servidor GlassFish &#233; iniciado</p>

<p>Estas propriedades definem os valores padr&#227;o das configura&#231;&#245;es da porta de todas
as inst&#226;ncias do Servidor GlassFish que fazem refer&#234;ncia &#224; configura&#231;&#227;o.</p>

<p>Para obter informa&#231;&#245;es sobre as configura&#231;&#245;es de porta predefinidas, consulte <a href="ref-predefinedconfigsysproperties.html">Propriedades Predefinidas do Sistema </a>.</p>

<p>S&#227;o exibidas as seguintes informa&#231;&#245;es para cada propriedade:</p>

<dl><dt>Nome da vari&#225;vel da inst&#226;ncia</dt>
<dd><p>Nome da propriedade do sistema.</p>

</dd>
<dt>Valor padr&#227;o</dt>
<dd><p>Valor definido para a propriedade na configura&#231;&#227;o nomeada que a inst&#226;ncia faz refer&#234;ncia. Este campo &#233; somente leitura.</p>

</dd>
<dt>Valores da inst&#226;ncia</dt>
<dd><p>Link para a p&#225;gina <a href="ref-sysinstancevalues.html">Valores da inst&#226;ncia</a> da propriedade.</p>

</dd>
</dl>
<p>A tabela Propriedades adicionais tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Adicionar propriedade</dt>
<dd><p>Bot&#227;o para adicionar uma propriedade. Se clicar neste bot&#227;o, uma linha &#233; adicionada &#224; tabela Propriedades adicionais.</p>

</dd>
<dt>Excluir propriedades</dt>
<dd><p>Bot&#227;o para excluir uma ou mais propriedades selecionadas. Qualquer propriedade exclu&#237;da volta ao seu valor padr&#227;o ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>

</dd>
</dl>
<p>A p&#225;gina Propriedades do sistema tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es:</p>

<dl><dt>Nome da configura&#231;&#227;o</dt>
<dd><p>Nome da configura&#231;&#227;o ao qual as configura&#231;&#245;es desta p&#225;gina ser&#227;o enviadas. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Reconfigura&#231;&#227;o din&#226;mica</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, s&#227;o aplicadas altera&#231;&#245;es na configura&#231;&#227;o das inst&#226;ncias que fazem refer&#234;ncia &#224; configura&#231;&#227;o sem a necessidade de reiniciar as inst&#226;ncias.</p>

</dd>
<dt>Clusters e/ou inst&#226;ncias que usam esta configura&#231;&#227;o</dt>
<dd><p>Lista dos clusters e das inst&#226;ncias que fazem refer&#234;ncia &#224; configura&#231;&#227;o com uma indica&#231;&#227;o de se cada cluster ou inst&#226;ncia est&#225; em execu&#231;&#227;o:</p>


<ul><li><p>Se o cluster estiver em execu&#231;&#227;o, uma marca de sele&#231;&#227;o (&#10003;) &#233; exibida.</p>

</li>
<li><p>Se a inst&#226;ncia ou o cluster estiver interrompido, um ponto de exclama&#231;&#227;o (<tt>!</tt>) &#233; exibido.</p>

</li></ul>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p>Para definir os valores padr&#227;o das propriedades de configura&#231;&#227;o</p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-system-properties-1"><tt>create-system-properties</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-system-property-1"><tt>delete-system-property</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-system-properties-1"><tt>list-system-properties</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
