<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref355" name="sthref355"></a>Defini&ccedil;&otilde;es de Log</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Defini&ccedil;&otilde;es do Logger para configurar o log do cluster ou inst&acirc;ncia selecionada do GlassFish Server.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es do Logger cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Gravar no Log do Sistema</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver selecionada, a sa&iacute;da do log ser&aacute; enviada ao recurso <code>syslog</code> al&eacute;m do log do servidor. Esse recurso est&aacute; dispon&iacute;vel apenas nos sistemas Solaris e Linux. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Arquivo de Log</dt>
<dd>
<p>Um nome alternativo ou local do arquivo do log do servidor. A localiza&ccedil;&atilde;o do default &eacute; <i>domain-dir</i><code>/logs/server.log</code>.</p>
</dd>
<dt>Log Handler</dt>
<dd>
<p>O nome da classe absoluta de um log handler personalizado. Um log handler personalizado permite que voc&ecirc; envie logs para um destino diferente de <code>server.log</code> ou <code>syslog</code>. O handler personalizado deve estender a classe <code>java.util.logging.Handler</code> (uma API compat&iacute;vel com JSR 047). Coloque a classe do handler no caminho da classe do GlassFish Server, para que o handler seja instalado durante a inicializa&ccedil;&atilde;o do servidor.</p>
</dd>
<dt>Limite de Rota&ccedil;&atilde;o de Arquivo</dt>
<dd>
<p>O tamanho em bytes que o arquivo do log do servidor deve alcan&ccedil;ar antes de ser rotacionado. Quando o log do servidor alcan&ccedil;ar o tamanho especificado, o GlassFish Server cria um novo arquivo vazio denominado<code>server.log</code> e renomeia o arquivo antigo <code>server.log_</code><i>data</i>, onde <i>data</i> &eacute; a data e a hora em que o arquivo foi rotacionado. O valor default &eacute; 2 megabytes. O valor m&iacute;nimo para o limite &eacute; de 500 quilobytes; se voc&ecirc; especificar um valor menor, o arquivo ser&aacute; rotacionado quando alcan&ccedil;ar 500 KB. Para desativar a rota&ccedil;&atilde;o de arquivos de log, defina o valor para 0.</p>
</dd>
<dt>Limite de Tempo de Rota&ccedil;&atilde;o de Arquivo</dt>
<dd>
<p>O n&uacute;mero de minutos ap&oacute;s o qual o log do servidor deve ser rotacionado. O valor default &eacute; 0, o que significa que o arquivo &eacute; rotacionado quando ele alcan&ccedil;a o tamanho especificado no campo Limite de Rota&ccedil;&atilde;o de Arquivo. Se voc&ecirc; especificar um ou mais minutos, o limite de tempo tem preced&ecirc;ncia sobre o limite de tamanho especificado pelo campo Limite de Rota&ccedil;&atilde;o de Arquivo.</p>
</dd>
<dt>Frequ&ecirc;ncia de Descarga</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de mensagens a serem escritas de cada vez da fila para o log do servidor. O valor default &eacute; 1.</p>
</dd>
</dl>
<a id="sthref356" name="sthref356"></a>
<h5>Tarefas relacionadas</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es de Log Gerais</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Para Configurar N&iacute;veis de Log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log para o DAS</a></p>
</li>
</ul>
<a id="sthref357" name="sthref357"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
