<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-lifecyclemodules"></a><h4>M&#243;dulos do Ciclo de Vida</h4>
<a name="indexterm-188"></a><p>Use a p&#225;gina M&#243;dulos do Ciclo de Vida para configurar os m&#243;dulos
do ciclo de vida.</p>

<p>Um m&#243;dulo do ciclo de vida realiza tarefas quando ele &#233; acionado
por um ou mais eventos no ciclo de vida do servidor. Os
poss&#237;veis eventos do servidor do disparador s&#227;o: inicializa&#231;&#227;o, pronto para solicita&#231;&#245;es de
servi&#231;o e desligamento. Os m&#243;dulos do ciclo de vida n&#227;o fazem parte
da especifica&#231;&#227;o Java EE, mas s&#227;o um aprimoramento do Servidor GlassFish.</p>

<p>Para cada m&#243;dulo do ciclo de vida, as informa&#231;&#245;es a seguir s&#227;o
fornecidas.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do m&#243;dulo do ciclo de vida.</p>

</dd>
<dt>Ativado ou status</dt>
<dd><p>Uma marca de sele&#231;&#227;o se o aplicativo estiver ativado ou um X se o aplicativo estiver desativado, somente se a inst&#226;ncia padr&#227;o do servidor ,<tt>server</tt>, existir.</p>

<p>Se os clusters ou outras inst&#226;ncias de servidores independentes existirem, selecione Ativado em Todos os destinos para visualizar os destinos nos quais o aplicativo est&#225; implantado.</p>

</dd>
<dt>Ordem de Carregamento</dt>
<dd><p>O valor que especifica a ordem relativa na qual o m&#243;dulo do ciclo de vida deveser carregado.</p>

</dd>
</dl>
<p>A tabela M&#243;dulos do Ciclo de Vida tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo m&#243;dulo do ciclo de vida.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais m&#243;dulos do ciclo de vida selecionados.</p>

</dd>
<dt>Ativar</dt>
<dd><p>Bot&#227;o para ativar um ou mais m&#243;dulos do ciclo de vida selecionados. Presente somente se a inst&#226;ncia padr&#227;o do servidor, <tt>server</tt>, existir.</p>

</dd>
<dt>Desativar</dt>
<dd><p>Bot&#227;o para desativar um ou mais m&#243;dulos do ciclo de vida selecionados. Presente somente se a inst&#226;ncia padr&#227;o do servidor, <tt>server</tt>, existir.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-lifecyclemodulenew.html">Para criar um m&#243;dulo do ciclo de vida</a></p>

</li>
<li><p><a href="task-lifecyclemoduleedit.html">Para editar um m&#243;dulo do ciclo de vida</a></p>

</li>
<li><p><a href="task-lifecyclemoduledelete.html">Para excluir um m&#243;dulo do ciclo de vida</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-lifecycle-module-1"><tt>create-lifecycle-module</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-lifecycle-modules-1"><tt>list-lifecycle-modules</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-lifecycle-module-1"><tt>delete-lifecycle-module</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
