<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-lifecyclemoduleedit" name="task-lifecyclemoduleedit"></a><a id="GHCOM00170" name="GHCOM00170"></a></p>

<h4><a id="sthref106" name="sthref106"></a>Para Editar um M&oacute;dulo de Ciclo de Vida</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; M&oacute;dulos do Ciclo de Vida.</p>
<p>A p&aacute;gina M&oacute;dulos do Ciclo de Vida &eacute; exibida.</p>
</li>
<li>
<p>Na p&aacute;gina M&oacute;dulos do Ciclo de Vida, clique no nome do m&oacute;dulo do ciclo de vida a ser editado.</p>
<p>A p&aacute;gina Editar M&oacute;dulo do Ciclo de Vida &eacute; aberta.</p>
</li>
<li>
<p>No campo Nome da Classe, digite o nome totalmente qualificado do arquivo de classe do m&oacute;dulo do ciclo de vida.</p>
<p>A classe deve implementar a interface <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</li>
<li>
<p>No campo Caminho da classe, digite o caminho da classe do m&oacute;dulo do ciclo de vida.</p>
<p>O caminho da classe especifica onde o m&oacute;dulo do ciclo de vida est&aacute; localizado. O valor default &eacute; <i>domain-dir</i><code>/applications</code>. Se o m&oacute;dulo j&aacute; estiver neste diret&oacute;rio (isto &eacute;, no caminho da classe do servidor), esse campo poder&aacute; ser deixado em branco.</p>
</li>
<li>
<p>No campo Ordem de Carregamento, digite um valor especificando a ordem na qual esse m&oacute;dulo do ciclo de vida deve ser carregado na inicializa&ccedil;&atilde;o.</p>
<p>Os m&oacute;dulos com valores inteiros menores de ordem de carregamento s&atilde;o carregados antes. O valor pode variar de 101 at&eacute; o <code>MAXINT</code> do sistema operacional. Valores de 1 a 100 s&atilde;o reservados.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do m&oacute;dulo do ciclo de vida.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o m&oacute;dulo do ciclo de vida.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Inicializa&ccedil;&atilde;o de Inst&acirc;ncia de Preven&ccedil;&atilde;o de Falha de Carregamento para especificar que o servidor seja submetido a shutdown em caso de falha do carregamento do m&oacute;dulo do ciclo de vida.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>A guia Destinos aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem. Selecione a guia Destinos para exibir os destinos nos quais o m&oacute;dulo do ciclo de vida foi ativado. Consulte <a href="task-appviewtargets.html">Para visualizar destinos da aplica&ccedil;&atilde;o</a> para ver instru&ccedil;&otilde;es sobre como ativar ou desativar um m&oacute;dulo de ciclo de vida em um ou v&aacute;rios alvos.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref107" name="sthref107"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Para Criar um M&oacute;dulo de Ciclo de Vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Para Deletar um M&oacute;dulo de Ciclo de Vida</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
