<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-installed-remove" name="task-uc-installed-remove"></a><a id="GHCOM00216" name="GHCOM00216"></a></p>

<h4><a id="sthref215" name="sthref215"></a>Para Exibir Componentes Instalados</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina de Componentes Instalados fornece informa&ccedil;&otilde;es sobre componentes da imagem de instala&ccedil;&atilde;o que ainda n&atilde;o foi instalada.</p>
<p>A desinstala&ccedil;&atilde;o de um componente envolve a remo&ccedil;&atilde;o dos seguintes itens:</p>
<ul>
<li>
<p>Todos os arquivos e diret&oacute;rios introduzidos pela instala&ccedil;&atilde;o original do componente</p>
</li>
<li>
<p>Todos os arquivos e diret&oacute;rios introduzidos por atualiza&ccedil;&otilde;es do componente, depois da instala&ccedil;&atilde;o original</p>
</li>
</ul>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Ferramenta de Atualiza&ccedil;&atilde;o.</p>
<p>&Eacute; aberta a p&aacute;gina Add-ons Dispon&iacute;veis.</p>
</li>
<li>
<p>Na p&aacute;gina Add-ons Dispon&iacute;veis, clique na guia Componentes Instalados.</p>
<p>A p&aacute;gina Componentes Instalado &eacute; exibida.</p>
</li>
</ol>
<a id="sthref216" name="sthref216"></a>
<h5>Pr&oacute;ximas Etapas</h5>
<p>Para desinstalar qualquer componente instalado, pare primeiro o dom&iacute;nio do GlassFish Server. A seguir, use um destes comandos:</p>
<ul>
<li>
<p><i>as-install-parent</i><code>/bin/updatetool</code>, que come&ccedil;a com o recurso gr&aacute;fico da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
<li>
<p><i>as-install-parent</i><code>/bin/pkg</code>, uma vers&atilde;o da linha de comandos da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
</ul>
<p>Para obter mais informa&ccedil;&otilde;es sobre o uso do comando <code>pkg</code>, consulte o <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, <i>Extending and Updating GlassFish Server,</i> no <i>Oracle GlassFish Server Administration Guide</i></a>. O utilit&aacute;rio Ferramenta de Atualiza&ccedil;&atilde;o tem sua pr&oacute;pria ajuda on-line.</p>
<p>Reinicie o servidor ap&oacute;s ter finalizado a desinstala&ccedil;&atilde;o dos componentes.</p>
<a id="sthref217" name="sthref217"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Para Exibir Atualiza&ccedil;&otilde;es Dispon&iacute;veis para Componentes</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">Para Instalar Componentes Add-On</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Para Exibir Informa&ccedil;&otilde;es Detalhadas sobre um Componente</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Para Configurar Defini&ccedil;&otilde;es do Proxy de Rede para Acessar Reposit&oacute;rios da Rede</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
