<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appviewtargets"></a><h3>Para visualizar destinos do aplicativo</h3><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Aplicativos.</b><p>A p&#225;gina Aplicativos &#233; exibida.</p></li>
<li><b>Selecione um aplicativo do qual deseja visualizar os destinos.</b><p>O nome do aplicativo pode incluir um identificador de vers&#227;o opcional, que
segue o nome e &#233; separado do nome por dois pontos (<tt>:</tt>).
Para obter mais informa&#231;&#245;es sobre vers&#245;es de aplicativos e m&#243;dulos, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions no <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p><p>A p&#225;gina do aplicativo se abre.</p></li>
<li><b>Selecione a guia Destino.</b><p>A p&#225;gina Destinos do aplicativo se abre e os destinos atualmente especificados
para o aplicativo s&#227;o exibidos.</p></li>
<li><b>Para ativar ou desativar um aplicativo em uma inst&#226;ncia ou cluster de
destino espec&#237;fico, clique na caixa de sele&#231;&#227;o ao lado do destino e
selecione Ativar ou Desativar no menu suspenso A&#231;&#245;es.</b></li>
<li><b>Para ativar o balanceamento de carga de um destino em uma inst&#226;ncia
ou cluster de destino espec&#237;fico, clique na caixa de sele&#231;&#227;o ao lado
do destino e selecione Ativar balanceador de carga ou Desativar balanceador de
carga no menu suspenso Mais a&#231;&#245;es.</b></li>
<li><b>Para associar um aplicativo a servidores virtuais espec&#237;ficos, selecione Gerenciar servidores virtuais
na inst&#226;ncia ou cluster de destino.</b><p>A p&#225;gina Destinos de servidor virtual &#233; exibida.</p><p>Para adicionar servidores virtuais de destino, selecione-os na lista Destinos dispon&#237;veis e
utilize o bot&#227;o Adicionar para mov&#234;-los para a lista Destinos selecionados.</p><p>Por padr&#227;o, o m&#243;dulo ou aplicativo est&#225; associado ao servidor virtual padr&#227;o,
denominado <tt>server</tt>. Utilize a bot&#227;o Adicionar tudo para adicionar todos os destinos.
Utilize os bot&#245;es Remover e Remover tudo para remover os destinos da
lista Destinos selecionados.</p><p>Selecione Salvar para voltar &#224; p&#225;gina Destinos do aplicativo.</p></li>
<li><b>Para adicionar ou excluir inst&#226;ncias ou clusters de destino do aplicativo, selecione
Gerenciar destinos.</b><p>A p&#225;gina Gerenciar destinos &#233; exibida.</p><p>Para adicionar destinos, selecione-os na lista Destinos dispon&#237;veis e utilize o bot&#227;o
Adicionar para mov&#234;-los para a lista Destinos selecionados.</p><p>Utilize a bot&#227;o Adicionar tudo para adicionar todos os destinos. Utilize os
bot&#245;es Remover e Remover tudo para remover os destinos da lista Destinos
selecionados.</p><p>Selecione Salvar para voltar &#224; p&#225;gina Destinos do aplicativo.</p></li>
<li><b>Clique em Salvar.</b><p>O aplicativo est&#225; agora dispon&#237;vel na lista de destinos alterada.</p></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p>

</li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
