<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-installed-remove"></a><h4>Para exibir os componentes instalados</h4><a name="indexterm-123"></a><p>A p&#225;gina Componentes Instalados fornece informa&#231;&#245;es sobre os <a href="ref-uc-concepts.html#ref-uc-about-component">componentes</a> da <a href="ref-uc-concepts.html#ref-uc-about-repository">imagem de instala&#231;&#227;o</a> instalados.</p>

<p>A desinstala&#231;&#227;o de um <a href="ref-uc-concepts.html#ref-uc-about-component"> componente</a> envolve a remo&#231;&#227;o dos seguintes itens:</p>


<ul><li><p>Todos os arquivos e diret&#243;rios introduzidos pela instala&#231;&#227;o original do componente</p>

</li>
<li><p>Todos os arquivos e diret&#243;rios introduzidos por atualiza&#231;&#245;es do componente, depois da instala&#231;&#227;o original</p>

</li></ul>
<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Ferramenta de atualiza&#231;&#227;o.</b><p>&#201; aberta a p&#225;gina Complementos Dispon&#237;veis.</p></li>
<li><b>Na p&#225;gina Complementos Dispon&#237;veis, clique na guia Componentes Instalados.</b><p>A p&#225;gina Componentes Instalado &#233; exibida.</p></li></ol><h6>Passos Seguintes</h6><p>Para desinstalar qualquer componente instalado, pare primeiro o dom&#237;nio do Servidor GlassFish.
A seguir, use um destes comandos:</p>


<ul><li><p><tt><i>as-install-parent</i>/bin/updatetool</tt>, que inicia o utilit&#225;rio gr&#225;fico da Ferramenta de atualiza&#231;&#227;o</p>

</li>
<li><p><tt><i>as-install-parent</i>/bin/pkg</tt>, a vers&#227;o de linha de comando da Ferramenta de atualiza&#231;&#227;o</p>

</li></ul>
<p>Para obter informa&#231;&#245;es sobre como utilizar o comando <tt>pkg</tt>, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=ghapp">Cap&#237;tulo 11, Extending and Updating GlassFish Server, no <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>. O
utilit&#225;rio Ferramenta de atualiza&#231;&#227;o tem sua pr&#243;pria ajuda on-line.</p>

<p>Reinicie o servidor ap&#243;s ter terminado de desinstalar os componentes.</p>

<h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-uc-update.html">Para exibir as atualiza&#231;&#245;es dispon&#237;veis para componentes </a></p>

</li>
<li><p><a href="task-uc-addon.html">Para instalar componentes complementares</a></p>

</li>
<li><p><a href="task-uc-pkgdetails.html">Para exibir informa&#231;&#245;es detalhadas sobre um componente</a></p>

</li>
<li><p><a href="task-uc-set-proxy.html">Para definir configura&#231;&#245;es de proxy de rede para acessar reposit&#243;rios de rede</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
