<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfigdelete"></a><h4>Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</h4><a name="indexterm-109"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Selecione o n&#243; Seguran&#231;a de Mensagens.</b><p>A p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens, marque a caixa de sele&#231;&#227;o
&#224; esquerda da Configura&#231;&#227;o de Seguran&#231;a de Mensagens que voc&#234; est&#225; excluindo.</b>
<hr><p><b>Observa&#231;&#227;o - </b>&#201; poss&#237;vel criar ou excluir os provedores de seguran&#231;a de mensagens da
configura&#231;&#227;o <tt>server-config</tt> padr&#227;o. Os &#250;nicos provedores de seguran&#231;a de mensagem que s&#227;o
suportados no <tt>server-config</tt> padr&#227;o s&#227;o SOAP e HttpServlet. Como estes dois provedores
de mensagem j&#225; s&#227;o criados por padr&#227;o quando o Servidor GlassFish &#233;
instalado, o bot&#227;o Excluir n&#227;o &#233; exibido na p&#225;gina Configura&#231;&#245;es de seguran&#231;a
de mensagens no <tt>server-config</tt> padr&#227;o.</p>


<hr>
</li>
<li><b>Clique em Excluir.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Servidor GlassFish para uso pelos provedores de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p>

</li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
