<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-confmonitor"></a><h3>Para configurar o servi&#231;o de monitoramento</h3><a name="indexterm-119"></a><ol>
<li><b>No n&#243; Configura&#231;&#245;es, expanda a configura&#231;&#227;o de cluster ou inst&#226;ncia de servidor
na qual deseja configurar o monitoramento.</b></li>
<li><b>Expanda o n&#243; Monitoramento.</b><p>A p&#225;gina Servi&#231;o de Monitoramento &#233; exibida.</p></li>
<li><b>Selecione a caixa de sele&#231;&#227;o Servi&#231;o de Monitoramento Ativado, para ativar o
monitoramento para o Servidor GlassFish, ou cancele a sele&#231;&#227;o da caixa de
sele&#231;&#227;o para desativar o monitoramento.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>Selecione a caixa de sele&#231;&#227;o Monitoramento MBeans Ativado, para implementar todos os
MBeans necess&#225;rios para o monitoramento, ou cancele a sele&#231;&#227;o da caixa de
sele&#231;&#227;o para desimplementar estes MBeans.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p><p>Se a caixa de sele&#231;&#227;o n&#227;o estiver selecionada, n&#227;o &#233; poss&#237;vel exibir
os dados de monitoramento no Console de Administra&#231;&#227;o, mesmo se a caixa
de sele&#231;&#227;o Monitorando Servi&#231;o estiver selecionada.  Em vez disso, &#233; preciso usar
a linha de comando para exibir os dados do monitoramento. Caso voc&#234;
cancele a sele&#231;&#227;o da caixa de sele&#231;&#227;o, o per&#237;metro da mem&#243;ria do
Servidor GlassFish &#233; reduzido.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o DTrace Ativado para habilitar o aplicativo DTrace
do Solaris.</b><p>Para poder usar o recurso DTrace do Solaris, &#233; preciso tamb&#233;m ter
o Oracle Enterprise Manager DTrace Monitoring. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Na tabela, realize uma das seguintes a&#231;&#245;es:</b><ul>
<li><b>Na coluna N&#237;vel de Monitoramento, selecione BAIXO ou ALTO na lista suspensa,
para um ou mais componentes na coluna Componente, para ativar o monitoramento
para esses componentes.</b></li>
<li><b>Marque as caixas de sele&#231;&#227;o ao lado de um ou mais componentes,
depois selecione BAIXO ou ALTO na lista suspensa N&#237;vel na parte superior
da tabela e clique no bot&#227;o Alterar N&#237;vel, para definir o n&#237;vel
de monitoramento para aquele valor , para todos esses componentes.</b></li></ul><p>N&#227;o h&#225; diferen&#231;as entre os n&#237;veis de monitoramento oferecidos pelas op&#231;&#245;es BAIXO
e ALTO, nesta vers&#227;o.  Para desativar o monitoramento de um ou
mais componentes, selecione DESLIG. O valor padr&#227;o &#233; DESLIG.</p><p>&#201; preciso implementar um aplicativo, componente ou servi&#231;o, antes de configurar o
monitoramento para o mesmo.</p></li>
<li><b>Clique em Salvar.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-appmonitoringdata.html">Para exibir dados de monitoramento do aplicativo</a></p>

</li>
<li><p><a href="task-servermonitoringdata.html">Para exibir dados de monitoramento do servidor</a></p>

</li>
<li><p><a href="task-resourcemonitoringdata.html">Para exibir dados de monitoramento do recurso</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
