<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-endpoint"></a><h4>Para visualizar as informa&#231;&#245;es do ponto final para um servi&#231;o Web</h4><a name="indexterm-47"></a><a name="indexterm-48"></a><a name="indexterm-49"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Aplicativos.</b><p>A p&#225;gina Aplicativos &#233; exibida.</p></li>
<li><b>Na p&#225;gina Aplicativos, clique no nome do servi&#231;o Web cujas informa&#231;&#245;es do
ponto final voc&#234; est&#225; exibindo.</b><p>O nome pode incluir um identificador de vers&#227;o opcional, que segue o
nome e &#233; separado do nome por dois pontos (<tt>:</tt>). Para obter
mais informa&#231;&#245;es sobre vers&#245;es de aplicativos e m&#243;dulos, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions no <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p><p>A p&#225;gina Editar aplicativo &#233; exibida.</p></li>
<li><b>Na tabela M&#243;dulos e componentes, clique no link Exibir ponto final para
o subcomponente.</b><p>A p&#225;gina Informa&#231;&#245;es do Ponto Final dos Servi&#231;os Web &#233; exibida.</p></li>
<li><b>Se o link do Testador estiver vis&#237;vel, clique neste link para visualizar uma
p&#225;gina que permite fornecer par&#226;metros para testar os m&#233;todos dos servi&#231;os Web.</b><p>O link do Testador &#233; vis&#237;vel se o Tipo de implementa&#231;&#227;o n&#227;o
for RI (por exemplo, se for 109). A p&#225;gina Testador &#233; aberta
em uma nova janela ou guia do navegador.</p></li>
<li><b>Clique no link WSDL para visualizar o arquivo Web Services Definition Language (WSDL)
do ponto final.</b><p>O arquivo WSDL &#233; aberto em uma nova janela ou guia do
navegador.</p><p>Observe que alguns navegadores da Web tentam interpretar a fonte da WSDL
ao clicar no link WSDL e exibe uma p&#225;gina em branco. Em
tais navegadores, utilize o comando Exibir fonte na p&#225;gina em branco para
visualizar a fonte da WSDL.</p></li>
<li><b>Clique no link Nome do Aplicativo ou no bot&#227;o Voltar para retornar &#224;
p&#225;gina Editar Aplicativo.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-applistdeployed.html">Para exibir uma lista de aplicativos implantados</a></p>

</li>
<li><p><a href="task-appdeployweb.html">Para implantar um aplicativo Web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p>

</li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p>

</li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Para iniciar um cliente de aplicativo</a></p>

</li>
<li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p>

</li>
<li><p><a href="task-apprestart.html">Para recarregar um aplicativo implantado</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
