<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovidernew"></a><h4>Para criar um provedor de JACC</h4><a name="indexterm-101"></a><a name="indexterm-102"></a><a name="indexterm-103"></a><p>Utilize a p&#225;gina Novo provedor de JACC para criar um novo Java
Authorization Contract for Containers (JACC) compat&#237;vel com o JSR-115/196 que possa ser
utilizado por m&#243;dulos de autoriza&#231;&#227;o de terceiros em aplicativos em execu&#231;&#227;o no
Servidor GlassFish da . O provedor de JACC &#233; criado como um
elemento <tt>jacc-provider</tt> dentro do elemento <tt>security-service</tt> no arquivo <tt> domain.xml</tt> do dom&#237;nio.</p>

<p>A instala&#231;&#227;o padr&#227;o do Servidor GlassFish da  inclui dois provedores de
JACC, denominados <tt>default</tt> e <tt>simple </tt>. Todos os novos provedores JACC criados s&#227;o
somados a estes dois provedores padr&#227;o. Os provedores de JACC padr&#227;o do
Servidor GlassFish da  implementam um mecanismo simples de autoriza&#231;&#227;o com base
em arquivo que cumpre com a especifica&#231;&#227;o do JACC.</p>

<p>Para obter informa&#231;&#245;es sobre como gravar as classes de implementa&#231;&#227;o do provedor
de JACC, consulte a especifica&#231;&#227;o JACC em <a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a>.</p>

<ol>
<li><b>No n&#243; Configura&#231;&#245;es da &#225;rvore de navega&#231;&#227;o, expanda a inst&#226;ncia ou cluster
do Servidor GlassFish da  para o qual deseja criar um provedor
JACC.</b><p>Para criar um provedor que estar&#225; dispon&#237;vel para todas as inst&#226;ncias e
clusters, selecione o n&#243; <tt>default-config</tt>.</p></li>
<li><b>No n&#243; de configura&#231;&#227;o da inst&#226;ncia ou cluster, expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Sob o n&#243; Seguran&#231;a, selecione o n&#243; Provedores de JACC.</b><p>A p&#225;gina Provedores de JACC &#233; exibida.</p></li>
<li><b>Na p&#225;gina Provedores de JACC, clique em Novo.</b><p>A p&#225;gina Novo Provedor de JACC &#233; exibida.</p></li>
<li><b>Na p&#225;gina Novo Provedor de JACC, no campo Nome, digite o nome
que ir&#225; identificar este provedor.</b><p>Este nome &#233; utilizado para fazer refer&#234;ncia ao elemento <tt>jacc-provider</tt> no <tt>domain.xml</tt>.</p></li>
<li><b>No campo Configura&#231;&#227;o da Diretiva, digite o nome da classe que implementa
a f&#225;brica de configura&#231;&#245;es de diretivas.</b><p>O provedor <tt>padr&#227;o </tt>usa <tt>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl </tt>. O provedor <tt>simples</tt> usa <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory </tt>.</p></li>
<li><b>No campo Provedor de Diretiva, digite o nome da classe que implementa
a f&#225;brica de diretivas.</b><p>O provedor <tt>padr&#227;o </tt>usa <tt>com.sun.enterprise.security.provider.PolicyWrapper</tt>. O provedor <tt>simples</tt> usa <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider </tt>.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>Para obter uma descri&#231;&#227;o das propriedades adicionais dispon&#237;veis para provedores de JACC,
consulte <a href="ref-jaccproviderprop.html">Propriedades espec&#237;ficas de provedores de JACC</a>.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jaccprovideredit.html">Para editar um provedor de JACC</a></p>

</li>
<li><p><a href="task-jaccproviderdelete.html">Para excluir um provedor de JACC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
