<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-logging-max-logfiles"></a><h4>Para alterar o n&#250;mero limite de arquivos do log rotacionados</h4><a name="indexterm-70"></a><a name="indexterm-71"></a><a name="indexterm-72"></a><p>Quando o Servidor GlassFish gira um arquivo do log, ele cria um
arquivo novo e vazio denominado <tt>server.log</tt> e renomeia o arquivo antigo <tt>server.log_ </tt><i>date</i>,
onde <i>date</i> &#233; a data e a hora em que o arquivo
foi rotacionado.</p>

<p>Por padr&#227;o, o Servidor GlassFish limita o n&#250;mero de arquivos do log
rotacionados para 10. Quando esse limite for alcan&#231;ado, o arquivo do log
mais antigo ser&#225; exclu&#237;do da pr&#243;xima vez em que o Servidor GlassFish
girar um arquivo de registro.</p>

<p>Se necess&#225;rio, &#233; poss&#237;vel alterar o n&#250;mero limite de arquivos do log
rotacionados. Os novos limites definidos se aplicam aos arquivos do log rotacionados
do registro de acesso e do servidor.</p>

<ul>
<li><b>Defina a propriedade do sistema <tt>com.sun.enterprise.server.logging.max_history_files </tt> para o n&#250;mero m&#225;ximo de arquivos
do log a serem mantidos.</b><p>Para obter informa&#231;&#245;es sobre como definir uma propriedade do sistema, consulte <a href="task-systemproperties.html">Para gerenciar propriedades do sistema</a>.</p><p>O comportamento da propriedade do sistema <tt>com.sun.enterprise.server.logging.max_history_files </tt> &#233; apresentado a seguir:</p>
<ul><li><p>Se a propriedade n&#227;o estiver definida, o Servidor GlassFish mant&#233;m um n&#250;mero m&#225;ximo de 10 arquivos do log rotacionados.</p>

</li>
<li><p>Se a propriedade estiver definida como um n&#250;mero inv&#225;lido ou nulo, o Servidor GlassFish mant&#233;m um n&#250;mero m&#225;ximo de 10 arquivos do log rotacionados.</p>

</li>
<li><p>Se a propriedade estiver definida como 0, o Servidor GlassFish n&#227;o mant&#233;m arquivos do log rotacionados.</p>

</li></ul>
</li></ul><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-eelogging.html">Para definir as configura&#231;&#245;es gerais de log</a></p>

</li>
<li><p><a href="task-eelogginglevels.html">Para configurar n&#237;veis de log</a></p>

</li>
<li><p><a href="task-logviewer.html">Para visualizar os arquivos de log do DAS</a></p>

</li>
<li><p><a href="task-logging-collectlogfiles.html">Para criar um arquivo ZIP de todos os arquivos de log</a></p>

</li>
<li><p><a href="task-systemproperties.html">Para gerenciar propriedades do sistema</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
