#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

AgentPortInUse=El puerto del agente de nodo {0} est\u00e1 en uso.
tooManyNodes=M\u00e1s de un nodo en el directorio {0}. Especifique el --nodo.
cantCreateNodeDirChild=Error al intentar crear este directorio de nodo: {0}
cantGetHostName=Se ha detectado una excepci\u00f3n al intentar obtener el nombre de host del equipo: {0}
noInstallDirPath=No se puede encontrar la ruta del directorio de instalaci\u00f3n de GlassFish.
Agent.noInstallDir=No se puede encontrar el directorio de instalaci\u00f3n de GlassFish.  Estaba buscando esta ruta: {0}
ConfigClusterConflict=Solamente puede especificar un cl\u00faster o configuraci\u00f3n.
lbenabledNotForStandaloneInstance=La opci\u00f3n lbenabled no es compatible con instancias independientes.
Instance.badNodeDir=El directorio del nodo {0} no existe o no es un directorio
Instance.badInstanceDir=El directorio de la instancia del servidor {0} no existe o no es un directorio
Instance.invalidAgentPort=Puerto de agente no v\u00e1lido {0}. Especifique un puerto de agente v\u00e1lido entre 1 y 65535.
Instance.noInstanceDirs=No existe ning\u00fan directorio de instancias en {0}
Instance.tooManyInstanceDirs=Existe m\u00e1s de una instancia del servidor en el directorio {0}
Instance.badInstanceName=Debe proporcionar el nombre de la instancia.
Instance.cantReadDasProperties=No se puede leer {0}
Instance.cantWriteProperties=No se puede escribir {0}: {1}
Instance.dasPropertyComment=Propiedades de conexi\u00f3n del servidor de administraci\u00f3n de dominios
Instance.nodeagentPropertiesComment=Propiedades de conexi\u00f3n de los agentes del nodo
Instance.unknownHost=No se pudo determinar el host.  Cree el directorio del nombre de host como nodos/host local.
Instance.nosync=Omitiendo sincronizaci\u00f3n con el DAS.
Instance.nodomainxml=CLI810 Se ha producido un error en la sincronizaci\u00f3n con el DAS y ning\u00fan domain.xml,\nlocal puede iniciar la instancia.
Instance.syncFailed=Advertencia: se ha producido un error en la sincronizaci\u00f3n con el DAS, continuando el inicio...
Instance.fullsync=Eliminando todo el estado almacenado en la cach\u00e9 para la instancia {0}.
Instance.rendezvousAttempt=Intentando establecer un encuentro con el DAS en {0}:{1}
Instance.rendezvousAlready={0} ya est\u00e1 registrado en el DAS.
Instance.rendezvousFailed=Se ha producido un error al establecer un encuentro con el DAS en {0}:{1}. Compruebe que el servidor se est\u00e9 ejecutando, que el host y el puerto sean correctos y que el servidor est\u00e9 configurado para permitir el acceso remoto.
Instance.rendezvousSuccess=Se ha establecido un encuentro con el DAS en {0}:{1}.
Instance.oldDasProperties=El archivo das.properties en {0}\nes probablemente de una versi\u00f3n anterior pero utiliza el puerto est\u00e1ndar {1},\nlo actualizar\u00e1 para utilizar el puerto {2} - compruebe que \u00e9ste sea correcto
Instance.oldDasPropertiesWrong=El archivo das.properties en {0}\nes probablemente de una versi\u00f3n anterior y utiliza el puerto no est\u00e1ndar {1},\nlo actualizar\u00e1 para utilizar el puerto {2} - probablemente \u00e9ste es incorrecto
Instance.oldDasPropertiesPrompt=El archivo das.properties en {0}\nes probablemente de una versi\u00f3n anterior y utiliza el puerto no est\u00e1ndar {1} \nIntroduzca el n\u00famero de puerto de administraci\u00f3n del DAS [default:{2}] > 
Instance.dasPropertiesUpdateFailed=CLI811 Advertencia: se ha producido un error al actualizar el archivo das.properties
Instance.badProtocol=CLI812 El archivo das.properties en {0}\nespecifica un protocolo desconocido: {1}
Instance.reenterPort=N\u00famero de puerto incorrecto, vuelva a escribir el n\u00famero de puerto de administraci\u00f3n del DAS [default:{0}] >
Instance.existingDasPropertiesWarning=Utilizando el host de DAS {0} y el puerto {1} del archivo das.properties existente para el nodo\n{2}. Para utilizar un DAS diferente, cree un nodo nuevo mediante create-node-ssh o\ncreate-node-config. Cree la instancia con el nodo nuevo y el\nhost y puerto correctos:\nasadmin --host das_host --port das_port create-local-instance --node node_name instance_name.
Instance.DasHostUnknown=El nombre del host del DAS, {0}, no es conocido para el host de la instancia {1}. Esto puede deberse a que el host del DAS se conoce con otro nombre en {1} o porque el nombre de host del DAS debe estar completamente cualificado con un nombre de dominio. Para corregirlo, aseg\u00farese de que el sistema en que se ejecuta el DAS pueda identificarse con un nombre completamente cualificado (en sistemas Unix se suele realizar agregando un nombre de host completamente cualificado en /etc/hosts). Si el host del DAS se conoce con un nombre distinto, deber\u00e1 cambiar la direcci\u00f3n de red de la escucha HTTP de administraci\u00f3n del DAS.
Instance.DasHostUnreachable=No se pudo establecer la conexi\u00f3n con el DAS ejecut\u00e1ndose en {0}:{1}.  Esto puede deberse a que un servidor de seguridad est\u00e1 bloqueando la reconexi\u00f3n al DAS o porque el host del DAS se identifica con un nombre distinto en el host de la instancia {2}.  Para cambiar el nombre de host que utiliza el DAS para identificarse, actualice la direcci\u00f3n de red de la escucha HTTP de administraci\u00f3n del DAS.
Instance.DasHostInvalid=El host del DAS {0} no coincide con el host del DAS utilizado por el nodo {1}.
Instance.DasPortInvalid=El puerto del DAS {0} no coincide con el host del DAS utilizado por el nodo {1}.
Instance.DasIsSecureInvalid=El indicador seguro del DAS del nodo {0} no coincide con el indicador seguro del DAS utilizado por el nodo {1}.
Instance.DasConfig=El nodo {0} est\u00e1 configurado para conectarse al DAS en {1}:{2} con = {3} seguro.
create.local.instance.usagetext=create-local-instance\n\t[--config <config> | --cluster <cluster>]\n\t[--lbenabled[=<lbenabled>]]\n\t[--systemproperties <systemproperties>] [--portbase <portbase>]\n\t[--checkports[=<checkports(default:true)>]]\n\t[--savemasterpassword[=<savemasterpassword(default:false)>]]\n\t[--nodedir <nodedir>] [--node <node>]\n\t[-?|--help[=<help(default:false)>]] instance_name
Instance.alreadyExists=En la configuraci\u00f3n ya existe una instancia del servidor denominada "{0}"
masterPasswordFileNotCreated=Error al crear el archivo de contrase\u00f1as maestras {0}
fileNotFound=No se encuentra el archivo {0}.
MasterPassword=la contrase\u00f1a maestra
masterPasswordIncorrect=Contrase\u00f1a maestra incorrecta.   Contrase\u00f1a maestra no guardada.
Keystore.not.encrypted=Error al cifrar el almac\u00e9n de claves
###########
StopInstance.noInstanceNameAllowed=No hay ning\u00fan nombre de instancia permitido con la opci\u00f3n --host.
StopInstance.instanceNotRunning=CLI1306 Advertencia: la instancia del servidor no se est\u00e1 ejecutando.
Instance.noSuchInstance=CLI1307 Advertencia: no se ha encontrado ninguna instancia del servidor con ese nombre.
StopInstance.waitForDeath=Esperando a que se detenga la instancia
StopInstance.instanceNotDead=Se ha agotado el tiempo ({0} segundos) de espera para que se detenga el dominio.
## SynchronizeInstanceCommand
Sync.noDASConfigured=CLI800 Falta el archivo das.properties, se esperaba que estuviera aqu\u00ed: {0}
Sync.alreadySynced=CLI801 La instancia ya est\u00e1 sincronizada
Sync.dirFailed=CLI802 Se ha producido un error de sincronizaci\u00f3n del directorio {0}, causado por:\n  {1}
Sync.failed=CLI803 Se ha producido un error al sincronizar con el DAS en el puerto {1} del host {0}
Sync.cantCreateSyncState=Advertencia: no se puede crear el archivo de estado de sincronizaci\u00f3n: {0}
Sync.fullRequired=Se ha producido un error en la sincronizaci\u00f3n anterior en {0}\nRealizar\u00e1 la sincronizaci\u00f3n completa.
Sync.connectFailed=Se ha producido un error al establecer la conexi\u00f3n con el DAS durante la sincronizaci\u00f3n causado por: {0}
## DeleteLocalInstanceCommand
DeleteInstance.running=La instancia se est\u00e1 ejecutando.  Det\u00e9ngala y vuelva a ejecutar el comando.
DeleteInstance.noInstanceName=Debe especificar una instancia.
DeleteInstance.badWhack=No se puede eliminar el directorio de la instancia: {0}  El directorio sigue existiendo despu\u00e9s de intentar eliminarlo. 
DeleteInstance.badWhackWithException=No se puede eliminar el directorio de la instancia {0}.  \nSe ha generado esta IOException: {1) \n** STACK TRACE **\n{2}
DeleteInstance.remoteError=Se ha producido un error al establecer la conexi\u00f3n con el DAS en {0}:{1}. 
DeleteInstance.noWhack=No existe el directorio de la instancia: {0}
DeleteInstance.noInstance=No existe la instancia en esta m\u00e1quina.
Config.badConfigNames=Debe especificar una configuraci\u00f3n de origen y de destino 


restart.instanceNotRunning=El servidor no se est\u00e1 ejecutando; se intentar\u00e1 iniciarlo...
restart=Reiniciando la instancia...
restartChangeDebug=Reiniciando la instancia y estableciendo expl\u00edcitamente la depuraci\u00f3n en {0}...
#ImportSyncBundleCommand
noFile=No existe el archivo {0}.
import.sync.bundle.extractBundleFailed=No se pudo extraer el contenido del conjunto\n{0}\nen\n{1}.
import.sync.bundle.inboundPayloadFailed=No se pudo leer el conjunto\n{0}\n{1}.
import.sync.bundle.completeRegistrationFailed=El DAS est\u00e1 desconectado de la red. No se pudo definir la propiedad rendezvousOccurred. Utilice el comando set para definir la propiedad rendezvousOccurred como true:\nset {0}.
import.sync.bundle.backupInstanceDirFailed=No se pudo cambiar el nombre del directorio existente\n{0}\na\n{1}.
import.sync.bundle.deletedInstanceDir=Eliminando el directorio existente:\n{0}
import.sync.bundle.closeStreamFailed=No se pudo cerrar la conexi\u00f3n de flujo en el archivo\n{0}\n{1}
import.sync.bundle.invalidInstance=La instancia {0} no existe.
import.sync.bundle.domainXmlNotFound=No se pudo encontrar domain.xml en {0}.

#SetupSshKey
KeySetupFailed=Se ha producido un error en la configuraci\u00f3n de la clave SSH: {0}
KeyDoesNotExist=El archivo de la clave especificada {0} no existe.
SSHPasswordPrompt=Introduzca la contrase\u00f1a SSH para {0}@{1}> 
SSHPasswordNotFound=No se ha encontrado el modo no interactivo ni la contrase\u00f1a SSH en el archivo de contrase\u00f1a.
SSHPassphrasePrompt=La clave {0} est\u00e1 cifrada\nIntroduzca la contrase\u00f1a de la clave> 
GenerateKeyPairPrompt=No se ha encontrado la clave SSH para el usuario {0}\n\u00bfDesea generar un par clave SSH (sin contrase\u00f1a de clave) para {0} a fin de obtener acceso a {1}? [s/n]: 
SSHAlreadySetup=La autenticaci\u00f3n de clave p\u00fablica SSH ya est\u00e1 configurada para {0}@{1}
ErrorParsingKey=Error al analizar el archivo de contrase\u00f1a {0}: {1}
ConnFailed=Se ha producido un error al comprobar la conexi\u00f3n.
DomainMasterPasswordPrompt=La contrase\u00f1a tiene un alias. Para obtener la contrase\u00f1a real, introduzca la contrase\u00f1a maestra para el almac\u00e9n de claves{0}> 
GetPasswordFailure=No se pudo obtener la contrase\u00f1a del almac\u00e9n de claves {0}.
PasswordAuthFailure=No se pudo autenticar mediante la contrase\u00f1a con alias almacenada en el almac\u00e9n de claves {0}.

#installNode
mkdir.failed=No se pudo crear el directorio {0} en el host {1}
cannot.copy.zip.file=No se pudo copiar el archivo zip {0} en el host {1}
jar.failed=Se ha producido un error en el comando jar al instalar GlassFish en el host {0}. Salida del comando {1}
fix.permissions.failed=No se pudieron establecer permisos en los comandos del directorio bin en el host {0} para la instalaci\u00f3n de GlassFish {1}
found.glassfish.install=GlassFish ya est\u00e1 instalado en el host {0} bajo {1}.
glassfish.install.check.failed=Se ha encontrado un problema al comprobar si la instalaci\u00f3n ya existe en el host remoto.
call.delete.node.ssh=Se debe llamar a delete-node-ssh para eliminar el nodo de {0} antes de llamar a uninstall-node.
node.already.configured=El nodo {0} ya est\u00e1 instalado y configurado para su uso.

StopInstance.nopidprev=No se puede encontrar el ID de proceso del servidor.  Se supone que debe estar aqu\u00ed: {0}.  No se puede detener el proceso.
StopInstance.pidprevreaderror=Error al intentar leer el ID de proceso de {0}: {1}

#change-master-password-node
instance.is.running=El servidor {0} se est\u00e1 ejecutando. Es necesario detener la instancia antes de que la contrase\u00f1a maestra pueda ser modificada.
## change-master-password-node
current.mp=Introduzca la contrase\u00f1a maestra actual>
no.console=No hay conexi\u00f3n con la consola, se cancelar\u00e1 el proceso.
incorrect.mp=Contrase\u00f1a maestra actual incorrecta. No le ser\u00e1 posible cambiarla.
incorrect.old.mp=Contrase\u00f1a maestra anterior incorrecta. No le ser\u00e1 posible cambiarla.
new.mp=la nueva contrase\u00f1a maestra
old.mp=Introduzca la contrase\u00f1a maestra anterior.
domain.is.running=El dominio {0} en {1} est\u00e1 en ejecuci\u00f3n. Det\u00e9ngalo en primer lugar.
bad.node.dir=El nodo {0} no existe.
