<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-iioplisteneredit"></a><h4>Modification d&#8217;un listener IIOP</h4>
<a name="indexterm-12"></a><p>Utilisez la page Modification d&#8217;un module d&#8217;&#233;coute IIOP pour modifier les param&#232;tres
d&#8217;un listener IIOP. </p>

<p>La page Modification d&#8217;un module d&#8217;&#233;coute IIOP contient les options suivantes&#160;:</p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Nom</dt>
<dd><p>Nom unique qui identifie le listener IIOP. Le champ Nom est en lecture seule. Vous ne pouvez sp&#233;cifier le nom qu&#8217;&#224; la cr&#233;ation d&#8217;un listener IIOP.</p>

</dd>
<dt>Adresse r&#233;seau</dt>
<dd><p>Adresse r&#233;seau du listener IIOP. L&#8217;adresse r&#233;seau peut &#234;tre une adresse IP ou un nom d&#8217;h&#244;te DNS pouvant &#234;tre r&#233;solu.</p>

</dd>
<dt>Port du module d&#8217;&#233;coute</dt>
<dd><p>Num&#233;ro du port d&#8217;&#233;coute du listener IIOP.</p>

</dd>
<dt>Module d&#8217;&#233;coute</dt>
<dd><p>Statut du listener. Si la case Activ&#233; est coch&#233;e, les connexions entrantes IIOP de l&#8217;ORB &#224; GlassFish Server sont activ&#233;es. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Securit&#233;</dt>
<dd><p>Si la case Activ&#233; est coch&#233;e, la SSL est activ&#233;e pour le listener IIOP. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Propri&#233;t&#233;s suppl&#233;mentaires du listener IIOP. GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les listeners IIOP.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-iioplistenernew.html">Pour cr&#233;er un listener IIOP</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">Pour modifier un listener IIOP</a></p>

</li>
<li><p><a href="task-editiiopssl.html">Pour modifier les param&#232;tres SSL d'un listener IIOP s&#233;curis&#233;</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">Pour supprimer un listener IIOP</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-iiop-listener-1"><tt>create-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-iiop-listeners-1"><tt>list-iiop-listeners</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-iiop-listener-1"><tt>delete-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-ssl-1"><tt>create-ssl</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-ssl-1"><tt>delete-ssl</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
