<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-orb"></a><h4>ORB</h4>
<a name="indexterm-8"></a><a name="indexterm-9"></a><p>Utilisez la page ORB pour configurer l&#8217;ORB (Object Request Broker). </p>

<p>Le courtier ORB fournit l&#8217;interface requise pour identifier et localiser des objets,
traiter la gestion des connexions, fournir des donn&#233;es et demander des communications.
Les clients distants de beans entreprise (modules EJB) communiquent avec GlassFish Server
&#224; l&#8217;aide du programme ORB.</p>

<p>La page ORB contient les options suivantes&#160;:</p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>ID de pool de threads</dt>
<dd><p>Pool de threads utilis&#233; par l&#8217;ORB. L&#8217;ORB utilise des pools de threads pour r&#233;pondre aux requ&#234;tes des clients distants de beans entreprise et d&#8217;autres clients qui communiquent par RMI-IIOP. Le pool de threads par d&#233;faut de l&#8217;ORB est <tt>thread-pool-1</tt> qui utilise les valeurs par d&#233;faut appropri&#233;es aux requ&#234;tes RMI/IIOP. </p>

</dd>
<dt>Taille max. du fragment de message</dt>
<dd><p>Taille maximale du fragment des messages IIOP. Les messages d&#233;passant cette taille sont fragment&#233;s. La valeur par d&#233;faut est 1024 octets.</p>

</dd>
<dt>Nombre total de connexions</dt>
<dd><p>Nombre maximum de connexions entrantes pour l&#8217;ensemble des listeners IIOP. La valeur par d&#233;faut est 1024.</p>

</dd>
<dt>Authentification client IIOP</dt>
<dd><p>Si la case Activ&#233; est s&#233;lectionn&#233;e, le serveur refuse les requ&#234;tes non authentifi&#233;es et ins&#232;re un bit de demande d&#8217;authentification dans les IOR (Interoperable Object Reference) envoy&#233;es aux clients. L&#8217;authentification client IIOP peut &#234;tre activ&#233;e ou d&#233;sactiv&#233;e. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s de l&#8217;ORB. GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour l&#8217;ORB.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-orb.html">Pour configurer l'ORB </a></p>

</li>
<li><p><a href="task-iioplistenernew.html">Pour cr&#233;er un listener IIOP</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">Pour modifier un listener IIOP</a></p>

</li>
<li><p><a href="task-editiiopssl.html">Pour modifier les param&#232;tres SSL d'un listener IIOP s&#233;curis&#233;</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">Pour supprimer un listener IIOP</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-iiop-listener-1"><tt>create-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-iiop-listeners-1"><tt>list-iiop-listeners</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-iiop-listener-1"><tt>delete-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-ssl-1"><tt>create-ssl</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-ssl-1"><tt>delete-ssl</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
