<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-editiiopssl"></a><h3>Pour modifier les param&#232;tres SSL d&#8217;un listener IIOP s&#233;curis&#233;</h3><a name="indexterm-5"></a><a name="indexterm-6"></a><ol>
<li><b>Dans l&#8217;arborescence, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud ORB.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud Listeners IIOP.</b><p>La page Modules d&#8217;&#233;coute IIOP s&#8217;affiche.</p></li>
<li><b>Dans le tableau, cliquez sur le nom du listener &#224; modifier.</b><p>La page Modification d&#8217;un module d&#8217;&#233;coute IIOP s&#8217;affiche.</p></li>
<li><b>Si la case S&#233;curit&#233; permise est coch&#233;e, cliquez sur le volet &#224;
onglets SSL pour modifier les param&#232;tres SSL (Secure Socket Layer) du listener IIOP.</b><p>La page SSL s&#8217;ouvre.</p></li>
<li><b>Sur la page SSL, cochez la case SSL3 activ&#233; pour activer SSL3.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case TLS activ&#233; pour activer TLS (Transport Layer Security).</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case Authentification client activ&#233;e pour demander aux clients de s&#8217;identifier
sur le serveur &#224; chaque requ&#234;te.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Surnom de certificat, saisissez le surnom du certificat du
serveur dans la base de donn&#233;es de certificats ou le jeton PKCS
n° 11.</b><p>Dans le certificat, le format du nom est <tt><i> nom du jeton</i>:<i>surnom</i></tt>. M&#234;me la partie
<tt><i>nom du jeton</i>:</tt> du nom de cet attribut est facultatif. </p></li>
<li><b>Dans le champ Key Store, saisissez le nom du fichier keystore (par
exemple, <tt>keystore.jks</tt>).</b></li>
<li><b>Dans le champ Algorithme de confiance, saisissez le nom de l&#8217;algorithme de
gestion de confiance (par exemple, PKIX) &#224; utiliser pour la validation du
chemin de certification.</b></li>
<li><b>Dans le champ Longueur max. du certificat, saisissez le nombre maximum de
certificats interm&#233;diaires non auto-&#233;mis qui peuvent exister dans un chemin de certification.
</b><p>Ce champ est utilis&#233; uniquement si le champ Algorithme de confiance est
d&#233;fini &#224; PKIX. Z&#233;ro (0) implique que le chemin peut contenir un
seul certificat. -1 implique que la longueur du chemin est illimit&#233;e (pas
de maximum). La d&#233;finition d&#8217;une valeur &#224; moins de -1 entra&#238;ne l&#8217;&#233;mission
d&#8217;une exception.</p></li>
<li><b>Dans le champ Trust Store, saisissez le nom du fichier truststore (par
exemple, <tt>cacerts.jks</tt>).</b></li>
<li><b>Dans la zone Suites de chiffrement, sp&#233;cifiez les suites de chiffrement &#224;
utiliser.</b><p>Si vous n&#8217;ajoutez pas de suite de chiffrement, toutes les suites seront
utilis&#233;es.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-orb.html">Pour configurer l'ORB </a></p>

</li>
<li><p><a href="task-iioplistenernew.html">Pour cr&#233;er un listener IIOP</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">Pour modifier un listener IIOP</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">Pour supprimer un listener IIOP</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
