<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpooladvance"></a><h4>Modifica degli attributi avanzati del pool di connessione del connettore</h4>
<a name="indexterm-43"></a><p>Nella pagina Edit Connector Connection Pool Advanced Attributes &#232; possibile modificare le
impostazioni avanzate di un pool di connessione del connettore.</p>

<p>La pagina Edit Connector Connection Pool Advanced Attributes contiene le opzioni seguenti.</p>

<dl><dt>Load Defaults</dt>
<dd><p>Pulsante che consente di ripristinare i valori predefiniti delle impostazioni che dispongono di tali valori. Le impostazioni prive di valori predefiniti restano invariate.</p>

</dd>
<dt>Validate At Most Once</dt>
<dd><p>Specifica l'intervallo di tempo espresso in secondi tra richieste successive di convalida di una connessione (al massimo una volta). Il valore predefinito &#232; 0 e implica che l'attributo non sia abilitato.</p>

</dd>
<dt>Leak Timeout</dt>
<dd><p>Numero di secondi necessari per rilevare le perdite di connessione in un pool di connessione. Un valore pari a 0 indica che il rilevamento delle perdite di connessione &#232; disabilitato. Il valore predefinito &#232; 0.</p>

</dd>
<dt>Leak Reclaim</dt>
<dd><p>Se l'opzione &#232; selezionata, le connessioni perse verranno ristabilite nel pool al termine del rilevamento delle perdite di connessione. Questa opzione &#232; disabilitata per impostazione predefinita.</p>

</dd>
<dt>Creation Retry Attempts</dt>
<dd><p>Numero di tentativi da effettuare in caso di errore durante la creazione di una nuova connessione. Un valore pari a 0 indica che non sono consentiti tentativi per ricreare la connessione. Il valore predefinito &#232; 0.</p>

</dd>
<dt>Retry Interval</dt>
<dd><p>L'intervallo, in secondi, tra due tentativi di creare una connessione. Questo attributo viene utilizzato solo se il valore di Creation Retry Attempts &#232; maggiore di 0. Il valore predefinito &#232; 10 secondi.</p>

</dd>
<dt>Pooling</dt>
<dd><p>Consente il raggruppamento delle connessioni per il pool. Questa opzione &#232; abilitata per impostazione predefinita.</p>

</dd>
<dt>Lazy Association</dt>
<dd><p>Se l'opzione &#232; selezionata, le connessioni verranno associate lentamente quando vengono utilizzate in un'operazione. Le connessioni vengono disassociate quando la transazione &#232; completa e viene terminato un metodo del componente. In tal modo il riutilizzo delle connessioni fisiche risulta pi&#249; agevole. Questa opzione &#232; disabilitata per impostazione predefinita.</p>

</dd>
<dt>Lazy Connection Enlistment</dt>
<dd><p>Se l'opzione &#232; selezionata, una risorsa viene integrata nella transazione solo quando &#232; effettivamente utilizzata in un metodo. Questa opzione &#232; disabilitata per impostazione predefinita.</p>

</dd>
<dt>Associate with Thread</dt>
<dd><p>Se l'opzione &#232; selezionata, una connessione viene associata a un thread. Quando lo stesso thread richiede una connessione, pu&#242; riutilizzare la connessione gi&#224; associata a esso, senza cos&#236; provocare l'overhead per ottenere una connessione dal pool. Questa opzione &#232; disabilitata per impostazione predefinita.</p>

</dd>
<dt>Match Connections</dt>
<dd><p>Se l'opzione &#232; selezionata, per il pool viene abilitata la corrispondenza tra connessioni. Questa opzione pu&#242; essere disabilitata se si &#232; certi che le connessioni nel pool saranno sempre omogenee e che la connessione ottenuta dal pool non debba pertanto corrispondere all'adattatore di risorsa. Questa opzione &#232; abilitata per impostazione predefinita.</p>

</dd>
<dt>Match Connection Usage</dt>
<dd><p>Numero consentito di riutilizzi di una connessione da parte del pool. Una volta che una connessione viene riutilizzata per il numero di volte specificato, viene chiusa. Un valore pari a 0 indica che questo attributo non &#232; abilitato. Il valore predefinito &#232; 0.</p>

</dd>
</dl>
<a name="gkomp"></a><h5>Attivit&#224; correlate</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Creare un pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Modificare un pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Modificare gli attributi avanzati del pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Modificare le propriet&#224; del pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Creare una mappa di sicurezza per un pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Modificare una mappa di sicurezza per un pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Eliminare una mappa di sicurezza per un pool di connessione del connettore</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Eliminare un pool di connessione del connettore</a></p>

</li></ul>
<a name="gkonj"></a><h5>Comandi <tt>asadmin</tt> correlati</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/o relative consociate. Tutti i diritti riservati. <a href="docinfo.html">Nota legale</a></small>
