#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
acceptor.threads.too.low=Les threads accepteur doivent \u00eatre au moins\u00a01

create.http.fail.protocolnotfound=Le protocole sp\u00e9cifi\u00e9 {0} n\u2019est pas encore configur\u00e9
create.http.listener.acceptorthreads=Nombre de threads de l\u2019accepteur du socket d\u2019\u00e9coute. La valeur recommand\u00e9e correspond au nombre de processeurs de la machine. La valeur par d\u00e9faut est 1. 
create.http.listener.default-virtual-server=Attribut de l\u2019ID du serveur virtuel par d\u00e9faut de ce listener.
create.http.listener.defaultvs=Attribut de l\u2019ID du serveur virtuel par d\u00e9faut de ce listener.
create.http.listener.duplicate=Le listener HTTP nomm\u00e9 {0} existe d\u00e9j\u00e0.
create.http.listener.enabled=Si le listener est d\u00e9fini sur true, il est activ\u00e9 lors de l\u2019ex\u00e9cution.
create.http.listener.fail=Le listener {0} ne peut pas \u00eatre cr\u00e9\u00e9, raison r\u00e9elle\u00a0: {1}
create.http.listener.listener_id=ID du listener HTTP.
create.http.listener.listeneraddress=Adresse IP ou nom d\u2019h\u00f4te (r\u00e9soluble par DNS).
create.http.listener.listenerport=Num\u00e9ro de port sur lequel cr\u00e9er le socket d\u2019\u00e9coute. Les valeurs l\u00e9gales sont comprises entre 1 et 65535. Sous UNIX, la cr\u00e9ation de sockets qui \u00e9coutent sur les ports 1 \u00e0 1024 n\u00e9cessite des privil\u00e8ges de superutilisateur. La configuration d\u2019un socket d\u2019\u00e9coute SSL pour \u00e9couter le port 443 est recommand\u00e9e.
create.http.listener.secure=Si le socket est d\u00e9fini sur true, il utilise le protocole SSL/TLS pour communiquer avec le serveur d\u2019administration de domaine.
create.http.listener.securityenabled=Si le listener HTTP est d\u00e9fini sur true, il est ex\u00e9cut\u00e9 sur un protocole SSL. Vous pouvez activer ou d\u00e9sactiver SSL2 et SSL3 et d\u00e9finir des valeurs en utilisant un \u00e9l\u00e9ment SSL. Le param\u00e8tre de s\u00e9curit\u00e9 permet d\u2019activer ou de d\u00e9sactiver de mani\u00e8re globale le protocole SSL en mettant des certificats \u00e0 disposition de l\u2019instance de serveur. La valeur par d\u00e9faut est \u2019false\u2019 (faux).
create.http.listener.servername=Indique au serveur les \u00e9l\u00e9ments \u00e0 ajouter \u00e0 la section du nom d\u2019h\u00f4te de tous les URL envoy\u00e9s au client. Cette valeur affecte les URL que le serveur g\u00e9n\u00e8re automatiquement\u00a0; elle n\u2019affecte pas les URL des r\u00e9pertoires et des fichiers stock\u00e9s dans le serveur. Ce nom correspond au nom de l\u2019alias si votre serveur en utilise un. Si vous ajoutez une colonne et un num\u00e9ro de port, ce port sera utilis\u00e9 dans les URL que le serveur envoie au client.
create.http.listener.success=Le listener HTTP {0} a \u00e9t\u00e9 cr\u00e9\u00e9 correctement.
create.http.listener.vs.blank=Un serveur virtuel par d\u00e9faut est n\u00e9cessaire.  Veuillez utiliser l\u2019option --default-virtual-server pour sp\u00e9cifier cette valeur.
create.http.listener.vs.bothparams=Conflit entre --defaultVS et --default-virtual-server.  Veuillez utiliser uniquement --default-virtual-server pour sp\u00e9cifier cette valeur.
create.http.listener.vs.notexists=La valeur de l\u2019attribut (default-virtual-server = {0}) ne se trouve pas dans la liste des serveurs virtuels d\u00e9finis dans la configuration.
create.http.listener.xpowered=Si la valeur est d\u00e9finie sur true, cela permet d\u2019ajouter les en-t\u00eates X-Powered-By: Servlet/2.4 et X-Powered-By: JSP/2.0 aux r\u00e9ponses correspondantes. La sp\u00e9cification Servlet 2.4 d\u00e9finit l\u2019en-t\u00eate X-Powered-By: Servlet/2.4 que les conteneurs peuvent ajouter aux r\u00e9ponses g\u00e9n\u00e9r\u00e9es par le servlet. De m\u00eame, la sp\u00e9cification JSP 2.0 d\u00e9finit l\u2019en-t\u00eate X-Powered-By: JSP/2.0 que les conteneurs peuvent ajouter aux r\u00e9ponses utilisant la technologie JSP. Ces en-t\u00eates ont pour objectif d\u2019aider \u00e0 collecter des donn\u00e9es statistiques sur l\u2019utilisation du servlet et de la technologie JSP.
create.http.listener=La commande create-http-listener cr\u00e9e un listener HTTP.

create.http.redirect.fail.protocolnotfound=Le protocole sp\u00e9cifi\u00e9 {0} n\u2019est pas encore configur\u00e9
create.http.redirect.listener.duplicate=L\u2019\u00e9l\u00e9ment de redirection HTTP nomm\u00e9 {0} existe d\u00e9j\u00e0.
create.http.redirect.fail=\u00c9chec de la cr\u00e9ation d\u2019une redirection HTTP pour {0}\u00a0: {1}.

create.network.listener.fail.duplicate=Le listener de r\u00e9seau nomm\u00e9 {0} existe d\u00e9j\u00e0.
create.network.listener.fail.bad.protocol=Le protocole {0} ne comporte aucune configuration de protocole ou d\u2019unification de port

create.portunif.fail=\u00c9chec de la cr\u00e9ation de {0}\u00a0: {1}
create.portunif.fail.notfinder=\u00c9chec de la cr\u00e9ation de {0}.  La classe sp\u00e9cifi\u00e9e ne correspond pas \u00e0 une recherche de protocole\u00a0: {1}
create.portunif.fail.notfilter=\u00c9chec de la cr\u00e9ation de {0}.  La classe sp\u00e9cifi\u00e9e ne correspond pas \u00e0 un filtre de protocole\u00a0: {1}
create.portunif.protocol.duplicate=Une d\u00e9finition de protocole nomm\u00e9e {0} existe d\u00e9j\u00e0.

create.protocol.fail.duplicate=Le protocole {0} existe d\u00e9j\u00e0. Impossible d\u2019ajouter le protocole dupliqu\u00e9.
create.protocol.fail=\u00c9chec de la cr\u00e9ation du protocole {0}

create.transport.fail.duplicate=Le transport {0} existe d\u00e9j\u00e0. Impossible d\u2019ajouter le transport dupliqu\u00e9.
create.transport.fail=\u00c9chec de la cr\u00e9ation du transport {0}

create.virtual.server.both.http.network=Veuillez utiliser uniquement des listeners de r\u00e9seau.
create.virtual.server.defaultwebmodule=Module Web autonome associ\u00e9 par d\u00e9faut \u00e0 ce serveur virtuel.
create.virtual.server.duplicate=Un serveur virtuel nomm\u00e9 {0} existe d\u00e9j\u00e0.
create.virtual.server.hosts=Liste de valeurs s\u00e9par\u00e9es par des virgules (,) autoris\u00e9es dans l\u2019en-t\u00eate de la demande de l\u2019h\u00f4te permettant de s\u00e9lectionner le serveur virtuel actif. Chaque serveur virtuel configur\u00e9 sur le m\u00eame groupe de connexions doit disposer d\u2019un h\u00f4te unique pour ce groupe.
create.virtual.server.httplisteners=Liste de valeurs s\u00e9par\u00e9es par des virgules (,) des ID de listener HTTP. Valeur requise uniquement pour un serveur virtuel autre que celui par d\u00e9faut.
create.virtual.server.logfile=Nom du fichier dans lequel les entr\u00e9es de journal de ce serveur virtuel sont \u00e9crites. Il s\u2019agit par d\u00e9faut du journal du serveur.
create.virtual.server.property=Paires noms d\u2019attribut/valeurs facultatives pour configurer le serveur virtuel. 
create.virtual.server.state=D\u00e9termine si un serveur virtuel est actif (on) ou inactif (off ou disabled). La valeur par d\u00e9faut est actif (on). Lorsque le serveur virtuel est inactif, il n\u2019est pas utilis\u00e9 pour les demandes.
create.virtual.server.usagetext=create-virtual-server --hosts <h\u00f4tes>\n\t[--httplisteners <listeners http> |\n\t--networklisteners <listeners r\u00e9seau>]\n\t[--defaultwebmodule <module Web par d\u00e9faut>] [--state <\u00e9tat>]\n\t[--logfile <fichier journal>] [--property <propri\u00e9t\u00e9>]\n\t[--target <cible (valeur par d\u00e9faut\u00a0:serveur)>]\n\t[-?|--help[=<aide (valeur par d\u00e9faut\u00a0: false)>]] virtual_server_id
create.virtual.server.virtual_server_id=Identifie l\u2019ID unique du serveur virtuel \u00e0 cr\u00e9er. L\u2019ID ne peut pas commencer par un nombre.
create.virtual.server=La commande create-virtual-server permet de cr\u00e9er le serveur virtuel nomm\u00e9. La virtualisation du serveur d\u2019application permet \u00e0 plusieurs domaines d\u2019URL d\u2019utiliser un seul processus de serveur HTTP qui \u00e9coute plusieurs adresses d\u2019h\u00f4te. Si l\u2019application est disponible sur deux serveurs virtuels, cela indique qu\u2019ils partagent toujours les m\u00eames pools de ressources physiques.
create.vritual.server.fail=\u00c9chec de la cr\u00e9ation de {0}
create.vritual.server.success=Le serveur virtuel {0} a \u00e9t\u00e9 cr\u00e9\u00e9.

delete.fail=\u00c9chec de la suppression de {0}\u00a0: {1}

delete.http.listener.fail=\u00c9chec de la suppression de {0}
delete.http.listener.listener_id=ID du listener HTTP.
delete.http.listener.notexists=Le listener HTTP {0} sp\u00e9cifi\u00e9 n\u2019existe pas.
delete.http.listener.secure=Si le socket est d\u00e9fini sur true, il utilise le protocole SSL/TLS pour communiquer avec le serveur d\u2019administration de domaine.
delete.http.listener.success=Le listener HTTP {0} a \u00e9t\u00e9 correctement supprim\u00e9.
delete.http.listener=La commande delete-http-listener permet de supprimer le listener HTTP sp\u00e9cifi\u00e9.

delete.http.redirect.notexists=La redirection HTTP sp\u00e9cifi\u00e9e {0} n\u2019existe pas.
delete.http.redirect.fail=\u00c9chec de la suppression de la redirection HTTP {0}.

delete.protocol.beingused=Le protocole {0} est utilis\u00e9 dans le listener de r\u00e9seau {1}
delete.protocol.fail=\u00c9chec de la suppression du transport {0}
delete.protocol.notexists=Le protocole {0} n\u2019existe pas

delete.threadpool.beingused=Le pool de threads {0} est utilis\u00e9 dans le listener de r\u00e9seau {1}
delete.threadpool.notexists=Le pool de thread nomm\u00e9 {0} n\u2019existe pas.

delete.transport.beingused=Le transport {0} est utilis\u00e9 dans le listener de r\u00e9seau {1}
delete.transport.fail=\u00c9chec de la suppression du transport {0}
delete.transport.notexists=Le transport {0} n\u2019existe pas

delete.virtual.server.fail=\u00c9chec de la suppression de {0}.
delete.virtual.server.notexists=Le serveur virtuel {0} sp\u00e9cifi\u00e9 n\u2019existe pas.
delete.virtual.server.referenced=Le serveur virtuel {0} sp\u00e9cifi\u00e9 ne peut pas \u00eatre supprim\u00e9 car il est r\u00e9f\u00e9renc\u00e9 \u00e0 partir du listener HTTP {1}.
delete.virtual.server.success=Le serveur virtuel {0} a \u00e9t\u00e9 correctement supprim\u00e9.
delete.virtual.server.virtual_server_id=L\u2019identificateur unique du serveur virtuel \u00e0 supprimer.
delete.virtual.server=La commande delete-virtual-server permet de supprimer le serveur virtuel avec l\u2019ID de serveur virtuel sp\u00e9cifi\u00e9.

list.http.listeners.fail=\u00c9chec de la commande list-http-listeners.
list.http.listeners.success=La commande list-http-listeners a \u00e9t\u00e9 correctement ex\u00e9cut\u00e9e.
list.http.listeners=La commande list-http-listeners r\u00e9pertorie les listeners HTTP existants. 

list.virtual.servers.success=La commande list-virtual-servers a \u00e9t\u00e9 correctement ex\u00e9cut\u00e9e.
list.virtual.servers=La commande list-virtual-servers r\u00e9pertorie les serveurs virtuels existants.

not.found=Aucun \u00e9l\u00e9ment {0} nomm\u00e9 {1}.

port.in.use=Le port [{0}] est d\u00e9j\u00e0 utilis\u00e9 pour l\u2019adresse [{1}]. Veuillez choisir un autre port.
