#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
acceptor.threads.too.low=El n\u00famero de subprocesos del aceptador debe ser al menos 1

create.http.fail.protocolnotfound=El protocolo especificado {0} todav\u00eda no est\u00e1 configurado
create.http.listener.acceptorthreads=El n\u00famero de subprocesos del aceptador para el socket de escucha. El valor recomendado es el valor de procesadores del equipo. El valor predeterminado es 1. 
create.http.listener.default-virtual-server=El atributo de ID del servidor virtual predeterminado de esta escucha.
create.http.listener.defaultvs=El atributo de ID del servidor virtual predeterminado de esta escucha.
create.http.listener.duplicate=La escucha HTTP llamada {0} ya existe.
create.http.listener.enabled=Si se define en true, la escucha se habilita en el tiempo de ejecuci\u00f3n.
create.http.listener.fail=No se ha podido crear la escucha {0}, la raz\u00f3n real es: {1}
create.http.listener.listener_id=El ID de escucha de la escucha HTTP.
create.http.listener.listeneraddress=La direcci\u00f3n IP o el nombre de host (que se pueda resolver mediante DNS).
create.http.listener.listenerport=El n\u00famero de puerto donde crear el socket de escucha. Los valores v\u00e1lidos se encuentran entre 1 y 65535. En UNIX, la creaci\u00f3n de sockets de escucha para puertos 1-1024 requiere privilegios de superusuario. Se recomienda configurar un socket de escucha SSL para realizar la escucha en el puerto 443.
create.http.listener.secure=Si se define en true, utiliza SSL/TLS para comunicarse con el servidor de administraci\u00f3n de dominios.
create.http.listener.securityenabled=Si se define en true, la escucha HTTP ejecuta SSL. Puede activar o desactivar SSL2 o SSL3 y definir cifrados mediante un elemento SSL. La opci\u00f3n de seguridad habilita o inhabilita SSL de forma global poniendo los certificados a disposici\u00f3n de la instancia del servidor. El valor predeterminado es false.
create.http.listener.servername=Indica al servidor qu\u00e9 se debe colocar en la secci\u00f3n de nombres de host de las URL que se env\u00eden al cliente. Este valor afecta a las URL que genera autom\u00e1ticamente el servidor; no afecta a las\nURL de los directorios y archivos almacenados en el servidor. Este nombre debe ser el nombre de alias si el servidor utiliza un alias. Si se agregan dos puntos y un n\u00famero de puerto, dicho puerto se utilizar\u00e1 en las URL que el servidor env\u00eda al cliente.
create.http.listener.success=La escucha HTTP {0} se ha creado correctamente.
create.http.listener.vs.blank=Se requiere un servidor virtual predeterminado.  Utilice --default-virtual-server para especificar este valor.
create.http.listener.vs.bothparams=--defaultVS y --default-virtual-server entran en conflicto.  Utilice solamente --default-virtual-server para especificar este valor.
create.http.listener.vs.notexists=El valor de atributo (default-virtual-server = {0}) no se encuentra en la lista de servidores virtuales definidos en la configuraci\u00f3n.
create.http.listener.xpowered=Si se define en true, agrega los encabezados X-Powered-By: Servlet/2.4 y X-Powered-By: JSP/2.0 a las respuestas pertinentes. La especificaci\u00f3n Servlet 2.4 define el encabezado X-Powered-By: Servlet/2.4, que los contenedores pueden agregar a respuestas generadas por Servlet. Asimismo, la especificaci\u00f3n JSP 2.0 define el encabezado X-Powered-By: JSP/2.0, que los contenedores pueden agregar a respuestas que usen la tecnolog\u00eda JSP. El objetivo de estos encabezados es ayudar a recopilar datos estad\u00edsticos sobre el uso de Servlet y la tecnolog\u00eda JSP.
create.http.listener=El comando create-http-listener crea una escucha HTTP.

create.http.redirect.fail.protocolnotfound=El protocolo especificado {0} todav\u00eda no est\u00e1 configurado
create.http.redirect.listener.duplicate=El elemento http-redirect llamado {0} ya existe.
create.http.redirect.fail=No se pudo crear http-redirect para {0}: {1}.

create.network.listener.fail.duplicate=La escucha de red llamada {0} ya existe.
create.network.listener.fail.bad.protocol=El protocolo {0} no est\u00e1 configurado ni tiene configurada la unificaci\u00f3n de puertos

create.portunif.fail=Error al crear {0}: {1}
create.portunif.fail.notfinder=Error al crear {0}.  La clase proporcionada no es un ProtocolFinder: {1}
create.portunif.fail.notfilter=Error al crear {0}.  La clase proporcionada no es un ProtocolFilter: {1}
create.portunif.protocol.duplicate=Ya existe una definici\u00f3n de protocolo llamada {0}.

create.protocol.fail.duplicate=El protocolo {0} ya existe. No se puede agregar un protocolo duplicado.
create.protocol.fail=Error al crear el protocolo {0}

create.transport.fail.duplicate=El transporte {0} ya existe. No se puede agregar un transporte duplicado.
create.transport.fail=Error al crear el transporte {0}

create.virtual.server.both.http.network=Utilice solamente escuchas de red.
create.virtual.server.defaultwebmodule=El m\u00f3dulo web independiente asociado con este servidor virtual de forma predeterminada.
create.virtual.server.duplicate=El servidor virtual llamado {0} ya existe.
create.virtual.server.hosts=Una lista de valores separados por comas (,) permitidos en el encabezado de solicitud de host para seleccionar el servidor virtual actual. Cada uno de los servidores virtuales configurados en el mismo conjunto de conexiones debe tener un host \u00fanico para dicho grupo.
create.virtual.server.httplisteners=Una lista de ID de escucha HTTP separados por comas (,). Solamente se requiere para un servidor virtual que no sea el servidor virtual predeterminado.
create.virtual.server.logfile=Nombre del archivo donde se deben escribir las entradas de registro del servidor virtual. De forma predeterminada, se trata del registro del servidor.
create.virtual.server.property=Pares de nombre y valor del atributo opcional para configurar el servidor virtual. 
create.virtual.server.state=Determina si un servidor virtual est\u00e1 activo (activado) o inactivo (desactivado o inhabilitado). El valor predeterminado es activo (activado). Cuando est\u00e1 inactivo, el servidor virtual no procesa solicitudes.
create.virtual.server.usagetext=create-virtual-server --hosts <hosts>\n\t[--httplisteners <httplisteners> |\n\t--networklisteners <networklisteners>]\n\t[--defaultwebmodule <defaultwebmodule>] [--state <state>]\n\t[--logfile <logfile>] [--property <property>]\n\t[--target <target(default:server)>]\n\t[-?|--help[=<help(default:false)>]] virtual_server_id
create.virtual.server.virtual_server_id=Identifica el ID \u00fanico del servidor virtual que se va a crear. Este ID no puede empezar por un n\u00famero.
create.virtual.server=El comando create-virtual-server crea el servidor virtual con nombre. La virtualizaci\u00f3n en Application Server permite procesar varios dominios de URL mediante un \u00fanico proceso de servidor HTTP que realiza la escucha en varias direcciones de host. Si la aplicaci\u00f3n est\u00e1 disponible en dos servidores virtuales, continuar\u00e1 compartiendo las mismas agrupaciones de recursos f\u00edsicas.
create.vritual.server.fail=Error al crear {0}
create.vritual.server.success=El servidor virtual {0} se ha creado correctamente.

delete.fail=Error al eliminar {0}: {1}

delete.http.listener.fail=Error al eliminar {0}
delete.http.listener.listener_id=El ID de escucha de la escucha HTTP.
delete.http.listener.notexists=La escucha HTTP especificada, {0}, no existe.
delete.http.listener.secure=Si se define en true, utiliza SSL/TLS para comunicarse con el servidor de administraci\u00f3n de dominios.
delete.http.listener.success=La escucha HTTP {0} se ha eliminado correctamente.
delete.http.listener=El comando delete-http-listener elimina la escucha HTTP especificada.

delete.http.redirect.notexists=La redirecci\u00f3n HTTP especificada, {0}, no existe.
delete.http.redirect.fail=Error al eliminar la redirecci\u00f3n HTTP {0}.

delete.protocol.beingused=El protocolo {0} se est\u00e1 utilizando en la escucha de red {1}
delete.protocol.fail=Error al eliminar el transporte {0}
delete.protocol.notexists=El protocolo {0} no existe

delete.threadpool.beingused=El conjunto de subprocesos {0} se est\u00e1 utilizando en la escucha de red {1}
delete.threadpool.notexists=No existe el conjunto de subprocesos denominado {0}.

delete.transport.beingused=El transporte {0} se est\u00e1 utilizando en la escucha de red {1}
delete.transport.fail=Error al eliminar el transporte {0}
delete.transport.notexists=El transporte {0} no existe

delete.virtual.server.fail=Error al eliminar {0}.
delete.virtual.server.notexists=El servidor virtual especificado, {0}, no existe.
delete.virtual.server.referenced=El servidor virtual especificado, {0}, no puede eliminarse porque la escucha HTTP {1} hace referencia a \u00e9l.
delete.virtual.server.success=El servidor virtual {0} se ha eliminado correctamente.
delete.virtual.server.virtual_server_id=El identificador \u00fanico del servidor virtual que debe eliminarse.
delete.virtual.server=El comando delete-virtual-server elimina el servidor virtual con el ID de servidor virtual especificado.

list.http.listeners.fail=Error en el comando list-http-listeners.
list.http.listeners.success=El comando list-http-listeners se ha ejecutado correctamente.
list.http.listeners=El comando list-http-listeners muestra una lista de las escuchas HTTP existentes. 

list.virtual.servers.success=El comando list-virtual-servers se ha ejecutado correctamente.
list.virtual.servers=El comando list-virtual-servers muestra una lista de los servidores virtuales existentes.

not.found=No se ha encontrado ning\u00fan elemento {0} con el nombre {1}

port.in.use=El puerto [{0}] ya est\u00e1 seleccionado para la direcci\u00f3n [{1}], elija otro puerto.
