<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-accesslog"></a><h4>HTTP-Dienst</h4>
<a name="indexterm-55"></a><a name="indexterm-56"></a><p>Auf der Seite "HTTP-Dienst" k&#246;nnen Sie die allgemeine Richtlinie der Zugriffsprotokollierung f&#252;r
Webanwendungen festlegen.</p>

<p>Der HTTP-Dienst bietet Funktionen zum Bereitstellen von Webanwendungen und Funktionen, um bereitgestellte
Webanwendungen f&#252;r HTTP-Cients zugreifbar zu machen, einschlie&#223;lich virtueller Server, Threadpools und Netzwerkkonfiguration.</p>

<p>GlassFish-Server verwendet das Zugriffsprotokoll f&#252;r den HTTP-Dienst, um die Rotation der Zugriffsprotokolle
f&#252;r die virtuellen Server zu aktivieren und zu konfigurieren. Diese Protokolle befinden
sich im Verzeichnis <tt><i>domain-dir</i>/logs/access</tt> und sind folgenderma&#223;en benannt: <tt><i>virtual_server_name</i>_access_log.<i>yyyyMMdd</i>-<i> HH</i>h<i>mm</i>m<i>ss</i>s.txt</tt></p>

<p>Die Seite "HTTP-Dienst" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r alle Einstellungen.</p>

</dd>
<dt>Konfigurationsname</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>SSO</dt>
<dd><p>Gibt an, ob Single Sign-On (SSO) standardm&#228;&#223;ig f&#252;r alle Webanwendungen auf allen virtuellen Servern auf diesem Server aktiviert ist, die f&#252;r den gleichen Bereich konfiguriert sind. Bei deaktivierter Option ist SSO standardm&#228;&#223;ig f&#252;r alle virtuellen Server deaktiviert, und Benutzer m&#252;ssen sich bei jeder Anwendung auf jedem virtuellen Server separat authentifizieren. Sie k&#246;nnen diese Einstellung f&#252;r einen einzelnen virtuellen Server au&#223;er Kraft setzen. SSO kann aktiviert oder deaktiviert werden. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Access Logging (Zugriffsprotokollierung)</dt>
<dd><p>Wird diese Option gew&#228;hlt, wird die Zugriffsprotokollierung f&#252;r alle untergeordneten Elemente des virtuellen Servers aktiviert, die diese Eigenschaft nicht angeben. Wenn diese Option nicht ausgew&#228;hlt wird, wird die Zugriffsprotokollierung f&#252;r alle Unterelemente von virtuellen Servern deaktiviert, welche diese Eigenschaft nicht angeben. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Rotation (Rotation)</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist die Protokolldateirotation aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Rotation Policy (Rotationsrichtlinie)</dt>
<dd><p>Die einzige verf&#252;gbare Rotationsrichtlinie ist <tt>time</tt>.</p>

</dd>
<dt>Rotation Interval (Rotationsintervall)</dt>
<dd><p>Die Anzahl der Minuten zwischen den Rotationen des Zugriffsprotokolls. Dieses Feld ist nur g&#252;ltig, wenn als Rotationsrichtlinie <tt>time</tt> ausgew&#228;hlt wurde. Der Standardwert betr&#228;gt 1.440 Minuten (24 Stunden).</p>

</dd>
<dt>Rotation Suffix (Rotationssuffix)</dt>
<dd><p>Der Zeichenfolgewert, der dem Protokolldateinamen nach der Rotation angeh&#228;ngt werden soll. Der Standardwert lautet <tt>JJJJ-MM-TT</tt>.</p>

<p>Stellen Sie sicher, dass das Rotationssuffix gen&#252;gend Werte zur Erstellung eines eindeutigen Suffixes f&#252;r jede Protokollrotation enth&#228;lt. Wenn das Zugriffsprotokoll zum Beispiel &#246;fter als einmal pro Tag rotiert wird, schlie&#223;en Sie die Uhrzeit des Tages in das Rotationssuffix ein.</p>

<p>Ein eindeutiges Suffix ist erforderlich, um sicherzustellen, dass die Zugriffsprotokolldatei bei jedem Ablauf des Rotationsintervalls rotiert wird. Sind das Rotationssuffix der neuen Zugriffsprotokolldatei und das Rotationssuffix der vorhandenen Zugriffsprotokolldatei identisch, wird die Datei nicht rotiert.</p>

</dd>
<dt>Max File Count (Maximale Dateizahl)</dt>
<dd><p>Die maximale Anzahl rotierter Zugriffsprotokolldateien, die aufbewahrt werden sollen. Ein negativer Wert gibt an, dass die Dateianzahl nicht begrenzt ist. Der Standardwert ist &#8211;1.</p>

</dd>
<dt>Puffergr&#246;&#223;e</dt>
<dd><p>Die Gr&#246;&#223;e des Zugriffsprotokollpuffers in Byte oder ein Wert kleiner oder gleich null (0) f&#252;r nicht gepufferte Zugriffsprotokolle. Der Standardwert betr&#228;gt 32768.</p>

</dd>
<dt>Intervall f&#252;r Schreibvorg&#228;nge</dt>
<dd><p>Die Anzahl der Sekunden, bevor das Protokoll auf die Festplatte geschrieben wird. Das Zugriffsprotokoll wird geschrieben, wenn der Puffer voll ist oder das Intervall abl&#228;uft. Wenn der Wert kleiner oder gleich null (0) ist, werden die Pufferdaten immer geschrieben, auch wenn der Puffer nicht voll ist. Dies bedeutet, dass das Meldungsprotokoll bei jedem Zugriff auf den Server direkt in der Datei gespeichert wird. Der Standardwert betr&#228;gt 300.</p>

</dd>
<dt>Format</dt>
<dd><p>Der Zeichenfolgewert, der angibt, welche Informationen im Zugriffsprotokoll aufzuzeichnen sind sowie die Reihenfolge der Aufzeichnung. Der Standardwert lautet:</p>

<pre>%client.name% %auth-user-name% %datetime% %request% %status% %response.length%</pre><p>Die folgenden Werte k&#246;nnen f&#252;r die Formatzeichenfolge verwendet werden:</p>

<dl><dt><tt>%attribute.<i>name</i>%</tt></dt>
<dd><p>Protokolliert den Wert (durch Aufruf der Methode <tt>toString</tt>) des Anforderungsattributs mit dem angegebenen <i>name</i></p>

</dd>
<dt><tt>%auth-user-name%</tt></dt>
<dd><p>Name des autorisierten Benutzers</p>

</dd>
<dt><tt>%client.name%</tt></dt>
<dd><p>Client-Host-Name</p>

</dd>
<dt><tt>%client.dns%</tt></dt>
<dd><p>Client-DNS</p>

</dd>
<dt><tt>%cookie.<i>name</i>%</tt></dt>
<dd><p>Der Wert des Anforderungs-Cookies mit dem angegebenen <i>name</i></p>

</dd>
<dt><tt>%cookie.value%</tt></dt>
<dd><p>Der Wert des ersten in der Anforderung gefundenen Cookies</p>

</dd>
<dt><tt>%datetime%</tt></dt>
<dd><p>Systemdatum</p>

</dd>
<dt><tt>%request%</tt></dt>
<dd><p>Vollst&#228;ndige HTTP-Anforderungszeile</p>

</dd>
<dt><tt>%status%</tt></dt>
<dd><p>Status</p>

</dd>
<dt><tt>%response.length%</tt></dt>
<dd><p>Inhaltsl&#228;nge der Antwort</p>

</dd>
<dt><tt>%header.referer%</tt></dt>
<dd><p>Referenz-Header</p>

</dd>
<dt><tt>%header.user-agent%</tt></dt>
<dd><p>Benutzeragent-Kopfzeile</p>

</dd>
<dt><tt>%http-method%</tt></dt>
<dd><p>HTTP-Methode</p>

</dd>
<dt><tt>%http-uri%</tt></dt>
<dd><p>HTTP-URI</p>

</dd>
<dt><tt>%query-str%</tt></dt>
<dd><p>HTTP-Abfragezeichenfolge</p>

</dd>
<dt><tt>%http-version%</tt></dt>
<dd><p>HTTP-Protokollversion</p>

</dd>
<dt><tt>%header.accept%</tt></dt>
<dd><p>Annahme-Header</p>

</dd>
<dt><tt>%header.date%</tt></dt>
<dd><p>Datums-Header</p>

</dd>
<dt><tt>%header.if-mod-since%</tt></dt>
<dd><p>Falls-ge&#228;ndert-seit-Header</p>

</dd>
<dt><tt>%header.auth%</tt></dt>
<dd><p>Autorisierungs-Header</p>

</dd>
<dt><tt>%header.<i>any</i>%</tt></dt>
<dd><p>Jeder g&#252;ltige HTTP-Header, der in RFC 2616 definiert ist (<tt>any</tt> ist ebenfalls ein g&#252;ltiger Headerwert; dieser wird hier als Variable angegeben)</p>

</dd>
<dt><tt>%session.<i>name</i>%</tt></dt>
<dd><p>Der Wert des Sitzungsattributs mit dem Namen <i>name</i> oder <tt>NULL-SESSION-ATTRIBUTE-<i>name</i></tt>, wenn das benannte Attribut in der Sitzung nicht vorhanden ist, oder <tt>NULL-SESSION</tt>, wenn keine Sitzung vorhanden ist</p>

</dd>
<dt><tt>%time-taken%</tt></dt>
<dd><p>Dauer der Verarbeitung der einzelnen Anforderungen in Millisekunden</p>

</dd>
<dt><tt>%vs.id%</tt></dt>
<dd><p>ID virtueller Server</p>

</dd>
</dl>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>Weitere Eigenschaften f&#252;r den HTTP-Dienst. Eine Beschreibung der verf&#252;gbaren Eigenschaften finden Sie unter <a href="ref-httpserviceprops.html">Spezifische Eigenschaften des HTTP-Diensts</a>.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-accesslog.html">So konfigurieren Sie den HTTP-Dienst</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>
<p>Keine.</p>



<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
