<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-threadpools"></a><h4>Threadpools</h4>
<a name="indexterm-79"></a><a name="indexterm-80"></a><p>Sie verwenden die Seite Thread Pools (Threadpools) zum Konfigurieren von Threadpools.</p>

<p>Verwenden Sie Threadpools, um einen Dienst auf eine bestimmte Anzahl gleichzeitiger Threads
zu beschr&#228;nken.</p>

<p>Wenn Sie GlassFish-Server erstmalig installieren, stehen standardm&#228;&#223;ig zwei Threadpools zur Verf&#252;gung. Der
Threadpool <tt>http-thread-pool</tt> ist f&#252;r die Verwendung durch Netzwerk-Zielger&#228;te konfiguriert, <tt>thread-pool-1</tt> f&#252;r die
Verwendung durch den ORB f&#252;r RMI/IIOP-Anforderungen. M&#246;glicherweise m&#252;ssen Sie einen Threadpool mit
unterschiedlichen Einstellungen f&#252;r bestimmte Arten von Anwendungen und bestimmte Hardwaresysteme erstellen oder
den standardm&#228;&#223;igen Threadpool an Ihre spezifischen Anforderungen anpassen.</p>

<p>Die Java Virtual Machine (JVM) kann gleichzeitig eine Vielzahl von Ausf&#252;hrungsthreads unterst&#252;tzen.
F&#252;r eine gute Leistung verf&#252;gt GlassFish-Server &#252;ber einen oder mehrere Threadpools. Sie
k&#246;nnen bestimmten Diensten bestimmte Threadpools zuweisen.</p>

<p>Ein Threadpool kann f&#252;r mehrere Dienste verwendet werden. Anforderungs-Threads verarbeiten Benutzeranforderungen. Wenn
der Server eine Anforderung empf&#228;ngt, weist er die Anforderung einem freien Thread
im Threadpool zu. Der Thread f&#252;hrt die Clientanforderung aus und gibt Ergebnisse
zur&#252;ck. Wenn die Anforderung z. B. eine Systemressource verwenden muss, die gegenw&#228;rtig
belegt ist, wartet der Thread, bis die Ressource frei ist, bevor er
die Verwendung dieser Ressource zul&#228;sst.</p>

<p>Geben Sie die Mindestanzahl und die maximale Anzahl von Threads an, die
f&#252;r Anforderungen reserviert sind. Der Threadpool wird gem&#228;&#223; diesen Werten dynamisch angepasst.
Die angegebene Mindestgr&#246;&#223;e des Threadpools weist den Server an, mindestens diese Anzahl
von Threads f&#252;r Anforderungen zu reservieren. Diese Anzahl wird bis zur angegebenen
maximalen Threadpoolgr&#246;&#223;e erh&#246;ht.</p>

<p>Durch das Erh&#246;hen der Anzahl von verf&#252;gbaren Threads f&#252;r einen Prozess kann
dieser Prozess auf eine h&#246;here Anzahl von Anforderungen gleichzeitig reagieren.</p>

<p>F&#252;r jeden Threadpool stehen die folgenden Informationen zur Verf&#252;gung.</p>

<dl><dt>Thread Pool ID (Threadpool-ID)</dt>
<dd><p>Der Name des Threadpools.</p>

</dd>
<dt>Max Thread Pool Size (Maximale Threadpool-Gr&#246;&#223;e)</dt>
<dd><p>Die maximale Anzahl an Threads im Threadpool.</p>

</dd>
<dt>Min Thread Pool Size (Minimale Threadpool-Gr&#246;&#223;e)</dt>
<dd><p>Die minimale Anzahl an Threads im Threadpool. Diese Threads werden bei der Instanziierung des Threadpools erstellt.</p>

</dd>
<dt>Max Queue Size (Maximale Warteschlangengr&#246;&#223;e)</dt>
<dd><p>Die maximale Anzahl von Meldungen, die in die Warteschlange gestellt werden k&#246;nnen, bis Threads f&#252;r ihre Verarbeitung zur Verf&#252;gung stehen.</p>

</dd>
<dt>Idle Thread Timeout (Zeit&#252;berschreitung Leerlauf-Thread)</dt>
<dd><p>Die Anzahl Sekunden, nach der inaktive Threads aus dem Pool entfernt werden.</p>

</dd>
</dl>
<p>Die Tabelle "Threadpools" enth&#228;lt dar&#252;ber hinaus die folgenden Optionen.</p>

<dl><dt>Neu</dt>
<dd><p>Schaltfl&#228;che zum Erstellen eines neuen Threadpools.</p>

</dd>
<dt>L&#246;schen</dt>
<dd><p>Schaltfl&#228;che zum L&#246;schen eines oder mehrerer ausgew&#228;hlter Threadpools.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-threadpoolnew.html">So erstellen Sie einen Threadpool</a></p>

</li>
<li><p><a href="task-threadpooledit.html">So bearbeiten Sie einen Threadpool</a></p>

</li>
<li><p><a href="task-threadpooldelete.html">So l&#246;schen Sie einen Threadpool</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-threadpool-1"><tt>create-threadpool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-threadpools-1"><tt>list-threadpools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-threadpool-1"><tt>delete-threadpool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
