<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-transportedit"></a><h4>Transport bearbeiten</h4>
<a name="indexterm-78"></a><p>Auf der Seite "Transport bearbeiten" k&#246;nnen Sie die Einstellungen eines vorhandenen Transports
&#228;ndern.</p>

<p>Die Seite "Transport bearbeiten" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r Einstellungen, f&#252;r die es Standardwerte gibt. Einstellungen, die nicht &#252;ber Standardwerte verf&#252;gen, k&#246;nnen nicht ge&#228;ndert werden.</p>

</dd>
<dt>Name der Konfiguration</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Name</dt>
<dd><p>Der Name des Transports. Der Name ist ein schreibgesch&#252;tztes Feld. Sie k&#246;nnen nur dann einen Namen festlegen, wenn Sie einen neuen Transport erstellen.</p>

</dd>
<dt>Klassenname</dt>
<dd><p>Der Klassenname der Transportimplementierung. Der Standardwert lautet <tt>com.sun.grizzly.TCPSelectorHandler</tt>.</p>

</dd>
<dt>Auswahlschl&#252;ssel-Behandlungsroutine</dt>
<dd><p>Der Klassenname der Auswahlschl&#252;ssel-Behandlungsroutine. Eine Auswahlschl&#252;ssel-Behandlungsroutine ist eine abstrakte Klasse, die die G&#252;ltigkeitsdauer von Auswahlschl&#252;sseln verwaltet. Wenn Sie keinen Wert angeben, wird eine Standardimplementierung verwendet.</p>

</dd>
<dt>Bytepuffertyp</dt>
<dd><p>Der zu verwendende <tt>ByteBuffer</tt>-Typ. Zur Auswahl stehen <tt>HEAP</tt> und <tt>DIRECT</tt>. Der Standardwert lautet <tt>HEAP</tt>.</p>

</dd>
<dt>Annahmethreads</dt>
<dd><p>Die Anzahl der Prozessoren im Computer. Der Wert &#8211;1 gibt an, dass Grizzly die Anzahl der Annahmethreads basierend auf der Anzahl der Prozessoren im Computer selbst berechnet. Der Standardwert betr&#228;gt 1. </p>

<p>Um die Anzahl der Anforderungsverarbeitungs-Threads festzulegen, setzen Sie den Wert von "Maximale Threadpool-Gr&#246;&#223;e" des Threadpools, der von einem Netzwerk-Zielger&#228;t verwendet wird, das diesen Transport nutzt.</p>

</dd>
<dt>Verbindungsh&#246;chstzahl</dt>
<dd><p>Die maximale Anzahl von ausstehenden Verbindungen auf einem Netzwerk-Zielger&#228;t, das diesen Transport verwendet. Der Standardwert ist 4096.</p>

</dd>
<dt>Puffergr&#246;&#223;e</dt>
<dd><p>Die Gr&#246;&#223;e (in Byte) des Puffers, der f&#252;r Eingabestr&#246;me bereitzustellen ist, die von einem Netzwerk-Zielger&#228;t erstellt werden, das diesen Transport verwendet. Der Standardwert ist 8192.</p>

</dd>
<dt>Leerlaufschl&#252;ssel-Zeit&#252;berschreitung</dt>
<dd><p>Die Anzahl Sekunden, nach der ein Leerlaufschl&#252;ssel abgebrochen und der Kanal geschlossen wird. Der Standardwert ist 30.</p>

</dd>
<dt>Zeit&#252;berschreitung f&#252;r Lesevorgang</dt>
<dd><p>Die Anzahl Millisekunden, die GlassFish-Server w&#228;hrend der Header- und Body-Analysephase eines Lesevorgangs wartet. Der Standardwert betr&#228;gt 30.000.</p>

</dd>
<dt>Zeit&#252;berschreitung bei Selektorabruf</dt>
<dd><p>Die Anzahl Millisekunden, die ein NIO-Selektor das Warten auf Ereignisse (Benutzeranforderungen) blockiert. Der Standardwert ist 1000.</p>

</dd>
<dt>Zeit&#252;berschreitung f&#252;r Schreibvorgang</dt>
<dd><p>Die Anzahl Millisekunden, die GlassFish-Server beim Schreiben der Antwort wartet, bevor der Remote-Client als getrennt betrachtet wird. Der Standardwert betr&#228;gt 30.000.</p>

</dd>
<dt>Konfiguration anzeigen</dt>
<dd><p>Bei aktivierter Option wird die interne Konfiguration von Grizzly in die Serverprotokolle &#252;bertragen. Diese Option kann n&#252;tzliche Informationen f&#252;r die Fehlersuche bereitstellen. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Snoop</dt>
<dd><p>Bei aktivierter Option werden die Anforderungs-/Antwortinformationen im Serverprotokoll abgelegt. Diese Option kann n&#252;tzliche Informationen f&#252;r die Fehlersuche bereitstellen, beeintr&#228;chtigt die Leistung jedoch erheblich. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>TCP keine Verz&#246;gerung</dt>
<dd><p>Bei aktivierter Option ist TCP_NODELAY (auch Nagle-Algorithmus genannt) aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-transportnew.html">So erstellen Sie einen Transport</a></p>

</li>
<li><p><a href="task-transportedit.html">So bearbeiten Sie einen Transport</a></p>

</li>
<li><p><a href="task-transportdelete.html">So l&#246;schen Sie einen Transport</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li>
<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-transport-1"><tt>create-transport</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-transports-1"><tt>list-transports</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-transport-1"><tt>delete-transport</tt>(1)</a></p>

</li></ul>
</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
