<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-protocolfilecacheedit"></a><h4>Dateicache</h4>
<a name="indexterm-74"></a><a name="indexterm-75"></a><p>Auf der Seite "Dateicache" k&#246;nnen Sie Dateicache-Einstellungen f&#252;r ein Netzwerkprotokoll &#228;ndern.</p>

<p>Die Seite "Dateicache" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r alle Einstellungen.</p>

</dd>
<dt>Konfigurationsname</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Protokollname</dt>
<dd><p>Der Name des Protokolls. Das Feld "Protokollname" ist ein schreibgesch&#252;tztes Feld. Sie k&#246;nnen den Namen nur festlegen, wenn Sie ein neues Protokoll erstellen.</p>

</dd>
<dt>Status</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist der Status des Dateizwischenspeichers aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Max Age (Maximales Alter)</dt>
<dd><p>Das maximale Alter in Sekunden f&#252;r einen g&#252;ltigen Cache-Eintrag.</p>

<p>Dieser Parameter steuert, wie lange zwischengespeicherte Informationen verwendet werden, nachdem eine Datei zwischengespeichert wurde. Ein Eintrag, der &#228;lter ist als das angegebene Maximalalter, wird durch einen neuen Eintrag f&#252;r dieselbe Datei ersetzt. Wenn sich die verwendeten Inhalte nur selten &#228;ndern, erh&#246;hen Sie diesen Wert, um die Leistung zu verbessern.</p>

<p>Das optimale maximale Alter h&#228;ngt davon ab, ob die vorhandenen Dateien regelm&#228;&#223;ig ge&#228;ndert werden. Wenn die Dateien beispielsweise vier Mal t&#228;glich in regelm&#228;&#223;igen Abst&#228;nden ge&#228;ndert werden, k&#246;nnen Sie das maximale Alter auf 21600 Sekunden (6 Stunden) festlegen. Andernfalls sollten Sie das maximale Alter auf den l&#228;ngsten Zeitraum einstellen, f&#252;r den die fr&#252;here Version einer Inhaltsdatei auf dem Server verbleiben soll, nachdem die Datei ge&#228;ndert wurde.</p>

<p>Der Standardwert ist 30.</p>

</dd>
<dt>Max Cache Size (Maximale Zwischenspeichergr&#246;&#223;e)</dt>
<dd><p>Die maximale Gesamtgr&#246;&#223;e (in Byte) des Dateizwischenspeichers auf dem Datentr&#228;ger. Der Standardwert ist 10485760.</p>

</dd>
<dt>Max File Count (Maximale Dateizahl)</dt>
<dd><p>Die maximale Anzahl an Dateien, die im Dateicache gespeichert werden k&#246;nnen.</p>

<p>Wenn dieser Wert zu hoch gew&#228;hlt ist, speichert der Server selten verwendete Dateien zwischen, wodurch Arbeitsspeicher vergeudet wird. Ist dieser Wert zu niedrig eingestellt, gehen die Vorteile der Zwischenspeicherung verloren. Probieren Sie verschiedene Werte f&#252;r dieses Attribut aus, um die optimale Einstellung f&#252;r spezifische Anwendungen zu finden.</p>

<p>Der Standardwert ist 1024.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-protocolnew.html">So erstellen Sie ein Protokoll</a></p>

</li>
<li><p><a href="task-protocoledit.html">So bearbeiten Sie ein Protokoll</a></p>

</li>
<li><p><a href="task-protocolssledit.html">So bearbeiten Sie SSL-Einstellungen f&#252;r ein Protokoll</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">So bearbeiten Sie HTTP-Einstellungen f&#252;r ein Protokoll</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">So bearbeiten Sie Dateicache-Einstellungen f&#252;r ein Protokoll</a></p>

</li>
<li><p><a href="task-protocoldelete.html">So l&#246;schen Sie ein Protokoll</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-protocol-1"><tt>create-protocol</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-protocols-1"><tt>list-protocols</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-protocol-1"><tt>delete-protocol</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
