<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managerproptab"></a><h4>Manager-Eigenschaften</h4>
<a name="indexterm-50"></a><a name="indexterm-51"></a><p>Mit dem Sitzungsmanager k&#246;nnen Sie konfigurieren, wie Sitzungen erstellt und aufgel&#246;st werden,
wo der Sitzungsstatus gespeichert wird und wie viele Sitzungen maximal zul&#228;ssig sind.</p>

<p>Auf der Seite "Manager-Eigenschaften" k&#246;nnen Sie Sitzungsmanager-Eigenschaften f&#252;r den Webcontainer hinzuf&#252;gen oder
&#228;ndern.</p>

<p>Die Seite "Manager Properties" (Manager-Eigenschaften) umfasst die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r alle Einstellungen.</p>

</dd>
<dt>Konfigurationsname</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Reap Interval (Reap-Intervall)</dt>
<dd><p>Die Anzahl der Sekunden, bis die Daten zur inaktiven Sitzung aus dem Speicher gel&#246;scht werden. Der Standardwert ist 60.</p>

<p>Legen Sie hierf&#252;r einen niedrigeren Wert fest als f&#252;r die H&#228;ufigkeit der &#196;nderung von Sitzungsdaten. Beispiel: F&#252;r ein Servlet, das die Aufrufe einer stark frequentierten Website z&#228;hlt, sollte ein m&#246;glichst niedriger Wert festgelegt werden (1 Sekunde), da anderenfalls bei jedem Neustart des Servers die letzten Aufrufe verloren gehen k&#246;nnten.</p>

</dd>
<dt>Max Sessions (Maximale Sitzungen)</dt>
<dd><p>Die maximale Anzahl an Sitzungen, die sich im Cache befinden k&#246;nnen. Beim Wert &#8211;1 ist die Anzahl der Sitzungen unbegrenzt. Der Standardwert ist &#8211;1. </p>

<p>Nach Erreichen des Grenzwerts wird bei dem Versuch, eine neue Sitzung zu erstellen, die Ausnahme <tt>IllegalStateException</tt> ausgel&#246;st.</p>

</dd>
<dt>Session File Name (Sitzungsdateiname)</dt>
<dd><p>Der absolute oder relative Pfad zu dem Verzeichnis, in dem der Sitzungsstatus zwischen Anwendungsneustarts gespeichert wird, sofern die Speicherung des Status m&#246;glich ist. Wenn kein Pfad festgelegt wird, wird der Sitzungsstatus nicht gespeichert. Standardm&#228;&#223;ig ist kein Pfad festgelegt.</p>

<p>Ein relativer Pfad wird relativ zum tempor&#228;ren Verzeichnis f&#252;r diese Webanwendung angegeben.</p>

</dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>Weitere Eigenschaften f&#252;r den Sitzungsmanager. Der GlassFish-Server definiert keine zus&#228;tzlichen Eigenschaften f&#252;r den Sitzungsmanager.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-webcontainergeneral.html">So konfigurieren Sie die allgemeinen Eigenschaften des Webcontainers</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">So konfigurieren Sie die Sitzungseigenschaften des Webcontainers</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">So konfigurieren Sie die Manager-Eigenschaften des Webcontainers</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">So konfigurieren Sie die Speichereigenschaften des Webcontainers</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">So konfigurieren Sie Verf&#252;gbarkeitseinstellungen f&#252;r den Webcontainer</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>
<p>Keine.</p>



<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
