<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-virtualservercreate"></a><h4>So erstellen Sie einen virtuellen Server</h4><a name="indexterm-18"></a><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Konfigurationsknoten.</b></li>
<li><b>W&#228;hlen Sie unter dem Konfigurationsknoten den Knoten "Virtuelle Server".</b><p>Die Seite "Virtuelle Server" wird ge&#246;ffnet. </p></li>
<li><b>Klicken Sie auf der Seite "Virtuelle Server" auf "Neu".</b><p>Die Seite "Neuer virtueller Server" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie im Feld "ID" einen Wert ein, der den virtuellen Server
intern identifiziert. </b><p>Dieser Wert wird HTTP-Clients nicht angezeigt. Die Hostnamen, die gegen&#252;ber HTTP-Clients offengelegt
werden, m&#252;ssen im Feld "Hosts" angegeben werden.</p></li>
<li><b>Geben Sie im Feld "Hosts" die Hostnamen oder IP-Adressen f&#252;r den Computer
ein, auf dem der Server ausgef&#252;hrt wird.</b><p>Verwenden Sie entweder tats&#228;chliche oder virtuelle Hostnamen, die beim DNS-Server f&#252;r Ihr
Netzwerk registriert sind (und auf einem UNIX-System in der Datei <tt>/etc/hosts</tt>).</p><p>Der Standardwert ist der Systemeigenschaftswert <tt>${com.sun.aas.hostName}</tt>.</p></li>
<li><b>W&#228;hlen Sie die Option "Status" f&#252;r den neuen virtuellen Server aus.</b><p>Der virtuelle Server kann den Status "Ein" (d.&#160;h. aktiv), "Aus" oder "Deaktiviert"
haben. Der Standardwert ist "Ein".</p></li>
<li><b>W&#228;hlen Sie eine SSL-Option f&#252;r den neuen virtuellen Server aus.</b><p>Standardm&#228;&#223;ig &#252;bernimmt ein virtueller Server die SSO-Einstellung (Single Sign-On) des HTTP-Diensts. W&#228;hlen
Sie "Aktiviert" oder "Deaktiviert", um die HTTP-Diensteinstellung au&#223;er Kraft zu setzen, indem
Sie SSO f&#252;r diesen virtuellen Server aktivieren oder deaktivieren.</p><p>Anwendungs&#252;bergreifendes SSO f&#252;r GlassFish-Server wird von Servlets und JSP-Dateien unterst&#252;tzt. Diese Funktion
erm&#246;glicht es mehreren Anwendungen, f&#252;r die dieselben Benutzeranmeldeinformationen erforderlich sind, diese Informationen
gemeinsam zu nutzen. Auf diese Weise muss sich der Benutzer nicht bei
jeder Anwendung einzeln anmelden. </p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "Netzwerk-Zielger&#228;te" ein oder mehrere Netzwerk-Zielger&#228;te aus, oder
lassen Sie das Feld leer.</b></li>
<li><b>W&#228;hlen Sie in der Dropdown-Liste "Standardwebmodul" das Modul aus, das auf alle
Antworten soll, die nicht anderen, dem virtuellen Server bereitgestellten Webmodulen zugeordnet werden
kann.</b><p>Wenn kein Standardwebmodul angegeben ist, wird das Webmodul verwendet, das einen leeren
Kontext aufweist. Ist kein solches Webmodul vorhanden, wird ein Standardwebmodul f&#252;r das
System erstellt und verwendet.</p></li>
<li><b>Geben Sie im Feld "Protokolldatei" den Pfad zu der Datei ein, in
der Meldungen f&#252;r diesen virtuellen Server protokolliert werden.</b><p>Standardm&#228;&#223;ig werden Protokollmeldungen im Standard-Serverprotokoll gespeichert, <tt></tt><i>domain-dir</i><tt>/logs/server.log </tt>.</p></li>
<li><b>Geben Sie im Feld "Docroot" den absoluten Pfad zum Rootdokumentverzeichnis des Servers
ein.</b><p>Wenn dieses Feld leer bleibt, wird <tt></tt><i>domain-dir</i><tt>/docroot</tt> verwendet.</p></li>
<li><b>Aktivieren Sie die Option "Zugriffsprotokollierung", um die Zugriffsprotokollierung zu aktivieren oder zu
deaktivieren.</b><p>Alternativ k&#246;nnen Sie auch angeben, ob die Zugriffsprotokollierung vom HTTP-Dienst &#252;bernommen wird.
Standardm&#228;&#223;ig wird sie vom HTTP-Dienst &#252;bernommen.</p></li>
<li><b>Geben Sie im Feld "Verzeichnis" den absoluten Verzeichnispfad zu den Serverzugriffsprotokollen ein.</b><p>Der Standardwert ist <tt></tt><i>domain-dir</i><tt>/logs/access</tt>.</p></li>
<li>(Optional) <b>Geben Sie im Abschnitt "Weitere Eigenschaften" zus&#228;tzliche Eigenschaften f&#252;r den virtuellen Server
an.</b><p>Information zu verf&#252;gbaren Eigenschaften finden Sie unter <a href="ref-virtualserverprops.html">F&#252;r virtuelle Server spezifische Eigenschaften</a>.</p><p>Um eine Eigenschaft hinzuzuf&#252;gen, klicken Sie auf die Schaltfl&#228;che "Eigenschaft hinzuf&#252;gen". Geben
Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld
"Name" und den Eigenschaftswert in das Feld "Wert" ein.</p></li>
<li><b>Klicken Sie auf "OK".</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-virtualserveredit.html">So bearbeiten Sie einen virtuellen Server</a></p>

</li>
<li><p><a href="task-virtualserverdelete.html">So l&#246;schen Sie einen virtuellen Server</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
