<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-networklistenernew"></a><h3>So erstellen Sie ein Netzwerk-Zielger&#228;t</h3><a name="indexterm-21"></a><p><b>Bevor Sie beginnen</b></p><p>Wenn Sie ein Netzwerk-Zielger&#228;t erstellen, k&#246;nnen Sie gleichzeitig auch ein vom Netzwerk-Zielger&#228;t
zu verwendendes Protokoll erstellen. Alternativ k&#246;nnen Sie ein Protokoll verwenden, das Sie
zuvor erstellt haben. In der Regel liegt eine 1:1-Beziehung zwischen einem Netzwerk-Zielger&#228;t
und dem verbundenen Protokoll vor, dies ist jedoch nicht obligatorisch.</p>

<ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Konfigurationsknoten.</b></li>
<li><b>Erweitern Sie unter dem Konfigurationsknoten den Knoten "Netzwerk konfigurieren".</b></li>
<li><b>W&#228;hlen Sie unter dem Knoten "Netzwerkkonfiguration" den Knoten "Netzwerk-Zielger&#228;te".</b><p>Die Seite "Netzwerk-Zielger&#228;te" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Netzwerkzielger&#228;te" auf "Neu".</b><p>Die Seite "Neues Netzwerk-Zielger&#228;t" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie im Feld "Name" einen Namen f&#252;r das Netzwerk-Zielger&#228;t ein.</b><p>Der Name eines Netzwerk-Zielger&#228;ts darf nicht mit einer Ziffer beginnen.</p></li>
<li><b>Geben Sie im Feld "Protokoll" das Protokoll an, das mit dem Netzwerk-Zielger&#228;t
verbunden werden soll.</b><ul>
<li><b>W&#228;hlen Sie "Neues Protokoll erstellen", um ein neues Protokoll mit Standardeinstellungen zu
erstellen. W&#228;hlen Sie au&#223;erdem aus der Dropdown-Liste "Virtueller Server" den virtuellen Server
aus, der mit dem Protokoll verbunden werden soll.</b><p>Als Protokollname wird standardm&#228;&#223;ig der Name des Netzwerk-Zielger&#228;ts mit dem Zusatz <tt>-protocol</tt>
verwendet, dieser Name kann jedoch ge&#228;ndert werden.</p></li>
<li><b>W&#228;hlen Sie "Vorhandenes Protokoll verwenden", und w&#228;hlen Sie dann ein Protokoll aus
der Dropdown-Liste.</b><p>Wenn Sie diese Option w&#228;hlen, haben Sie im Normalfall zuvor bereits das
Protokoll f&#252;r dieses Zielger&#228;t erstellt.</p></li></ul><p>Das Protokoll kann nur bei der Erstellung des Netzwerk-Zielger&#228;ts angegeben werden. Sie
k&#246;nnen das verbundene Protokoll sp&#228;ter nicht &#228;ndern.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Status", um das Netzwerk-Zielger&#228;t zu aktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert. Wenn das Zielger&#228;t deaktiviert ist, f&#252;hren alle Versuche,
eine Verbindung zum Zielger&#228;t herzustellen, zu einer Socket-Ausnahme (<tt>java.net.ConnectException</tt>).</p><p>In Versionen vor GlassFish-Server 9.1 wurde bei einem Zielger&#228;t, dessen Attribut "Aktiviert"
auf "false" gesetzt war, f&#252;r alle an das Zielger&#228;t gesendeten Anforderungen der
Antwortcode 404 zur&#252;ckgegeben. Um dieses Verhalten in der aktuellen Version von GlassFish-Server zu
erzielen, setzen Sie den Status des Zielger&#228;ts auf "aktiviert" und den Status
aller verbundenen virtuellen Server auf "Deaktiviert". Die mit einem virtuellen Server verbundenen
Zielger&#228;te werden in der Dropdown-Liste "Netzwerk-Zielger&#228;te" des Servers aufgef&#252;hrt.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Sicherheit", um Sicherheit f&#252;r das vom Netzwerk-Zielger&#228;t verwendete
Protokoll zu aktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "JK-Zielger&#228;t", um anzugeben, dass das Zielger&#228;t das Apache-Protokoll
<tt>mod-jk</tt> unterst&#252;tzt.</b><p>Das Protokoll <tt>mod-jk</tt> ist ein propriet&#228;res Kommunikations-/Netzwerkprotokoll zwischen dem Apache-Webserver <tt>httpd</tt> und
einer Backend-Instanz von GlassFish-Server. Wenn das Zielger&#228;t dieses Protokoll unterst&#252;tzt, wird davon
ausgegangen, dass <tt>httpd</tt> den gesamten statischen Inhalt verarbeitet, w&#228;hrend alle Anforderungen von
dynamischen Ressourcen (d.&#160;h. Servlets und JSPs) an das <tt>mod-jk</tt>-f&#228;hige Zielger&#228;t von GlassFish-Server
weitergeleitet werden, wobei das Protokoll <tt>mod-jk</tt> verwendet wird. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Geben Sie im Feld "Port" die Nummer des Ports ein, den das
Netzwerk-Zielger&#228;t &#252;berwachen soll. </b><p>G&#252;ltige Werte sind 1 bis 65535. Bei einem UNIX-System sind zum Erstellen
von Sockets, die die Ports 1 bis 1024 &#252;berwachen, Superuser-Rechte erforderlich.</p></li>
<li><b>Geben Sie im Feld "Adresse" die IP-Adresse ein, &#252;ber die die Verbindung
zum Netzwerkzielger&#228;t hergestellt wird. </b><p>Die Adresse kann als Punktepaar oder in IPv6-Notation angegeben werden. Beim Wert
<tt>any</tt> (f&#252;r <tt>INADDR_ANY</tt>) werden alle IP-Adressen &#252;berwacht. Auch die Angabe eines Hostnamens
ist m&#246;glich.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "Threadpool" den Threadpool aus, der mit dem
Netzwerk-Zielger&#228;t verbunden werden soll.</b><p>Normalerweise w&#228;hlen Sie einen der beiden Threadpools aus, die bei der Installation
von GlassFish-Server konfiguriert werden.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "Transport" den Transporttyp aus, den das Netzwerkzielger&#228;t
verwenden soll.</b><p>Standardm&#228;&#223;ig steht <tt>tcp</tt> als einzige Option zur Auswahl.</p></li>
<li><b>Klicken Sie auf OK.</b></li></ol><p></b>N&#228;chste Schritte</b></p><p>Wenn Sie Sicherheit f&#252;r das Netzwerk-Zielger&#228;t aktiviert haben, k&#246;nnen Sie auf der
Registerkarte "SSL" die SSL-Einstellungen des vom Netzwerk-Zielger&#228;t verwendeten Protokolls bearbeiten.</p>

<p></b>Siehe auch</b></p>
<ul><li><p><a href="task-networklisteneredit.html">So bearbeiten Sie ein Netzwerk-Zielger&#228;t</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">So l&#246;schen Sie ein Netzwerk-Zielger&#228;t</a></p>

</li>
<li><p><a href="task-protocolnew.html">So erstellen Sie ein Protokoll</a></p>

</li>
<li><p><a href="task-protocoledit.html">So bearbeiten Sie ein Protokoll</a></p>

</li>
<li><p><a href="task-protocolssledit.html">So bearbeiten Sie SSL-Einstellungen f&#252;r ein Protokoll</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">So bearbeiten Sie HTTP-Einstellungen f&#252;r ein Protokoll</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">So bearbeiten Sie Dateicache-Einstellungen f&#252;r ein Protokoll</a></p>

</li>
<li><p><a href="task-protocoldelete.html">So l&#246;schen Sie ein Protokoll</a></p>

</li>
<li><p><a href="task-transportnew.html">So erstellen Sie einen Transport</a></p>

</li>
<li><p><a href="task-transportedit.html">So bearbeiten Sie einen Transport</a></p>

</li>
<li><p><a href="task-transportdelete.html">So l&#246;schen Sie einen Transport</a></p>

</li>
<li><p><a href="task-virtualservercreate.html">So erstellen Sie einen virtuellen Server</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
