<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstanceapplications"></a><h4>Applications</h4>
<a name="indexterm-208"></a><a name="indexterm-209"></a><p>La page Applications permet d'effectuer les t&#226;ches suivantes sur l'instance de GlassFish
Server autonome s&#233;lectionn&#233;e&#160;:</p>


<ul><li><p>Afficher et g&#233;rer les applications d&#233;j&#224; d&#233;ploy&#233;es sur l'instance</p>

</li>
<li><p>D&#233;ployer davantage d'applications sur l'instance</p>

</li></ul>
<p>Le champ Nom de l'instance est un champ en lecture seule qui
affiche le nom de l'instance active.</p>

<p>La page Applications pr&#233;sente la liste des applications d&#233;ploy&#233;es sur l'instance s&#233;lectionn&#233;e.
Pour chaque application, les informations suivantes sont fournies&#160;:</p>

<dl><dt>Nom</dt>
<dd><p>Nom de l&#8217;application.</p>

<p>Le nom peut &#234;tre suivi d'un identificateur de version facultatif dont il est s&#233;par&#233; par un signe deux-points (<tt>:</tt>). Pour plus d'informations sur le module et les versions d'application, reportez-vous &#224; la section <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions du <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Activ&#233;e</dt>
<dd><p>Mention indiquant si l'application est activ&#233;e&#160;:</p>


<ul><li><p>Si l'application est activ&#233;e, une coche (&#10003;) s'affiche.</p>

</li>
<li><p>Si l'application est d&#233;sactiv&#233;e, une croix (&#10007;) s'affiche.</p>

</li></ul>
</dd>
<dt>LB activ&#233;</dt>
<dd><p>Mention indiquant si l'application est activ&#233;e pour l'&#233;quilibrage de charge&#160;:</p>


<ul><li><p>Si l'application est activ&#233;e pour l'&#233;quilibrage de charge, une coche (&#10003;) s'affiche.</p>

</li>
<li><p>Si l'application est d&#233;sactiv&#233;e pour l'&#233;quilibrage de charge, une croix (&#10007;) s'affiche.</p>

</li></ul>
</dd>
<dt>Moteurs</dt>
<dd><p>Types de conteneurs utilis&#233;s par l'application. Voici les diff&#233;rents types de conteneurs&#160;:</p>


<ul><li><p><tt>web</tt></p>

</li>
<li><p><tt>webservices</tt></p>

</li>
<li><p><tt>ejb</tt></p>

</li>
<li><p><tt>connector</tt></p>

</li>
<li><p><tt>appclient</tt></p>

</li>
<li><p><tt>weld</tt> - conteneur Contextes et Injection de d&#233;pendance pour des applications de la plate-forme Java&#160;EE)</p>

</li></ul>
</dd>
</dl>
<p>Le tableau Applications d&#233;ploy&#233;es contient &#233;galement les options suivantes. </p>

<dl><dt>D&#233;ployer</dt>
<dd><p>Bouton permettant de d&#233;ployer une application.</p>

</dd>
<dt>Annuler le d&#233;ploiement</dt>
<dd><p>Bouton permettant d&#8217;annuler le d&#233;ploiement d&#8217;une ou de plusieurs applications s&#233;lectionn&#233;es.</p>

<p>L'annulation du d&#233;ploiement d'une application supprime l'application de toutes les cibles et du domaine. Lorsque le d&#233;ploiement d'une application est annul&#233;, l'application n'est plus r&#233;pertori&#233;e sur la page <a href="../../../common/fr/help/ref-applications.html">Applications</a> qui affiche toutes les applications d&#233;ploy&#233;es dans GlassFish Server. </p>

<p>Pour supprimer des applications de la cible active uniquement, utilisez le bouton Supprimer sur cette page. </p>

</dd>
<dt>Supprimer</dt>
<dd><p>Bouton permettant de supprimer une ou plusieurs applications s&#233;lectionn&#233;es. </p>

<p>La suppression d'une application supprime l'application de la cible active uniquement. Lorsqu'une application est supprim&#233;e d'une cible, elle reste r&#233;pertori&#233;e sur la page <a href="../../../common/fr/help/ref-applications.html">Applications</a>, qui affiche toutes les applications d&#233;ploy&#233;es dans GlassFish Server. L'application reste &#233;galement d&#233;ploy&#233;e sur les autres cibles sur lesquelles elle a &#233;t&#233; d&#233;ploy&#233;e. </p>

<p>Pour supprimer des applications de toutes les cibles et du domaine, utilisez le bouton Annuler le d&#233;ploiement sur cette page. </p>

</dd>
<dt>Plus d&#8217;actions</dt>
<dd><p>Liste d&#233;roulante qui proc&#232;de &#224; d'autres actions sur une ou plusieurs applications s&#233;lectionn&#233;es.</p>

<dl><dt>Activer</dt>
<dd><p>Active une ou plusieurs applications s&#233;lectionn&#233;es.</p>

</dd>
<dt>D&#233;sactiver</dt>
<dd><p>D&#233;sactive une ou plusieurs applications s&#233;lectionn&#233;es.</p>

</dd>
<dt>&#201;quilibreur de charge activ&#233;</dt>
<dd><p>Active une ou plusieurs applications s&#233;lectionn&#233;es pour l'&#233;quilibrage de charge.</p>

</dd>
<dt>&#201;quilibreur de charge d&#233;sactiv&#233;</dt>
<dd><p>D&#233;sactive une ou plusieurs applications s&#233;lectionn&#233;es pour l'&#233;quilibrage de charge.</p>

</dd>
</dl>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-standalone-instance-app-deploy.html">D&#233;ployer une application sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">R&#233;pertorier les applications d&#233;ploy&#233;es sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Annuler le d&#233;ploiement d'applications d'une instance GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Supprimer des applications d'une instance autonome GlassFish Server </a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Modifier une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Activer ou d&#233;sactiver une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Activer ou d&#233;sactiver l'&#233;quilibrage de charge pour une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li></ul>
<h5>Sous-commandes <tt>asadmin</tt> &#233;quivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=deploy-1"><tt>deploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-1"><tt>disable</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-http-lb-application-1"><tt>disable-http-lb-application</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-1"><tt>enable</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-http-lb-application-1"><tt>enable-http-lb-application</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-applications-1"><tt>list-applications</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
