<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterinstanceedit"></a><h4>Informations g&#233;n&#233;rales</h4>
<a name="indexterm-178"></a><a name="indexterm-179"></a><a name="indexterm-180"></a><p>La page Informations g&#233;n&#233;rales contient les options suivantes.</p>

<dl><dt>D&#233;marrage</dt>
<dd><p>Bouton permettant de d&#233;marrer l'instance. Si l'instance est en cours d'ex&#233;cution, ce bouton est d&#233;sactiv&#233;.</p>

</dd>
<dt>Arr&#234;ter</dt>
<dd><p>Bouton permettant d'arr&#234;ter l'instance. Si l'instance est arr&#234;t&#233;e, ce bouton est d&#233;sactiv&#233;.</p>

</dd>
<dt>Red&#233;marrer</dt>
<dd><p>Bouton permettant de red&#233;marrer l'instance. Si l'instance est arr&#234;t&#233;e, ce bouton est d&#233;sactiv&#233;.</p>

</dd>
<dt>Afficher les journaux</dt>
<dd><p>Bouton permettant d'afficher les journaux de l'instance.</p>

</dd>
<dt>R&#233;cup&#233;rer les transactions</dt>
<dd><p>Bouton permettant de r&#233;cup&#233;rer les transactions de l'instance.</p>

</dd>
<dt>Nom du cluster</dt>
<dd><p>Nom qui a &#233;t&#233; assign&#233; au cluster lorsque le cluster a &#233;t&#233; cr&#233;&#233;. Le fait de cliquer sur le nom ouvre la page <a href="ref-clustergeneral.html">General Information</a> du cluster.</p>

</dd>
<dt>Nom d&#8217;instance</dt>
<dd><p>Nom affect&#233; &#224; l'instance lors de son ajout au cluster. Ce champ est en lecture seule.</p>

</dd>
<dt>Statut</dt>
<dd><p>Mention indiquant si l'instance est en cours d'ex&#233;cution, doit &#234;tre red&#233;marr&#233;e pour &#234;tre mise &#224; jour avec les modifications de la configuration ou n'est pas en cours d'ex&#233;cution. Ce champ est en lecture seule.</p>

</dd>
<dt>JVM</dt>
<dd><p>Si vous cliquez sur Rapport JVM, une fen&#234;tre distincte s&#8217;ouvre et affiche des rapports sur la Java Virtual Machine, notamment un rapport de synth&#232;se, un rapport de gestion de m&#233;moire et de collecte de d&#233;chets, un rapport de chargement de classes et le vidage des threads en cours.</p>

</dd>
<dt>N&#339;ud</dt>
<dd><p>Nom du n&#339;ud sur lequel se trouve l'instance. Le fait de cliquer sur le nom ouvre la page <a href="ref-nodeedit.html">Modifier le n<IMG alt="oelig" SRC="ents/oelig.gif" border="0">ud</a> pour le n&#339;ud.</p>

</dd>
<dt>Configuration</dt>
<dd><p>Configuration &#224; laquelle l'instance fait r&#233;f&#233;rence. Le fait de cliquer sur la configuration ouvre la page <a href="../../../common/fr/help/ref-configuration.html">Configurations</a> de l'instance.</p>

</dd>
<dt>Ports HTTP</dt>
<dd><p>Liste s&#233;par&#233;e par des virgules des num&#233;ros des ports sur lesquels l'instance est &#224; l'&#233;coute des types de requ&#234;tes suivants&#160;:</p>


<ul><li><p>Requ&#234;tes d'administration</p>

</li>
<li><p>Requ&#234;tes HTTP</p>

</li>
<li><p>Requ&#234;tes HTTPS</p>

</li></ul>
<p>Ce champ est en lecture seule.</p>

</dd>
<dt>Ports IIOP</dt>
<dd><p>Liste s&#233;par&#233;e par des virgules des num&#233;ros des ports utilis&#233;s par l'instance pour les types de connexion suivants&#160;:</p>


<ul><li><p>Connexion IIOP s&#233;curis&#233;e</p>

</li>
<li><p>Connexions IIOP s&#233;curis&#233;es avec authentification du client</p>

</li>
<li><p>Connexions IIOP</p>

</li></ul>
<p>Ce champ est en lecture seule.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-start-clustered-instances.html">D&#233;marrer les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Arr&#234;ter les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">Afficher les journaux d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-recovertransactions.html">R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li></ul>
<h5>Sous-commandes <tt>asadmin</tt> &#233;quivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=restart-instance-1"><tt>restart-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-instance-1"><tt>stop-instance</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
