<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterinstancenew"></a><h4>Nouvelle instance de serveur clusteris&#233;e</h4>
<a name="indexterm-175"></a><a name="indexterm-176"></a><a name="indexterm-177"></a><p>La page Nouvelle instance de serveur clusteris&#233;e vous permet d'ajouter une instance
de GlassFish Server &#224; un cluster existant.</p>

<p>Elle contient les options suivantes.</p>

<dl><dt>Nom du cluster</dt>
<dd><p>Nom qui a &#233;t&#233; assign&#233; au cluster lorsque le cluster a &#233;t&#233; cr&#233;&#233;. Ce champ est en lecture seule.</p>

</dd>
<dt>Nom d&#8217;instance</dt>
<dd><p>Nom de l'instance en cours de cr&#233;ation. </p>

<p>Le nom doit respecter les exigences suivantes&#160;:</p>


<ul><li><p>Le nom doit commencer par une lettre, un chiffre ou un caract&#232;re de soulignement.</p>

</li>
<li><p>Le nom ne peut contenir que les caract&#232;res suivants&#160;:</p>


<ul><li><p>Lettres minuscules</p>

</li>
<li><p>Lettres majuscules</p>

</li>
<li><p>Chiffres</p>

</li>
<li><p>Trait d'union</p>

</li>
<li><p>Point</p>

</li>
<li><p>Caract&#232;re de soulignement</p>

</li></ul>
</li>
<li><p>Le nom doit &#234;tre unique dans le domaine et ne doit pas &#234;tre le nom d'une autre instance de GlassFish Server, d'un cluster, d'une configuration nomm&#233;e ou d'un n&#339;ud.</p>

</li>
<li><p>Le nom ne doit pas &#234;tre <tt>domain</tt>, <tt>server</tt> ou tout autre mot-cl&#233; r&#233;serv&#233; par GlassFish Server.</p>

</li></ul>
</dd>
<dt>N&#339;ud</dt>
<dd><p>Liste d&#233;roulante des n&#339;uds existants d&#233;finissant les h&#244;tes sur lesquels l'instance peut r&#233;sider. Un n&#339;ud doit &#234;tre s&#233;lectionn&#233; dans la liste. Si l'instance doit &#234;tre cr&#233;&#233;e sur l'h&#244;te h&#233;bergeant le serveur d'administration de domaine (DAS), utilisez le n&#339;ud pr&#233;d&#233;fini <tt>localhost-<i>domain</i></tt>.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-create-clustered-instance.html">Ajouter une instance de GlassFish Server &#224; un cluster</a></p>

</li></ul>
<h5>Sous-commandes <tt>asadmin</tt> &#233;quivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-instance-1"><tt>create-instance</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
