<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clustersystemproperties"></a><h4>Propri&#233;t&#233;s syst&#232;me de cluster</h4>
<a name="indexterm-191"></a><a name="indexterm-192"></a><p>La page Propri&#233;t&#233;s syst&#232;me de cluster affiche la liste des propri&#233;t&#233;s syst&#232;me
Java d&#233;finies pour le cluster s&#233;lectionn&#233;. Les propri&#233;t&#233;s syst&#232;me Java sont transmises
au lanceur d'application Java par l'interm&#233;diaire de l'option <tt>-D</tt> du lanceur d'application
Javaau d&#233;marrage de &#38;ProductName ;.</p>

<p>Le champ Nom du cluster est un champ en lecture seule qui
affiche le nom du cluster s&#233;lectionn&#233;.</p>

<p>Pour chaque propri&#233;t&#233;, les informations suivantes sont affich&#233;es&#160;:</p>

<dl><dt>Nom de la variable d&#8217;instance</dt>
<dd><p>Nom de la propri&#233;t&#233; syst&#232;me.</p>

</dd>
<dt>Valeur actuelle</dt>
<dd><p>Valeur actuellement d&#233;finie pour la propri&#233;t&#233;. Ce champ est en lecture seule.</p>

</dd>
<dt>Remplacer la valeur</dt>
<dd><p>Valeur sur laquelle la propri&#233;t&#233; sera d&#233;finie apr&#232;s l'enregistrement des modifications.</p>

</dd>
</dl>
<p>Le tableau Propri&#233;t&#233;s suppl&#233;mentaires contient &#233;galement les options suivantes.</p>

<dl><dt>Ajouter une propri&#233;t&#233;</dt>
<dd><p>Bouton permettant d'ajouter une propri&#233;t&#233;. Le fait de cliquer sur ce bouton permet d'ajouter une ligne au tableau Propri&#233;t&#233;s suppl&#233;mentaires.</p>

</dd>
<dt>Supprimer des propri&#233;t&#233;s</dt>
<dd><p>Bouton permettant de supprimer une ou plusieurs propri&#233;t&#233;s s&#233;lectionn&#233;es. Toute propri&#233;t&#233; supprim&#233;e revient &#224; sa valeur par d&#233;faut ou, si aucune valeur par d&#233;faut n'est d&#233;finie, n'est pas d&#233;finie.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-config-sys-properties-defaults.html">D&#233;finir les valeurs par d&#233;faut des propri&#233;t&#233;s syst&#232;me de configuration</a></p>

</li></ul>
<h5>Sous-commandes <tt>asadmin</tt> &#233;quivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-system-properties-1"><tt>create-system-properties</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-system-property-1"><tt>delete-system-property</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-system-properties-1"><tt>list-system-properties</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
