<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstanceproperties"></a><h4>Propri&#233;t&#233;s de l&#8217;instance</h4>
<a name="indexterm-216"></a><a name="indexterm-217"></a><a name="indexterm-218"></a><p>La page Propri&#233;t&#233;s de l'instance affiche une liste des propri&#233;t&#233;s d&#233;finies pour
l'instance de GlassFish Server active. Ces propri&#233;t&#233;s ajoutent des informations de configuration
facultatives relatives &#224; l'instance.</p>

<p>Le champ Nom de l'instance est un champ en lecture seule qui
affiche le nom de l'instance active.</p>

<p>Pour chaque propri&#233;t&#233;, les informations suivantes sont affich&#233;es&#160;:</p>

<dl><dt>Nom</dt>
<dd><p>Nom de la propri&#233;t&#233;.</p>

</dd>
<dt>Valeur</dt>
<dd><p>Valeur de la propri&#233;t&#233; d&#233;finie pour l'instance s&#233;lectionn&#233;e.</p>

</dd>
<dt>Description</dt>
<dd><p>Texte de description qui fournit de plus amples informations sur la propri&#233;t&#233;.</p>

</dd>
</dl>
<p>Le tableau Propri&#233;t&#233;s suppl&#233;mentaires contient &#233;galement les options suivantes.</p>

<dl><dt>Ajouter une propri&#233;t&#233;</dt>
<dd><p>Bouton permettant d'ajouter une propri&#233;t&#233;. Le fait de cliquer sur ce bouton permet d'ajouter une ligne au tableau Propri&#233;t&#233;s suppl&#233;mentaires.</p>

</dd>
<dt>Supprimer des propri&#233;t&#233;s</dt>
<dd><p>Bouton permettant de supprimer une ou plusieurs propri&#233;t&#233;s s&#233;lectionn&#233;es. Toute propri&#233;t&#233; supprim&#233;e revient &#224; sa valeur par d&#233;faut ou, si aucune valeur par d&#233;faut n'est d&#233;finie, n'est pas d&#233;finie.</p>

</dd>
</dl>
<p>GlassFish Server d&#233;finit les propri&#233;t&#233;s d'instance suivantes&#160;:</p>

<dl><dt><tt>rendezvousOccurred</tt></dt>
<dd><p>Indique si l'instance a contact&#233; le serveur d'administration de domaine (DAS). Les valeurs possibles sont&#160;:</p>

<dl><dt><tt>true</tt></dt>
<dd><p>L'instance a contact&#233; le DAS.</p>

</dd>
<dt><tt>false</tt></dt>
<dd><p>L'instance n'a <b>pas</b> contact&#233; le DAS.</p>

</dd>
</dl>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-set-props-standalone-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server autonome</a></p>

</li></ul>
<h5>Sous-commandes <tt>asadmin</tt> &#233;quivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=get-1"><tt>get</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-1"><tt>list</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=set-1"><tt>set</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
