<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>Nouveau cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouveau cluster permet de cr&eacute;er un cluster.</p>
<p>Elle contient les options suivantes&nbsp;:</p>
<dl>
<dt>Nom du cluster</dt>
<dd>
<p>Nom du cluster.</p>
<p>Le nom doit respecter les exigences suivantes&nbsp;:</p>
<ul>
<li>
<p>Il ne peut contenir que des caract&egrave;res&nbsp;ASCII.</p>
</li>
<li>
<p>Il doit commencer par une lettre, un chiffre ou un trait de soulignement.</p>
</li>
<li>
<p>Il ne peut contenir que les caract&egrave;res suivants&nbsp;:</p>
<ul>
<li>
<p>Lettres minuscules</p>
</li>
<li>
<p>Lettres majuscules</p>
</li>
<li>
<p>Chiffres</p>
</li>
<li>
<p>Trait d'union</p>
</li>
<li>
<p>Point</p>
</li>
<li>
<p>Trait de soulignement</p>
</li>
</ul>
</li>
<li>
<p>Le nom du noeud doit &ecirc;tre unique dans le domaine&nbsp;; il ne doit pas appartenir &agrave; un autre cluster, &agrave; une configuration nomm&eacute;e, &agrave; une instance de GlassFish&nbsp;Server ou &agrave; un noeud.</p>
</li>
<li>
<p>Il ne doit pas &ecirc;tre <code>domain</code>, <code>server</code> ou tout autre mot-cl&eacute; r&eacute;serv&eacute; par GlassFish&nbsp;Server.</p>
</li>
</ul>
</dd>
<dt>Configuration</dt>
<dd>
<p>Liste d&eacute;roulante des configurations nomm&eacute;es existantes pouvant &ecirc;tre utilis&eacute;es par le cluster. Un cluster n&eacute;cessite une configuration nomm&eacute;e qui d&eacute;finit la configuration de toutes les instances qu'il contient. Vous devez s&eacute;lectionner une configuration dans la liste. Le cluster utilisera la configuration s&eacute;lectionn&eacute;e lors de sa cr&eacute;ation.</p>
</dd>
<dt>Cr&eacute;er une copie de la configuration s&eacute;lectionn&eacute;e</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la configuration choisie est copi&eacute;e lors de la cr&eacute;ation du cluster. Le nom <i>cluster-name</i><code>-config</code> est affect&eacute; &agrave; la copie de la configuration, <i>cluster-name</i> &eacute;tant le nom du cluster tel que vous l'avez saisi dans le champ Nom du cluster.</p>
<p>Si <code>default-config</code> est s&eacute;lectionn&eacute; dans la liste d&eacute;roulante Configuration, vous devez choisir cette option. La configuration <code>default-config</code> peut &ecirc;tre copi&eacute;e, mais pas utilis&eacute;e comme r&eacute;f&eacute;rence.</p>
</dd>
<dt>Utiliser la configuration s&eacute;lectionn&eacute;e comme r&eacute;f&eacute;rence</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le cluster utilisera la configuration nomm&eacute;e existante indiqu&eacute;e.</p>
<p>Si <code>default-config</code> est s&eacute;lectionn&eacute; dans la liste d&eacute;roulante Configuration, vous ne devez <i>pas</i> choisir cette option. La configuration <code>default-config</code> peut &ecirc;tre copi&eacute;e, mais pas utilis&eacute;e comme r&eacute;f&eacute;rence.</p>
</dd>
<dt>Instances de serveur &agrave; cr&eacute;er</dt>
<dd>
<p>Liste des instances GlassFish&nbsp;Server qui seront cr&eacute;&eacute;es en m&ecirc;me temps que le cluster. Pour chaque instance, les informations suivantes sont fournies&nbsp;:</p>
<dl>
<dt>Nom d'instance</dt>
<dd>
<p>Nom de l'instance.</p>
</dd>
<dt>Pond&eacute;ration</dt>
<dd>
<p>Entier qui repr&eacute;sente la pond&eacute;ration de l'&eacute;quilibrage de charge de l'instance.</p>
<p>La pond&eacute;ration de l'&eacute;quilibrage de charge d&eacute;termine la proportion de toutes les demandes destin&eacute;es au cluster que l'instance doit traiter.</p>
<p>Par exemple, dans un cluster comportant deux instances, vous pouvez avoir besoin d'une instance pour le traitement de l'une des quatre demandes, et une autre instance pour le traitement des trois demandes restantes. Dans ce cas, d&eacute;finissez la pond&eacute;ration de l'instance qui doit traiter une demande sur quatre sur&nbsp;1 et celle de l'autre instance sur&nbsp;3. Si vous pr&eacute;f&eacute;rez utiliser des pourcentages, d&eacute;finissez la pond&eacute;ration des instances sur 25 et 75, respectivement.</p>
<p>La pond&eacute;ration par d&eacute;faut est de&nbsp;100.</p>
</dd>
<dt>Noeud</dt>
<dd>
<p>Liste d&eacute;roulante des noeuds existants sur lesquels l'instance peut r&eacute;sider. Vous devez s&eacute;lectionner un noeud dans la liste. L'instance r&eacute;sidera sur le noeud s&eacute;lectionn&eacute; lors de la cr&eacute;ation du cluster.</p>
</dd>
</dl>
<p>La table Instances de serveur &agrave; cr&eacute;er contient &eacute;galement les options suivantes&nbsp;:</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er une instance. Le fait de cliquer sur ce bouton permet d'ajouter une ligne &agrave; la table Instances de serveur &agrave; cr&eacute;er.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer une instance.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-create-cluster.html">Cr&eacute;er un cluster</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>Sous-commande asadmin &eacute;quivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
