<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-config-sys-properties-defaults"></a><h4>D&#233;finir les valeurs par d&#233;faut des propri&#233;t&#233;s syst&#232;me de configuration</h4><p>Les valeurs par d&#233;faut des propri&#233;t&#233;s de configuration sont d&#233;finies dans la
configuration &#224; laquelle le cluster ou l'instance fait r&#233;f&#233;rence.</p>

<ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud de la configuration.</b></li>
<li><b>&#192; partir de la liste des types de propri&#233;t&#233;s sous le n&#339;ud
d&#233;velopp&#233;, s&#233;lectionnez Propri&#233;t&#233;s syst&#232;me.</b><p>La page Propri&#233;t&#233;s syst&#232;me pour la configuration s&#233;lectionn&#233;e s'ouvre.</p><p>Cette page affiche les valeurs actuelles des propri&#233;t&#233;s syst&#232;me suivantes pour la
configuration&#160;:</p>
<ul><li><p><a href="../../../common/fr/help/ref-predefinedconfigsysproperties.html">Port numbers that are predefined when the configuration was created</a></p>

</li>
<li><p>Propri&#233;t&#233;s personnalis&#233;es ajout&#233;es &#224; la configuration, le cas &#233;ch&#233;ant</p>

</li></ul>
</li>
<li><b>Pour vous assurer que vos modifications sont appliqu&#233;es sans red&#233;marrer le cluster
ou l'instance, s&#233;lectionnez l'option Reconfiguration dynamique.</b></li>
<li><b>Pour chaque propri&#233;t&#233; pour laquelle vous d&#233;finissez une valeur par d&#233;faut, entrez
la nouvelle valeur dans le champ Valeur par d&#233;faut de la propri&#233;t&#233;.</b></li>
<li><b>D&#233;finissez les valeurs par d&#233;faut des propri&#233;t&#233;s suppl&#233;mentaires requises.</b><ol style="list-style-type: lower-alpha">
<li><b>Dans le tableau Autres propri&#233;t&#233;s, cliquez sur Ajouter une propri&#233;t&#233;.</b><p>Une ligne est ajout&#233;e au tableau Autres propri&#233;t&#233;s.</p></li>
<li><b>Dans le champ Nom de la variable d'instance, entrez le nom de
la propri&#233;t&#233;.</b></li>
<li><b>Dans le champ Valeur par d&#233;faut, entrez la valeur.</b></li></ol></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-change-clustered-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server autonome</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
