<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-gms"></a><h4>Configurer le service de gestion de groupes</h4><a name="indexterm-153"></a><p>Le service de gestion de groupes (GMS) est un service inclus dans
un processus offrant des services de contr&#244;le de clusters, d'appartenance au cluster
et de communication de groupe. Il ex&#233;cute les fonctions suivantes&#160;:</p>


<ul><li><p>Signaler les modules enregistr&#233;s dans une instance de GlassFish Server lorsqu'une ou plusieurs instances membres sont ajout&#233;es ou supprim&#233;es d'un cluster ou lorsque leur &#233;chec est suspect&#233; ou a &#233;t&#233; confirm&#233;.</p>

</li>
<li><p>Offrir la possibilit&#233; d'envoyer et recevoir des messages dans un groupe de processus.</p>

</li></ul>
<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez la configuration &#224; modifier pour le cluster.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Service de gestion de groupes.</b><p>La page Service de gestion de groupes s'ouvre.</p></li>
<li><b>Dans le champ Maximum Missed Heartbeats, entrez le nombre maximal de tentatives
de contr&#244;le avant que le GMS ne confirme qu'une d&#233;faillance est suspect&#233;e.</b><p>La valeur par d&#233;faut est 3.</p></li>
<li><b>Dans le champ Fr&#233;quence de pulsation, entrez la dur&#233;e entre les tentatives
de contr&#244;le.</b><p>La valeur par d&#233;faut est 2000 millisecondes.</p></li>
<li><b>Dans le champ Group Discovery Timeout field, entrez la dur&#233;e d'attente du
GMS pour la d&#233;tection d'autres membres du cluster.</b><p>La valeur par d&#233;faut est 5000 millisecondes.</p></li>
<li><b>Dans le champ Failure Verification Wait Time, entrez la dur&#233;e au bout
de laquelle une d&#233;faillance suspect&#233;e est marqu&#233;e comme &#233;tant v&#233;rifi&#233;e.</b><p>La valeur par d&#233;faut est 1500 millisecondes.</p></li>
<li><b>Pour restaurer les valeurs par d&#233;faut, cliquez sur le bouton Charger les
valeurs par d&#233;faut.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>GlassFish Server ne d&#233;finit pas d'autres propri&#233;t&#233;s GMS.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez, puis cliquez sur le bouton
Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-gmsenable.html">Activer le service de gestion de groupes</a></p>

</li>
<li><p><a href="task-gmscluster.html">Configurer les param&#232;tres du service de gestion de groupes pour un cluster</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
