<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-change-standalone-instance-ports"></a><h4>Modifier les num&#233;ros de port d'une instance de GlassFish Server autonome</h4><a name="indexterm-131"></a><a name="indexterm-132"></a><a name="indexterm-133"></a><p>Les num&#233;ros de port d'une instance de GlassFish Server autonome sont initialement
d&#233;finis dans la configuration &#224; laquelle l'instance fait r&#233;f&#233;rence. Vous devez modifier
ces num&#233;ros de port si, par exemple, deux instances qui font r&#233;f&#233;rence
&#224; la m&#234;me configuration r&#233;sident sur le m&#234;me h&#244;te. Dans ce cas,
les num&#233;ros de port d'une instance doivent &#234;tre modifi&#233;s car les deux
instances font r&#233;f&#233;rence &#224; la m&#234;me configuration.</p>

<p>Les num&#233;ros de port d'une instance sont stock&#233;s en tant que propri&#233;t&#233;s
syst&#232;me Java. Ces propri&#233;t&#233;s sont transmises au lanceur d'application Java par l'interm&#233;diaire
de l'option <tt>-D</tt> du lanceur d'application Javaau d&#233;marrage de &#38;ProductName ;. </p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Instances autonomes.</b><p>La page Instances de serveur autonomes s&#8217;ouvre.</p></li>
<li><b>S&#233;lectionnez l'instance pour laquelle vous souhaitez modifier les num&#233;ros de port.</b><p>La page Informations g&#233;n&#233;rales de l'instance s'ouvre.</p></li>
<li><b>Sur la page Informations g&#233;n&#233;rales, cliquez sur l&#8217;onglet Propri&#233;t&#233;s.</b><p>La page Propri&#233;t&#233;s syst&#232;me de l'instance s&#8217;affiche.</p><p>Cette page affiche les valeurs actives des propri&#233;t&#233;s syst&#232;me suivantes pour l'instance&#160;:</p>
<ul><li><p><a href="../../../common/fr/help/ref-predefinedconfigsysproperties.html">Port numbers that are predefined in the instance's configuration</a></p>

</li>
<li><p>Propri&#233;t&#233;s personnalis&#233;es d&#233;finies pour l'instance, le cas &#233;ch&#233;ant</p>

</li></ul>
</li>
<li><b>Entrez la nouvelle valeur dans le champ Remplacer la valeur de chaque
propri&#233;t&#233; &#224; modifier. </b></li>
<li><b>D&#233;finissez les valeurs des propri&#233;t&#233;s suppl&#233;mentaires requises.</b><ol style="list-style-type: lower-alpha">
<li><b>Dans le tableau Autres propri&#233;t&#233;s, cliquez sur Ajouter une propri&#233;t&#233;.</b><p>Une ligne est ajout&#233;e au tableau Autres propri&#233;t&#233;s.</p></li>
<li><b>Dans le champ Nom de la variable d'instance, entrez le nom de
la propri&#233;t&#233;.</b></li>
<li><b>Dans le champ Remplacer la valeur, entrez la valeur.</b></li></ol></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Cr&#233;er une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Supprimer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">D&#233;marrer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Arr&#234;ter les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Afficher les fichiers journaux d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">D&#233;ployer une application sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">R&#233;pertorier les applications d&#233;ploy&#233;es sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Annuler le d&#233;ploiement d'applications d'une instance GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Supprimer des applications d'une instance autonome GlassFish Server </a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Modifier une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Activer ou d&#233;sactiver une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Activer ou d&#233;sactiver l'&#233;quilibrage de charge pour une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Cr&#233;er une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">R&#233;pertorier les ressources pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Activer ou d&#233;sactiver une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Modifier une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des applications pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Afficher les donn&#233;es de contr&#244;les d'un serveur virtuel pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des ressources pour une instance de GlassFish Server autonome</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
