<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-view-logs-standalone-instance" name="task-view-logs-standalone-instance"></a><a id="GHCLU00060" name="GHCLU00060"></a></p>

<h4><a id="sthref140" name="sthref140"></a><a id="sthref141" name="sthref141"></a><a id="sthref142" name="sthref142"></a><a id="sthref143" name="sthref143"></a>Afficher les fichiers journaux d'une instance de GlassFish&nbsp;Server autonome</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref144" name="sthref144"></a>
<h5>Avant de commencer</h5>
<p>L'instance pour laquelle vous souhaitez afficher les journaux doit &ecirc;tre en cours d'ex&eacute;cution.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Instances autonomes.</p>
<p>La page Instances de serveur autonomes appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance pour laquelle vous souhaitez afficher les fichiers journaux.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur Afficher les fichiers journaux.</p>
<p>La fen&ecirc;tre du visualiseur de journaux appara&icirc;t.</p>

<hr>
<p><b>Remarque:</b></p>
L'instance doit d&eacute;j&agrave; &ecirc;tre en cours d'ex&eacute;cution. Si elle ne l'est pas, le bouton Afficher les fichiers journaux est d&eacute;sactiv&eacute;.
<hr>

</li>
</ol>
<a id="sthref145" name="sthref145"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="../../../common/fr/help/missingtopic.html">Filtrer les enregistrements de journal affich&eacute;s</a></p>
</li>
<li>
<p><a href="task-create-standalone-instance.html">Cr&eacute;ation d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Supprimer des instances de GlassFish&nbsp;Server autonomes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">D&eacute;marrer des instances de GlassFish&nbsp;Server autonomes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Arr&ecirc;ter des instances de GlassFish&nbsp;Server autonomes</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">R&eacute;cup&eacute;rer des transactions d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">D&eacute;ployer une application vers une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Lister les applications d&eacute;ploy&eacute;es vers une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Annuler le d&eacute;ploiement d'applications &agrave; partir d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Enlever des applications d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Modifier une application d&eacute;ploy&eacute;e vers une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activer ou d&eacute;sactiver une application d&eacute;ploy&eacute;e vers une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activer ou d&eacute;sactiver l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Cr&eacute;er une ressource pour une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Lister les ressources d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activer ou d&eacute;sactiver une ressource d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Modifier une ressource d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modifier les num&eacute;ros de port d'une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">D&eacute;finir les propri&eacute;t&eacute;s propres &agrave; une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Visualiser les donn&eacute;es de surveillance des applications pour une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Visualiser les donn&eacute;es de surveillance des serveurs virtuels pour une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Visualiser les donn&eacute;es de surveillance des ressources pour une instance de GlassFish&nbsp;Server autonome</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
