<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-availabilityservice"></a><h3>Configurer les param&#232;tres de disponibilit&#233; pour un cluster</h3><a name="indexterm-4"></a><a name="indexterm-5"></a><a name="indexterm-6"></a><a name="indexterm-7"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez la configuration &#224; modifier pour le cluster.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Service de disponibilit&#233;.</b><p>La page Service de disponibilit&#233; s'ouvre.</p></li>
<li><b>Dans le champ Service de disponibilit&#233;, cochez la case Activ&#233; pour activer
la disponibilit&#233; pour le cluster avec la configuration que vous avez s&#233;lectionn&#233;e.</b><p>Pour d&#233;sactiver la disponibilit&#233;, d&#233;cochez la case Service de disponibilit&#233; activ&#233;.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour la disponibilit&#233; du cluster.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez, puis cliquez sur le bouton
Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-create-cluster.html">Cr&#233;er un cluster</a></p>

</li>
<li><p><a href="task-delete-cluster.html">Supprimer un cluster</a></p>

</li>
<li><p><a href="task-start-cluster.html">D&#233;marrer un cluster</a></p>

</li>
<li><p><a href="task-stop-cluster.html">Arr&#234;ter un cluster</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">Modifier la configuration d'un cluster</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">D&#233;ployer une application sur un cluster</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">R&#233;pertorier les applications d&#233;ploy&#233;es dans un cluster</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">Annuler le d&#233;ploiement d'applications d'un cluster </a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">Supprimer des applications d'un cluster </a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">Modifier une application d&#233;ploy&#233;e dans un cluster</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">Activer ou d&#233;sactiver une application d&#233;ploy&#233;e dans un cluster</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">Activer ou d&#233;sactiver l'&#233;quilibrage de charge pour une application d&#233;ploy&#233;e dans un cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">Cr&#233;er une ressource pour un cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">R&#233;pertorier les ressources d'un cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">Activer ou d&#233;sactiver une ressource &#224; l'&#233;chelle globale</a></p>

</li>
<li><p><a href="task-cluster-resource-edit.html">Modifier une ressource d'un cluster</a></p>

</li>
<li><p><a href="task-upgrade-components.html">Pour mettre des composants &#224; niveau sans perte de service</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
