<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-migrate-ejb-timers"></a><h4>Migrer des horloges EJB</h4><a name="indexterm-158"></a><a name="indexterm-159"></a><a name="indexterm-160"></a><p>Si une instance de GlassFish Server est arr&#234;t&#233;e, les services d'horloge EJB
(Enterprise JavaBeans) qui y sont install&#233;s s'arr&#234;tent &#233;galement. Si l'instance a &#233;t&#233;
arr&#234;t&#233;e de mani&#232;re anormale ou inattendue, pour permettre &#224; ces horloges de
s'ex&#233;cuter pendant que l'instance est stopp&#233;e, vous devez migrer les horloges vers
une instance de serveur en cours d'ex&#233;cution dans le cluster.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Clusters.</b></li>
<li><b>Dans l'arborescence de navigation, sous le n&#339;ud Clusters, s&#233;lectionnez le cluster.</b><p>La page Informations g&#233;n&#233;rales du cluster s'ouvre.</p></li>
<li><b>Cliquez sur le bouton Migrer les horloges EJB de la page Informations
g&#233;n&#233;rales.</b><p>La page Migrer les services d'horloge EJB s'ouvre.</p>
<hr><p><b>Remarque - </b>Si toutes les instances du cluster sont en cours d'ex&#233;cution, le bouton
Migrer les services d'horloge EJB est d&#233;sactiv&#233;.</p>


<hr>
</li>
<li><b>Sur la page Migrer les services d'horloge EJB, s&#233;lectionnez l'instance &#224; partir
de laquelle et vers laquelle vous souhaitez migrer les services d'horloge.</b><ol style="list-style-type: lower-alpha">
<li><b>Dans la liste d&#233;roulante Source, s&#233;lectionnez l&#8217;instance arr&#234;t&#233;e &#224; partir de laquelle
vous souhaitez migrer les services d'horloge.</b></li>
<li>(Facultatif) <b>Dans la liste d&#233;roulante Destination, s&#233;lectionnez l&#8217;instance en cours d'ex&#233;cution vers laquelle
vous souhaitez migrer les services d'horloge. </b></li>
<li><b>Cliquez sur OK.</b></li></ol></li>
<li><b>Arr&#234;tez et red&#233;marrez l'instance vers laquelle vous avez migr&#233; les services d'horloge
EJB.</b><p>Si l&#8217;instance source est en cours d'ex&#233;cution ou si l&#8217;instance de destination
n&#8217;est pas en cours d'ex&#233;cution, Console d'administration  affiche un message d&#8217;erreur.</p></li></ol>

<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
