<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-recovertransactions-standalone-instance"></a><h4>R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server autonome</h4><a name="indexterm-99"></a><a name="indexterm-100"></a><a name="indexterm-101"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Instances autonomes.</b><p>La page Instances de serveur autonomes s&#8217;ouvre.</p></li>
<li><b>S&#233;lectionnez l'instance pour laquelle une r&#233;cup&#233;ration de transaction est requise. </b><p>La page Informations g&#233;n&#233;rales de l'instance s'ouvre.</p></li>
<li><b>Sur la page Informations g&#233;n&#233;rales, cliquez sur R&#233;cup&#233;rer les transactions. </b><p>La page R&#233;cup&#233;rer les transactions s'ouvre.</p><p>Le contenu de cette page varie selon que l'instance est en cours
d'ex&#233;cution. </p>
<ul><li><p>Si l'instance est en cours d'ex&#233;cution, la page R&#233;cup&#233;rer les transactions contient uniquement le texte <b>La r&#233;cup&#233;ration est effectu&#233;e par le serveur en cours d&#8217;ex&#233;cution lui-m&#234;me</b> et le bouton OK. </p>

</li>
<li><p>Si l'instance n'est pas en cours d'ex&#233;cution, la page R&#233;cup&#233;rer les transactions contient des options suppl&#233;mentaires. </p>

</li></ul>
</li>
<li><b>Dans la liste d&#233;roulante Serveur de destination, s&#233;lectionnez une autre instance pouvant
r&#233;cup&#233;rer les transactions sur l'instance active.</b><p>Pour une instance autonome, s&#233;lectionnez l'instance nomm&#233;e <tt>server</tt> repr&#233;sentant le serveur d'administration
de domaine (DAS). </p></li>
<li><b>Dans le Champ R&#233;pertoire du journal des transactions, entrez le r&#233;pertoire dans
lequel les journaux des transactions sont stock&#233;s.</b><p>La valeur par d&#233;faut est <tt>/logs/tx</tt> sous le r&#233;pertoire du domaine. Les
journaux des transaction sont conserv&#233;s dans le sous-r&#233;pertoire <tt>tx</tt> du r&#233;pertoire sp&#233;cifi&#233;
par le param&#232;tre Emplacement du journal des transactions du Service de transaction
pour la configuration du cluster. La valeur Emplacement du journal des transactions
par d&#233;faut est le r&#233;pertoire sp&#233;cifi&#233; dans le champ Racine journal de
la page Attributs de domaine, qui se trouve dans l&#8217;onglet Avanc&#233; du n&#339;ud
GlassFish Server.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Cr&#233;er une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Supprimer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">D&#233;marrer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Arr&#234;ter les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Afficher les fichiers journaux d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">D&#233;ployer une application sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">R&#233;pertorier les applications d&#233;ploy&#233;es sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Annuler le d&#233;ploiement d'applications d'une instance GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Supprimer des applications d'une instance autonome GlassFish Server </a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Modifier une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Activer ou d&#233;sactiver une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Activer ou d&#233;sactiver l'&#233;quilibrage de charge pour une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Cr&#233;er une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">R&#233;pertorier les ressources pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Activer ou d&#233;sactiver une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Modifier une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des applications pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Afficher les donn&#233;es de contr&#244;les d'un serveur virtuel pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des ressources pour une instance de GlassFish Server autonome</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
