<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-view-logs-clustered-instance"></a><h4>Afficher les journaux d'une instance de GlassFish Server clusteris&#233;e</h4><a name="indexterm-57"></a><a name="indexterm-58"></a><a name="indexterm-59"></a><a name="indexterm-60"></a><h6>Avant de commencer</h6><p>L'instance pour laquelle vous affichez les journaux doit &#234;tre en cours d'ex&#233;cution.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Clusters.</b></li>
<li><b>Sous le n&#339;ud Clusters d&#233;velopp&#233;, s&#233;lectionnez le n&#339;ud pour le cluster.</b><p>La page Informations g&#233;n&#233;rales du cluster s'ouvre.</p></li>
<li><b>Dans la page Informations g&#233;n&#233;rales, cliquez sur l&#8217;onglet Instances. </b><p>La page Instances de serveur clusteris&#233;es du cluster s'ouvre.</p></li>
<li><b>S&#233;lectionnez l'instance pour laquelle vous souhaitez afficher les fichiers journaux.</b><p>La page Informations g&#233;n&#233;rales de l'instance s'ouvre.</p></li>
<li><b>Sur la page Informations g&#233;n&#233;rales, cliquez sur Afficher les journaux.</b><p>Une fen&#234;tre de visionneur de journaux s&#8217;ouvre.</p>
<hr><p><b>Remarque - </b>L'instance doit d&#233;j&#224; &#234;tre en cours d'ex&#233;cution. Si l'instance n'est pas en
cours d'ex&#233;cution, le bouton Afficher les journaux est d&#233;sactiv&#233;.</p>


<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="../../../common/fr/help/task-filter-logs.html">To Filter Displayed Log Records</a></p>

</li>
<li><p><a href="task-create-clustered-instance.html">Ajouter une instance de GlassFish Server &#224; un cluster</a></p>

</li>
<li><p><a href="task-delete-clustered-instances.html">Supprimer les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">D&#233;marrer les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Arr&#234;ter les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-recovertransactions.html">R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">Afficher les donn&#233;es de contr&#244;le des applications pour une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">Afficher les donn&#233;es de contr&#244;le d'un serveur virtuel pour une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">Afficher les donn&#233;es de contr&#244;le des ressources pour une instance de GlassFish Server clusteris&#233;e</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
