<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-standalone-instance-app-deploy"></a><h4>D&#233;ployer une application sur une instance de GlassFish Server autonome</h4><a name="indexterm-102"></a><a name="indexterm-103"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Instances autonomes.</b><p>La page Instances de serveur autonomes s&#8217;ouvre.</p></li>
<li><b>Sur la page Instances de serveur autonomes, s&#233;lectionnez l'instance.</b><p>La page Informations g&#233;n&#233;rales de l'instance s'ouvre.</p></li>
<li><b>Sur la page Informations g&#233;n&#233;rales de l'instance, cliquez sur l'onglet Applications.</b><p>La page Applications de l'instance s'ouvre.</p></li>
<li><b>Sur la page Applications, cliquez sur D&#233;ployer.</b><p>La page D&#233;ploiement d&#8217;applications ou de modules s&#8217;affiche.</p></li>
<li><b>Sur la page D&#233;ploiement d&#8217;applications ou de modules, fournissez les informations requises
sur l'application et cliquez sur OK.</b><p>Pour plus de d&#233;tails, reportez-vous &#224; la section la section <a href="../../../common/fr/help/ref-uploaddev.html">Deploy Applications or Modules</a> de
l'aide en ligne.</p></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Cr&#233;er une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Supprimer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">D&#233;marrer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Arr&#234;ter les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Afficher les fichiers journaux d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">R&#233;pertorier les applications d&#233;ploy&#233;es sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Annuler le d&#233;ploiement d'applications d'une instance GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Supprimer des applications d'une instance autonome GlassFish Server </a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Modifier une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Activer ou d&#233;sactiver une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Activer ou d&#233;sactiver l'&#233;quilibrage de charge pour une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Cr&#233;er une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">R&#233;pertorier les ressources pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Activer ou d&#233;sactiver une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Modifier une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des applications pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Afficher les donn&#233;es de contr&#244;les d'un serveur virtuel pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des ressources pour une instance de GlassFish Server autonome</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
