<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-delete-clustered-instances"></a><h3>Supprimer les instances de GlassFish Server clusteris&#233;es</h3><a name="indexterm-48"></a><a name="indexterm-49"></a><a name="indexterm-50"></a>
<hr><p><b>Attention - </b>Si vous utilisez un cluster Java Message Service (JMS) avec un courtier
principal, ne supprimez pas l'instance associ&#233;e au courtier principal. Si cette instance
doit &#234;tre supprim&#233;e, utilisez la sous-commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=change-master-broker-1"><tt>change-master-broker</tt>(1)</a> pour affecter le courtier principal
&#224; une autre instance. </p>


<hr>
<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Clusters.</b></li>
<li><b>Sous le n&#339;ud Clusters d&#233;velopp&#233;, s&#233;lectionnez le n&#339;ud pour le cluster.</b><p>La page Informations g&#233;n&#233;rales du cluster s'ouvre.</p></li>
<li><b>Dans la page Informations g&#233;n&#233;rales, cliquez sur l&#8217;onglet Instances. </b><p>La page Instances de serveur clusteris&#233;es du cluster s'ouvre.</p></li>
<li><b>Pour chaque instance que vous supprimez, cochez la case en regard de
l'instance dans le tableau Instances de serveur.</b></li>
<li><b>Cliquez sur Supprimer.</b><p>Vous &#234;tes invit&#233; &#224; confirmer que vous souhaitez supprimer les instances.</p></li>
<li><b>Confirmez la suppression des instances.</b><p>Les instances sont supprim&#233;es et effac&#233;es du tableau d'instances sur la page.</p></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-create-clustered-instance.html">Ajouter une instance de GlassFish Server &#224; un cluster</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">D&#233;marrer les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Arr&#234;ter les instances de GlassFish Server clusteris&#233;es</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">Afficher les journaux d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-recovertransactions.html">R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">Afficher les donn&#233;es de contr&#244;le des applications pour une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">Afficher les donn&#233;es de contr&#244;le d'un serveur virtuel pour une instance de GlassFish Server clusteris&#233;e</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">Afficher les donn&#233;es de contr&#244;le des ressources pour une instance de GlassFish Server clusteris&#233;e</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
