<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-editnode"></a><h4>Modifier un n&#339;ud</h4><a name="indexterm-157"></a><p>La modification d'un n&#339;ud met &#224; jour les donn&#233;es de configuration d'un
n&#339;ud GlassFish Server. Elle permet &#233;galement de modifier le type du n&#339;ud
de CONFIG &#224; SSH afin d'activer la communication SSH pour le n&#339;ud.</p>

<p>Si vous modifiez le type du n&#339;ud de CONFIG &#224; SSH, les
valeurs par d&#233;faut sont appliqu&#233;es si l'un des champs suivants n'est pas
renseign&#233; &#160;:</p>


<ul><li><p>Port SSH</p>

</li>
<li><p>Nom d'utilisateur SSH</p>

</li>
<li><p>Fichier de cl&#233;s</p>

</li></ul>
<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud N&#339;uds.</b></li>
<li><b>&#192; partir de la liste des n&#339;uds, s&#233;lectionnez le n&#339;ud &#224; modifier.</b><p>La page Modifier le n&#339;ud s&#8217;ouvre.</p></li>
<li><b>Dans la liste d&#233;roulante Type, s&#233;lectionnez le type du n&#339;ud mis &#224;
jour.</b><ul>
<li><b>Pour activer le n&#339;ud afin d'assurer la prise en charge de la
communication SSH (shell s&#233;curis&#233;), s&#233;lectionnez SSH.</b></li>
<li><b>Pour supprimer la prise en charge de la configuration &#224; distance &#224;
partir du n&#339;ud, s&#233;lectionnez CONFIG.</b><p>Si vous s&#233;lectionnez CONFIG, aucune option de configuration SSH n'est affich&#233;e. Si
le type actuel du n&#339;ud est SSH et que vous s&#233;lectionnez CONFIG,
les donn&#233;es de configuration SSH sont supprim&#233;es de la configuration du n&#339;ud
lorsque vous enregistrez vos modifications.</p></li></ul></li>
<li><b>Dans le champ H&#244;te du n&#339;ud, entrez le nom de l'h&#244;te que
le n&#339;ud mis &#224; jour repr&#233;sentera.</b><p>Le caract&#232;re obligatoire de ce champ d&#233;pend du type du n&#339;ud&#160;:</p>
<ul><li><p>Si le type du n&#339;ud est CONFIG, le nom de l'h&#244;te peut &#234;tre omis. Le nom de l'h&#244;te peut &#234;tre d&#233;termin&#233; lors de la cr&#233;ation d'instances r&#233;sidant sur le n&#339;ud. </p>

</li>
<li><p>Si le type du n&#339;ud est SSH, le nom de l'h&#244;te doit &#234;tre sp&#233;cifi&#233;. Sinon, une erreur se produit. </p>

</li></ul>
</li>
<li><b>Dans le champ R&#233;pertoire du n&#339;ud, entrez le chemin d'acc&#232;s au r&#233;pertoire
qui contiendra les instances de GlassFish Server cr&#233;&#233;es sur le n&#339;ud.</b><p>Si un chemin d'acc&#232;s relatif est sp&#233;cifi&#233;, il est relatif au r&#233;pertoire
<i>as-install</i>, <i>as-install</i> correspondant au r&#233;pertoire d'installation de base du logiciel GlassFish Server
sur l'h&#244;te.</p></li>
<li><b>Dans le champ R&#233;pertoire d'installation, entrez le chemin d'acc&#232;s complet au parent
du r&#233;pertoire d'installation de base du logiciel GlassFish Server sur l'h&#244;te, par
exemple, <tt>/export/glassfish3/</tt>.</b></li>
<li><b>Pour forcer le n&#339;ud &#224; &#234;tre cr&#233;&#233; dans la configuration du serveur
d'administration de domaine (DAS) m&#234;me si la validation des param&#232;tres du n&#339;ud
&#233;choue, activez l'option Forcer.</b></li>
<li><b>Dans le champ Port SSH, entrez le port &#224; utiliser pour les
connexions SSH &#224; ce l'h&#244;te de ce n&#339;ud.</b><p>Si vous modifiez le type du n&#339;ud de CONFIG &#224; SSH et
laissez ce champ vide, l'option Port SSH est d&#233;finie sur 22.</p></li>
<li><b>Dans le champ Nom d'utilisateur SSH, entrez le nom de l'utilisateur sur
l'h&#244;te de ce n&#339;ud qui ex&#233;cutera le processus de connexion &#224; l'h&#244;te
via SSH.</b><p>Si vous modifiez le type du n&#339;ud de CONFIG &#224; SSH et
laissez ce champ vide, l'option Nom d'utilisateur SSH est d&#233;finie sur l'utilisateur
qui ex&#233;cute le processus DAS.</p></li>
<li><b>Indiquez la mani&#232;re dont l'utilisateur SSH est authentifi&#233; lors de la connexion
&#224; l'h&#244;te de ce n&#339;ud.</b><ul>
<li><b>Pour indiquer que l'authentification se fait par le biais d'un fichier de
cl&#233;s priv&#233;es SSH, effectuez les &#233;tapes suivantes&#160;: </b><ol style="list-style-type: lower-alpha">
<li><b>Dans la liste d&#233;roulante Authentification de l'utilisateur SSH, s&#233;lectionnez Fichier de cl&#233;s.</b></li>
<li><b>Dans le champ Fichier de cl&#233;s, entrez le chemin absolu du fichier
de cl&#233;s priv&#233;es SSH pour l'utilisateur sp&#233;cifi&#233; par l'option Nom d'utilisateur SSH.
</b>
<hr><p><b>Remarque - </b>GlassFish Server prend &#233;galement en charge l'authentification par mots de passe via
l'entr&#233;e <tt>AS_ADMIN_SSHPASSWORD</tt> dans le fichier de mots de passe. Le fichier de
mots de passe est sp&#233;cifi&#233; dans l'option <tt>--paswordfile</tt> de l'utilitaire <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=asadmin-1m"><tt>asadmin</tt>(1M)</a>.</p>


<hr>
<p>Si vous modifiez le type du n&#339;ud de CONFIG &#224; SSH et
laissez ce champ vide, l'option Fichier de cl&#233;s est d&#233;finie sur un
fichier de cl&#233;s dans le r&#233;pertoire <tt>.ssh</tt> de l'utilisateur. Si plusieurs fichiers
de cl&#233;s sont disponibles, GlassFish Server utilise l'ordre de pr&#233;f&#233;rence suivant&#160;: </p>
<ul><li><p><tt>id_rsa</tt></p>

</li>
<li><p><tt>id_dsa</tt></p>

</li>
<li><p><tt>identity</tt> </p>

</li></ul>
</li></ol></li>
<li><b>Pour indiquer que l'authentification se fait par le biais d'un mot de
passe stock&#233; dans la configuration DAS, effectuez les &#233;tapes suivantes&#160;:</b>
<hr><p><b>Attention - </b>Ce mot de passe est stock&#233; sous forme de texte en clair
dans la configuration DAS. Pour une s&#233;curit&#233; accrue, utilisez un fichier de
cl&#233;s ou un alias de mot de passe. </p>


<hr>
<ol style="list-style-type: lower-alpha">
<li><b>Dans la liste d&#233;roulante Authentification de l'utilisateur SSH, s&#233;lectionnez Mot de passe.</b></li>
<li><b>Dans le champ Mot de passe SSH, entrez le mot de passe
que l'utilisateur SSH va utiliser lors de la connexion &#224; l'h&#244;te de
ce n&#339;ud. </b></li>
<li><b>Dans le champ Confirmer le mot de passe SSH, saisissez &#224; nouveau
le mot de passe.</b></li></ol></li>
<li><b>Pour indiquer que l'authentification se fait par le biais d'un alias de
mot de passe, effectuez les &#233;tapes suivantes&#160;: </b><ol style="list-style-type: lower-alpha">
<li><b>Dans la liste d&#233;roulante Authentification de l'utilisateur SSH, s&#233;lectionnez Alias de mot
de passe.</b></li>
<li><b>Dans la liste d&#233;roulante Alias de mot de passe, s&#233;lectionnez un alias
existant.</b></li></ol></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-createnode.html">Cr&#233;er un n<IMG alt="oelig" SRC="ents/oelig.gif" border="0">ud</a></p>

</li>
<li><p><a href="task-deletenode.html">Supprimer des n<IMG alt="oelig" SRC="ents/oelig.gif" border="0">uds</a></p>

</li>
<li><p><a href="task-listnodes.html">R&#233;pertorier tous les n<IMG alt="oelig" SRC="ents/oelig.gif" border="0">uds du domaine actif</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
