<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-start-standalone-instances"></a><h3>D&#233;marrer les instances de GlassFish Server autonomes</h3><a name="indexterm-89"></a><a name="indexterm-90"></a><a name="indexterm-91"></a><p><b>Avant de commencer</b></p><p>Assurez-vous que les conditions suivantes sont remplies&#160;:</p>


<ul><li><p>Tous les n&#339;uds sur lesquels r&#233;sident les instances sont activ&#233;s pour la communication &#224; distance.</p>

</li>
<li><p>L'utilisateur du serveur d'administration de domaine (DAS) peut utiliser le protocole SSH (shell s&#233;curis&#233;) pour se connecter &#224; l'h&#244;te pour n'importe quel n&#339;ud dans lequel r&#233;sident les instances.</p>

</li></ul>
<p>Si l'une de ces conditions n'est pas remplie, d&#233;marrez chaque instance individuellement
&#224; partir de la ligne de commande &#224; l'aide de la sous-commande
<a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-local-instance-1"><tt>start-local-instance</tt>(1)</a>.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Instances autonomes.</b><p>La page Instances de serveur autonomes s&#8217;ouvre.</p></li>
<li><b>Pour chaque instance d&#233;marr&#233;e, cochez la case en regard de l'instance dans
le tableau Instances de serveur.</b></li>
<li><b>Cliquez sur D&#233;marrer.</b><p>Vous &#234;tes invit&#233; &#224; confirmer que vous souhaitez d&#233;marrer les instances.</p></li>
<li><b>Confirmez le d&#233;marrage des instances.</b><p>Le statut de chaque instance est mis &#224; jour dans le tableau
Instances de serveur au d&#233;marrage de l'instance.</p></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-create-standalone-instance.html">Cr&#233;er une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Supprimer les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Arr&#234;ter les instances de GlassFish Server autonomes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Afficher les fichiers journaux d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">R&#233;cup&#233;rer les transactions d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">D&#233;ployer une application sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">R&#233;pertorier les applications d&#233;ploy&#233;es sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Annuler le d&#233;ploiement d'applications d'une instance GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Supprimer des applications d'une instance autonome GlassFish Server </a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Modifier une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Activer ou d&#233;sactiver une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Activer ou d&#233;sactiver l'&#233;quilibrage de charge pour une application d&#233;ploy&#233;e sur une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Cr&#233;er une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">R&#233;pertorier les ressources pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Activer ou d&#233;sactiver une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Modifier une ressource pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Modifier les num&#233;ros de port d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Configurer des propri&#233;t&#233;s sp&#233;cifiques &#224; l'instance d'une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des applications pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Afficher les donn&#233;es de contr&#244;les d'un serveur virtuel pour une instance de GlassFish Server autonome</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Afficher les donn&#233;es de contr&#244;le des ressources pour une instance de GlassFish Server autonome</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
