<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneralproperties" name="ref-ejbgeneralproperties"></a></p>

<h4>Propriedades Espec&iacute;ficas do Cont&ecirc;iner EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades a seguir est&atilde;o dispon&iacute;veis para configurar o cont&ecirc;iner EJB. Para obter mais informa&ccedil;&otilde;es, consulte <a href="http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html"><code>http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html</code></a>.</p>
<dl>
<dt><code>thread-core-pool-size</code></dt>
<dd>
<p>Especifica o n&uacute;mero de threads do n&uacute;cleo no pool do thread comum do cont&ecirc;iner EJB. O valor default &eacute; <code>16</code>.</p>
</dd>
<dt><code>thread-max-pool-size</code></dt>
<dd>
<p>Especifica o n&uacute;mero m&aacute;ximo de threads no pool do thread comum do cont&ecirc;iner EJB. O valor default &eacute; <code>32</code>.</p>
</dd>
<dt><code>thread-queue-capacity</code></dt>
<dd>
<p>Especifica o tamanho da fila do pool de thread, que armazena novas solicita&ccedil;&otilde;es se mais de <code>thread-core-pool-size</code> threads estiverem sendo executados. O valor default &eacute; o <code>Integer.MAX_VALUE</code>.</p>
</dd>
<dt><code>thread-keep-alive-seconds</code></dt>
<dd>
<p>Especifica o tempo, em segundos, ap&oacute;s o qual threads em excesso de <code>thread-core-pool-size</code> s&atilde;o finalizados. O valor default &eacute; <code>60</code>.</p>
</dd>
<dt><code>allow-core-thread-timeout</code></dt>
<dd>
<p>Se for definido como <code>verdadeiro</code>, todos os threads, at&eacute; mesmo os threads do n&uacute;cleo, estar&atilde;o sujeitos a finaliza&ccedil;&atilde;o ap&oacute;s <code>thread-keep-alive-seconds</code>. O valor default &eacute; <code>false</code>.</p>
</dd>
<dt><code>prestart-all-core-threads</code></dt>
<dd>
<p>Se for definido como <code>verdadeiro</code>, todos os threads do n&uacute;cleo no pool do thread comum do cont&ecirc;iner EJB s&atilde;o iniciados, fazendo com que eles esperem pelo trabalho em inatividade. Se forem definidos como <code>falsos</code>, threads n&atilde;o s&atilde;o iniciados at&eacute; novas solicita&ccedil;&otilde;es serem recebidas. O valor default &eacute; <code>false</code>.</p>
</dd>
</dl>




<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
