<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-orb"></a><h4>ORB</h4>
<a name="indexterm-8"></a><a name="indexterm-9"></a><p>Utilice la p&#225;gina ORB para configurar el agente intermediarios de solicitud de
objetos.</p>

<p>El ORB proporciona la infraestructura necesaria para identificar y localizar objetos, administrar
las conexiones, enviar datos y solicitar comunicaci&#243;n. Los clientes remotos de beans
empresariales (m&#243;dulos EJB) se comunican con el Servidor GlassFish mediante el ORB.</p>

<p>La p&#225;gina ORB contiene las siguientes opciones.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer las opciones que tienen valores por defecto a estos. Las opciones que no tienen valores por defecto no se modifican.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>El nombre de la configuraci&#243;n a la que aplicar los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Id. del conjunto de subprocesos</dt>
<dd><p>El conjunto de subprocesos que utiliza el ORB. ORB utiliza conjuntos de subprocesos para responder a solicitudes de clientes remotos de beans empresariales y otros clientes que se comunican por medio de RMI-IIOP. El conjunto de subprocesos predeterminado para ORB es <tt>thread-pool-1</tt>, que utiliza valores predeterminados apropiados para las solicitudes de RMI/IIOP.</p>

</dd>
<dt>Tama&#241;o m&#225;x. de fragmentos de mensaje</dt>
<dd><p>El tama&#241;o m&#225;ximo para los fragmentos de mensajes IIOP. Los mensajes m&#225;s grandes que este tama&#241;o quedar&#225;n fragmentados. El valor predeterminado es de 1024 bytes.</p>

</dd>
<dt>Total de conexiones</dt>
<dd><p>El n&#250;mero m&#225;ximo de conexiones entrantes para las escuchas IIOP. El valor predeterminado es 1024.</p>

</dd>
<dt>Autenticaci&#243;n de cliente IIOP</dt>
<dd><p>Si la casilla de verificaci&#243;n Habilitado est&#225; seleccionada, el servidor rechaza las solicitudes no autenticadas e inserta un bit de autenticaci&#243;n requerida en el las referencias de objetos remotos interoperables (IOR) enviadas a los clientes. La autenticaci&#243;n de cliente IIOP se puede activar o desactivar. Esta opci&#243;n se deshabilita por defecto.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales de ORB Servidor GlassFish no define ninguna propiedad adicional para el ORB.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-orb.html">C&#243;mo configurar el ORB</a></p>

</li>
<li><p><a href="task-iioplistenernew.html">C&#243;mo crear una escucha IIOP</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">C&#243;mo editar una escucha IIOP</a></p>

</li>
<li><p><a href="task-editiiopssl.html">C&#243;mo editar los par&#225;metros de configuraci&#243;n de SSL de una escucha IIOP segura</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">C&#243;mo eliminar una escucha IIOP</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-iiop-listener-1"><tt>create-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-iiop-listeners-1"><tt>list-iiop-listeners</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-iiop-listener-1"><tt>delete-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-ssl-1"><tt>create-ssl</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-ssl-1"><tt>delete-ssl</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
