<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-orb" name="task-orb"></a><a id="GHCOR00006" name="GHCOR00006"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Configurar ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el componente de &aacute;rbol, expanda el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la instancia que va a configurar:</p>
<ul>
<li>
<p>Para configurar una instancia determinada, seleccione el nodo de configuraci&oacute;n de la instancia. Por ejemplo, para la instancia por defecto, <code>server</code>, seleccione el nodo <code>server-config</code>.</p>
</li>
<li>
<p>Para definir la configuraci&oacute;n por defecto para instancias futuras que utilicen una copia de <code>default-config</code>, seleccione el nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Seleccione el nodo ORB.</p>
<p>Se abrir&aacute; la p&aacute;gina ORB.</p>
</li>
<li>
<p>Seleccione el conjunto de subprocesos que utilizar&aacute; ORB de la lista desplegable Identificador de conjunto de subprocesos.</p>
<p>ORB utiliza conjuntos de subprocesos para responder a solicitudes de clientes remotos de beans empresariales y otros clientes que se comunican por medio de RMI-IIOP. El pool de threads por defecto para ORB es <code>thread-pool-1</code>, que utiliza valores por defecto apropiados para las solicitudes de RMI/IIOP.</p>
<p>Consulte <a href="../../../web/es/help/missingtopic.html">Conjuntos de subprocesos</a> para obtener m&aacute;s informaci&oacute;n.</p>
</li>
<li>
<p>En la lista desplegable Tama&ntilde;o m&aacute;ximo de fragmento de mensaje, seleccione el tama&ntilde;o m&aacute;ximo para los fragmentos de mensajes IIOP.</p>
<p>Los mensajes m&aacute;s grandes que este tama&ntilde;o quedar&aacute;n fragmentados. El valor predeterminado es de 1024 bytes.</p>
</li>
<li>
<p>En el campo N&uacute;mero total de conexiones, establezca el n&uacute;mero m&aacute;ximo de conexiones entrantes para las escuchas IIOP.</p>
<p>El valor predeterminado es 1024.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n de Autenticaci&oacute;n necesaria del cliente IIOP para especificar que se requiere la autenticaci&oacute;n del cliente IIOP.</p>
<p>Si la autenticaci&oacute;n de cliente IIOP est&aacute; habilitada, el servidor rechazar&aacute; las solicitudes no autenticadas e insertar&aacute; un bit de autenticaci&oacute;n requerida en las referencias de objetos remotos interoperables (IORs) enviadas a los clientes. Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para el ORB.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, escriba el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite su campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a los valores de configuraci&oacute;n predeterminados, haga clic en el bot&oacute;n Cargar predeterminados y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-iioplistenernew.html">Crear un Listener IIOP</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">Edici&oacute;n de un Listener IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Editar Configuraci&oacute;n SSL para un Listener IIOP Seguro</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Suprimir un Listener IIOP</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
