<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-adminobjectedit"></a><h4>Editar o recurso de administra&#231;&#227;o dos objetos</h4>
<a name="indexterm-54"></a><p>Use a p&#225;gina Editar o recurso de administra&#231;&#227;o dos objetos para modificar
as configura&#231;&#245;es de um recurso de objeto administrado.</p>

<p>A p&#225;gina Editar o recurso de administra&#231;&#227;o dos objetos cont&#233;m as seguintes
op&#231;&#245;es.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome JNDI</dt>
<dd><p>Um nome &#250;nico que identifica o recurso do objeto administrado. O nome JNDI &#233; um campo somente leitura. Voc&#234; somente pode especificar o nome JNDI ao criar um novo recurso de objeto administrado.</p>

</dd>
<dt>Adaptador de recurso</dt>
<dd><p>O adaptador de recurso para o recurso do objeto administrado.</p>

</dd>
<dt>Tipo de recurso</dt>
<dd><p>O tipo Java do recurso do objeto administrado (ou por exemplo,<tt>javax.jms.Topic</tt>),</p>

</dd>
<dt>Nome da classe</dt>
<dd><p>O nome da classe de implementa&#231;&#227;o associada com o tipo de recurso.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>A descri&#231;&#227;o do recurso do objeto administrado.</p>

</dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, o recurso do objeto administrado ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais para o recurso do objeto administrado. As propriedades dispon&#237;veis dependem do adaptador de recurso para o conjunto de conex&#245;es do conector. Os pares de nome e valor especificados nessa tabela, podem ser usados para sobrepor os valores padr&#227;o definidos pelo fornecedor do adaptador de recurso.</p>

</dd>
</dl>
<a name="gkomq"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-adminobjectnew.html">Para criar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Para editar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Para excluir um recurso de objeto administrado</a></p>

</li></ul>
<a name="gkonl"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-admin-object-1"><tt>create-admin-object</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-admin-objects-1"><tt>list-admin-objects</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-admin-object-1"><tt>delete-admin-object</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
