<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpooledit"></a><h4>Editar grupo de conex&#227;o de conectores</h4>
<a name="indexterm-42"></a><p>Use a p&#225;gina Editar Conjunto de Conex&#245;es do Conector para modificar as
configura&#231;&#245;es do conjunto de conex&#245;es do conector.</p>

<p>A p&#225;gina Editar Conjunto de Conex&#245;es do Conector cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Esvaziamento</dt>
<dd><p>Bot&#227;o para reinicializar as conex&#245;es no conjunto de conex&#245;es. Clicar nesse bot&#227;o destr&#243;i quaisquer conex&#245;es existentes, recria as conex&#245;es estabelecidas para o conjunto e restaura o conjunto para seu tamanho inicial e m&#237;nimo.</p>

</dd>
<dt>Ping</dt>
<dd><p>Bot&#227;o utilizado para verificar que o conjunto de conex&#245;es &#233; utiliz&#225;vel.</p>

</dd>
<dt>Nome do conjunto</dt>
<dd><p>Um nome &#250;nico que identifica o conjunto de conex&#245;es do conector. Esse &#233; um campo somente leitura. Voc&#234; pode especificar o nome do conjunto somente ao criar um novo conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Adaptador de recurso</dt>
<dd><p>O adaptador de recurso associado ao conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Defini&#231;&#227;o da conex&#227;o</dt>
<dd><p>A defini&#231;&#227;o da conex&#227;o para o conjunto de conex&#245;es do conector. As escolhas na lista dependem do adaptador de recurso selecionado. A defini&#231;&#227;o da conex&#227;o identifica um elemento <tt>conex&#227;o-defini&#231;&#227;o</tt> do adaptador de recurso no arquivo <tt>ra.xml</tt>.</p>

</dd>
<dt>Ping</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, ser&#225; efetuado o ping autom&#225;tico no conjunto de conex&#245;es durante a cria&#231;&#227;o ou reconfigura&#231;&#227;o, para identificar e avisar sobre valores de atributos com erros. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do conjunto de conex&#245;es do conector. </p>

</dd>
<dt>Tamanho inicial e m&#237;nimo do conjunto</dt>
<dd><p>O n&#250;mero m&#237;nimo de conex&#245;es no conjunto de conex&#245;es do conector. O valor padr&#227;o &#233; 8.</p>

</dd>
<dt>Tamanho m&#225;ximo do conjunto</dt>
<dd><p>O n&#250;mero m&#225;ximo de conex&#245;es no conjunto de conex&#245;es do conector. O valor padr&#227;o &#233; 32.</p>

</dd>
<dt>Quantidade de redimensionamento do conjunto</dt>
<dd><p>O n&#250;mero de conex&#245;es a serem removidas quando expira o conjunto ocioso. O valor padr&#227;o &#233; 2.</p>

</dd>
<dt>Tempo limite de inatividade</dt>
<dd><p>A quantidade m&#225;xima de tempo, em segundos, que uma conex&#227;o pode permanecer inativa no conjunto. O valor padr&#227;o &#233; 300.</p>

</dd>
<dt>Tempo m&#225;x. de espera</dt>
<dd><p>A quantidade m&#225;xima de tempo que o aplicativo solicitante da conex&#227;o aguardar&#225; at&#233; obter um tempo limite da conex&#227;o. O valor padr&#227;o &#233; 60000.</p>

</dd>
<dt>Valida&#231;&#227;o da conex&#227;o</dt>
<dd><p>Se a caixa de verifica&#231;&#227;o Obrigat&#243;rio estiver marcada, as conex&#245;es s&#227;o validadas antes de serem dadas ao aplicativo. Se uma valida&#231;&#227;o de recurso falhar, ela ser&#225; destru&#237;da e um novo recurso ser&#225; criado e retornado. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Em qualquer falha</dt>
<dd><p>Se a caixa de verifica&#231;&#227;o Fechar todas as conex&#245;es estiver selecionada, o Servidor GlassFish ir&#225; fechar todas as conex&#245;es do conjunto e as restabelece em caso de falha de conex&#227;o &#250;nica. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Suporte de transa&#231;&#227;o</dt>
<dd><p>O suporte de transa&#231;&#227;o escolhido substitui o atributo do suporte de transa&#231;&#227;o no adaptador de recurso associado a esse conjunto de conex&#227;o de uma forma compat&#237;vel com descend&#234;ncia. Em outras palavras, pode dar suporte a um n&#237;vel de transa&#231;&#227;o mais baixo do que o especificado no adaptador de recurso, ou ao mesmo n&#237;vel de transa&#231;&#227;o especificado no adaptador de recurso, mas n&#227;o pode especificar um n&#237;vel mais alto.</p>

<p>O valor pode ser um dos seguintes:</p>

<dl><dt>Transa&#231;&#227;o XA</dt>
<dd><p>O adaptador de recurso suporta o gerenciador de recursos local e as transa&#231;&#245;es JTA ao implementar as interfaces LocalTransaction e XAResource. As transa&#231;&#245;es XA s&#227;o controladas e coordenadas por um gerenciador de transa&#231;&#245;es externo ao gerenciador de recursos.</p>

</dd>
<dt>LocalTransaction</dt>
<dd><p>O adaptador de recurso suporta as transa&#231;&#245;es locais ao implementar a interface LocalTransaction. As transa&#231;&#245;es locais s&#227;o gerenciadas internamente a um gerenciador de recursos e n&#227;o envolve nenhum gerenciador de transa&#231;&#245;es.</p>

</dd>
<dt>NoTransaction</dt>
<dd><p>O adaptador de recurso suporta o gerenciador de recursos local e as transa&#231;&#245;es JTA e n&#227;o implementa as interfaces XAResource ou LocalTransaction.</p>

</dd>
</dl>
</dd>
</dl>
<a name="gkoko"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li></ul>
<a name="gkold"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=flush-connection-pool-1"><tt>flush-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
