<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-resourceadapterconfig"></a><h4>Configs do adaptador de recurso</h4>
<a name="indexterm-59"></a><p>Use a p&#225;gina Configs do adaptador de recurso para gerenciar as configura&#231;&#245;es
do conector (adaptador de recurso).</p>

<p>O config do adaptador de recurso fornece informa&#231;&#245;es de configura&#231;&#227;o para um
adaptador de recurso. Com o Console de Administra&#231;&#227;o, voc&#234; cria um config
de adaptador de recurso ap&#243;s a implementa&#231;&#227;o do adaptador de recurso. Nesse
caso, o adaptador de recurso &#233; reiniciado com a nova configura&#231;&#227;o. Para
criar um config do adaptador de recurso antes de implementar o adaptador
de recursos, use o comando <tt>asadmin create-resource-adapter-config</tt>.</p>

<p>Antes de poder criar um config do adaptador de recurso, &#233; preciso
criar um conjunto do segmento para que o adaptador de recurso o
utilize.</p>

<p>Para cada config do adaptador de recurso, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do adaptador de recurso.</p>

</dd>
</dl>
<p>A tabela Configs tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo config do adaptador de recurso.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais configs do adaptador de recurso selecionados.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-resourceadapterconfignew.html">Para criar um config do adaptador de recurso</a></p>

</li>
<li><p><a href="task-resourceadapterconfigedit.html">Para editar um config do adaptador de recurso</a></p>

</li>
<li><p><a href="task-resourceadapterconfigdelete.html">Para excluir um config do adaptador de recurso</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-resource-adapter-config-1"><tt>create-resource-adapter-config</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-resource-adapter-configs-1"><tt>list-resource-adapter-configs</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-resource-adapter-config-1"><tt>delete-resource-adapter-config</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
