<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-worksecuritymaps"></a><h4>Mapas de seguran&#231;a de trabalho </h4>
<a name="indexterm-55"></a><a name="indexterm-56"></a><p>Use a p&#225;gina Mapas de seguran&#231;a do trabalho, para definir os mapas
de seguran&#231;a para os adaptadores de recurso.</p>

<p>Um mapa de seguran&#231;a do conector do trabalho, mapeia a identidade do
chamador do trabalho submetido por um adaptador de recurso principal EIS ou
por um grupo de usu&#225;rios EIS para um principal ou grupo de
usu&#225;rios adequado no dom&#237;nio de seguran&#231;a do Servidor GlassFish. Um ou mais
mapas de seguran&#231;a do trabalho podem ser associados com um adaptador de
recurso. A configura&#231;&#227;o do mapa de seguran&#231;a do conector do trabalho suporta
o uso de asterisco coringa (<tt>*</tt>) para indicar todos os usu&#225;rios ou
todos grupos de usu&#225;rios.</p>

<p>Um mapa de seguran&#231;a do trabalho &#233; diferente de uma mapa de
seguran&#231;a para um conjunto de conex&#245;es do conector, que mapeia o principal
recuperado durante a autentica&#231;&#227;o do servlet ou EJB, para as credenciais aceitas
pelo EIS. Consulte <a href="ref-connectorsecuritymaps.html">Mapas de seguran&#231;a do grupo de conex&#245;es do conector</a> para obter informa&#231;&#245;es sobre os mapas de seguran&#231;a
do conjunto de conex&#245;es do conector.</p>

<p>O sistema de informa&#231;&#245;es corporativas (EIS) &#233; um sistema que armazena os
dados de uma empresa. Ele pode ser um mainframe, um sistema de
mensagens, um sistema de banco de dados ou um aplicativo.</p>

<p>Para cada mapa de seguran&#231;a do trabalho, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do mapa de seguran&#231;a do trabalho.</p>

</dd>
</dl>
<p>A tabela Mapas de seguran&#231;a do trabalho tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo mapa de seguran&#231;a do trabalho.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais mapas de seguran&#231;a do trabalho selecionados.</p>

</dd>
</dl>
<a name="gkonb"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-worksecuritymapnew.html">Para criar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para excluir um mapa de seguran&#231;a do trabalho</a></p>

</li></ul>
<a name="gkolk"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-work-security-map-1"><tt>create-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-work-security-maps-1"><tt>list-connector-work-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-work-security-map-1"><tt>delete-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-work-security-map-1"><tt>update-connector-work-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
