<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpools"></a><h4>Conjuntos de conex&#245;es do conector</h4>
<a name="indexterm-39"></a><p>Use a p&#225;gina Conjuntos de conex&#245;es do conector para configurar conjuntos de
conex&#245;es do conector.</p>

<p>Um conjunto de conex&#245;es do conector &#233; um grupo de conex&#245;es reutiliz&#225;veis
para um determinado EIS.</p>

<p>Para cada recurso, as informa&#231;&#245;es abaixo s&#227;o fornecidas.</p>

<dl><dt>Nome do Conjunto</dt>
<dd><p>Um nome &#250;nico que identifica o conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Adaptador de recurso</dt>
<dd><p>O adaptador de recurso associado ao conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Defini&#231;&#227;o da conex&#227;o</dt>
<dd><p>O nome da classe da defini&#231;&#227;o da conex&#227;o para o conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do conjunto de conex&#245;es do conector.</p>

</dd>
</dl>
<p>A tabela Conjuntos tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais conjuntos de conex&#245;es do conector selecionados.</p>

</dd>
</dl>
<a name="gkoll"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li></ul>
<a name="gkonv"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
