<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpoolnew1"></a><h4>Novo grupo de conex&#227;o de conectores (Etapa 1 de 2)</h4>
<a name="indexterm-40"></a><p>Use a p&#225;gina Novo conjunto de conex&#245;es do conector (Etapa 1 de
2) para criar um novo conjunto de conex&#245;es do conector.</p>

<p>A p&#225;gina Novo conjunto de conex&#245;es do conector (Etapa 1 de 2)
cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Nome</dt>
<dd><p>Um nome &#250;nico que identifica o conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Adaptador de recurso</dt>
<dd><p>O adaptador de recurso associado ao conjunto de conex&#245;es do conector.</p>

</dd>
<dt>Defini&#231;&#227;o da conex&#227;o</dt>
<dd><p>A defini&#231;&#227;o da conex&#227;o para o conjunto de conex&#245;es do conector. As escolhas na lista dependem do adaptador de recurso selecionado. A defini&#231;&#227;o da conex&#227;o identifica um elemento <tt>conex&#227;o-defini&#231;&#227;o</tt> do adaptador de recurso no arquivo <tt>ra.xml</tt>.</p>

</dd>
</dl>
<a name="gkoos"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li></ul>
<a name="gkoma"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
