<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorsecuritymaps"></a><h4>Mapas de seguran&#231;a do grupo de conex&#245;es do conector</h4>
<a name="indexterm-46"></a><a name="indexterm-47"></a><p>Use a p&#225;gina Mapas de seguran&#231;a do conjunto de conex&#245;es do conector
para definir os mapas de seguran&#231;a do conjunto de conex&#245;es do conector.</p>

<p>Os mapas de seguran&#231;a dos conjuntos de conex&#245;es do conector permitem a
cria&#231;&#227;o de um mapeamento entre usu&#225;rios e grupos de Java EE e
usu&#225;rios e grupos de EIS. Um mapa de seguran&#231;a mapeia o principal
recuperado durante a autentica&#231;&#227;o do servlet ou EJB, para as credenciais aceitas
pelo EIS. &#201; poss&#237;vel mapear m&#250;ltiplos principais do &#38;ProductName: para o mesmo
principal back-end.</p>

<p>Um mapa de seguran&#231;a para um conjunto de conex&#245;es &#233; diferente de
um mapa de seguran&#231;a do conector de trabalho, no sentido que ele
mapeia um principal associado com uma inst&#226;ncia de trabalho de entrada para
um principal no dom&#237;nio de seguran&#231;a do Servidor GlassFish. Consulte <a href="ref-worksecuritymaps.html">Mapas de seguran&#231;a de trabalho </a> para
obter informa&#231;&#245;es sobre os mapas de seguran&#231;a do conector do trabalho.</p>

<p>Para cada mapa de seguran&#231;a, as seguintes informa&#231;&#245;es s&#227;o fornecidas.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do mapa de seguran&#231;a.</p>

</dd>
</dl>
<p>A tabela Mapas de seguran&#231;a tamb&#233;m cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o para criar um novo mapa de seguran&#231;a.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o para excluir um ou mais mapas de seguran&#231;a selecionados.</p>

</dd>
</dl>
<a name="gkolo"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li></ul>
<a name="gkolh"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-security-map-1"><tt>create-connector-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-security-maps-1"><tt>list-connector-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-security-map-1"><tt>delete-connector-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-security-map-1"><tt>update-connector-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
