<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpooladvance"></a><h4>Editar atributos avan&#231;ados do conjunto de conex&#245;es do conector</h4>
<a name="indexterm-43"></a><p>Use a p&#225;gina Editar conjunto de conex&#245;es do conector para modificar as
configura&#231;&#245;es avan&#231;adas do conjunto de conex&#245;es do conector.</p>

<p>A p&#225;gina Editar atributos avan&#231;ados do conjunto de conex&#245;es do conector cont&#233;m
as seguintes op&#231;&#245;es.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar com os valores padr&#227;o as configura&#231;&#245;es que apresentam valores padr&#227;o. As configura&#231;&#245;es que n&#227;o apresentam valores padr&#227;o n&#227;o s&#227;o alteradas.</p>

</dd>
<dt>Validar no m&#225;ximo uma vez</dt>
<dd><p>Especifica o intervalo de tempo, em segundos, entre sucessivas solicita&#231;&#245;es para validar uma conex&#227;o no m&#225;ximo uma vez. O valor padr&#227;o &#233; 0, o que significa que o atributo n&#227;o est&#225; ativado.</p>

</dd>
<dt>Tempo limite da perda</dt>
<dd><p>Per&#237;odo em segundos para rastrear as perdas de conex&#227;o em um conjunto de conex&#245;es. Um valor de 0 indica que o rastreamento do vazamento da conex&#227;o est&#225; desativado. O valor padr&#227;o &#233; 0.</p>

</dd>
<dt>Reclama&#231;&#227;o de perda</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, as conex&#245;es com vazamento ser&#227;o restauradas no conjunto ap&#243;s a conclus&#227;o do rastreamento de vazamento da conex&#227;o. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Novas tentativas de cria&#231;&#227;o</dt>
<dd><p>O n&#250;mero de tentativas a serem feitas se houver uma falha na cria&#231;&#227;o de uma nova conex&#227;o. O valor de 0 indica que nenhuma tentativa ser&#225; feita para criar a conex&#227;o novamente. O valor padr&#227;o &#233; 0.</p>

</dd>
<dt>Intervalo de nova tentativa</dt>
<dd><p>O intervalo de tempo, em segundos, entre duas tentativas de criar uma conex&#227;o. Esse atributo s&#243; ser&#225; usado se o valor Novas tentativas de cria&#231;&#227;o for maior que 0. O valor padr&#227;o &#233; 10 segundos.</p>

</dd>
<dt>Colocar no conjunto</dt>
<dd><p>Permite colocar no conjunto as conex&#245;es para o conjunto. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Associa&#231;&#227;o lenta</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, as conex&#245;es ser&#227;o associadas lentamente quando uma opera&#231;&#227;o for executada nelas. As conex&#245;es ser&#227;o desassociadas quando a transa&#231;&#227;o for conclu&#237;da e um m&#233;todo de componente for finalizado, o que ajuda a reutilizar as conex&#245;es f&#237;sicas. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Inscri&#231;&#227;o de conex&#227;o lenta</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, um recurso para a transa&#231;&#227;o ser&#225; inscrito somente quando a transa&#231;&#227;o for realmente usada em um m&#233;todo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Associar com segmento</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, uma conex&#227;o &#233; associada com o segmento. Quando o mesmo segmento for necess&#225;rio a uma conex&#227;o, a conex&#227;o j&#225; associada ao segmento poder&#225; ser reutilizada, n&#227;o incorrendo, portanto, na sobrecarga para obten&#231;&#227;o de outra conex&#227;o do conjunto. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Conex&#245;es correspondentes</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, a correspond&#234;ncia de conex&#227;o ser&#225; ativada para o conjunto. Essa op&#231;&#227;o poder&#225; ser desativada se voc&#234; souber que as conex&#245;es no conjunto ser&#227;o sempre homog&#234;neas e, portanto, uma conex&#227;o selecionada no conjunto n&#227;o precisar&#225; coincidir com o adaptador de recurso. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Corresponder o uso da conex&#227;o</dt>
<dd><p>O n&#250;mero de vezes que uma conex&#227;o deve ser reutilizada pelo conjunto. Depois que uma conex&#227;o &#233; reutilizada por um n&#250;mero especificado de vezes, ela &#233; fechada. O valor de 0 indica que o atributo est&#225; desativado. O valor padr&#227;o &#233; 0.</p>

</dd>
</dl>
<a name="gkomp"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li></ul>
<a name="gkonj"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
