<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-worksecuritymapnew"></a><h4>Novo mapa de seguran&#231;a do trabalho</h4>
<a name="indexterm-57"></a><a name="indexterm-58"></a><p>Use a p&#225;gina Novo mapa de seguran&#231;a do trabalho, para criar um
novo mapa de seguran&#231;a do trabalho.</p>

<p>A p&#225;gina Novo mapa de seguran&#231;a do trabalho cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Nome do mapa de seguran&#231;a </dt>
<dd><p>O nome do mapa de seguran&#231;a do trabalho.</p>

</dd>
<dt>Grupo</dt>
<dd><p>Se o bot&#227;o Mapeamento de grupo &#233; selecionado, o campo de texto precisa especificar um mapa para de cada grupo de usu&#225;rios EIS back-end para o correspondente grupo de usu&#225;rios definido no dom&#237;nio de seguran&#231;a do Servidor GlassFish. Use uma lista separada por v&#237;rgula para especificar mais de um mapeamento. Por exemplo:</p>

<pre>eis-group-1=server-group-1,eis-group-2=server-group-2</pre></dd>
<dt>Principal</dt>
<dd><p>Se o bot&#227;o Mapeamento principal &#233; selecionado, o campo de texto precisa especificar um mapa para de cada grupo de usu&#225;rios EIS back-end para o correspondente principal definido no dom&#237;nio de seguran&#231;a do Servidor GlassFish. Use uma lista separada por v&#237;rgula para especificar mais de um mapeamento. Por exemplo:</p>

<pre>eis-principal-1=server-principal-1,eis-principal-2=server-principal-2</pre></dd>
<dt>Adaptador de recurso</dt>
<dd><p>O adaptador de recurso para o EIS.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o para o mapa de seguran&#231;a do trabalho.</p>

</dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o est&#225; selecionada, o mapa de seguran&#231;a do trabalho ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
</dl>
<a name="gkomn"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-worksecuritymapnew.html">Para criar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para excluir um mapa de seguran&#231;a do trabalho</a></p>

</li></ul>
<a name="gkokn"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-work-security-map-1"><tt>create-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-work-security-maps-1"><tt>list-connector-work-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-work-security-map-1"><tt>delete-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-work-security-map-1"><tt>update-connector-work-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
