<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-resourceadapterconfigedit"></a><h4>Editar o config do adaptador de recurso</h4>
<a name="indexterm-61"></a><p>Use a p&#225;gina Editar a config do adaptador de recurso, para modificar
as configura&#231;&#245;es do adaptador de recurso.</p>

<p>A p&#225;gina Editar a config do adaptador de recurso cont&#233;m as seguintes
op&#231;&#245;es.</p>

<dl><dt>Nome do adaptador de recurso</dt>
<dd><p>O nome do adaptador de recurso que voc&#234; est&#225; configurando. O nome &#233; um campo somente leitura. Voc&#234; somente pode especificar um nome de adaptador de recurso quando cria uma nova configura&#231;&#227;o de adaptador de recurso.</p>

</dd>
<dt>ID do conjunto de segmentos</dt>
<dd><p>O nome de um conjunto de segmento a ser usado para a configura&#231;&#227;o do adaptador de recurso.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais para o adaptador de recurso. As propriedades dispon&#237;veis s&#227;o os nomes dos m&#233;todos setter da classe referenciada pelo elemento <tt>resourceadapter-class</tt> no arquivo <tt>ra.xml</tt>, que define o nome da classe do componente JavaBeans do adaptador de recurso. Quaisquer modifica&#231;&#245;es das propriedades aqui definidas sobrep&#245;em os valores presentes no <tt>ra.xml</tt></p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-resourceadapterconfignew.html">Para criar um config do adaptador de recurso</a></p>

</li>
<li><p><a href="task-resourceadapterconfigedit.html">Para editar um config do adaptador de recurso</a></p>

</li>
<li><p><a href="task-resourceadapterconfigdelete.html">Para excluir um config do adaptador de recurso</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-resource-adapter-config-1"><tt>create-resource-adapter-config</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-resource-adapter-configs-1"><tt>list-resource-adapter-configs</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-resource-adapter-config-1"><tt>delete-resource-adapter-config</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
