<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorsecuritymapedit"></a><h4>Editar mapa de seguran&#231;a do grupo de conex&#245;es do conector</h4>
<a name="indexterm-50"></a><a name="indexterm-51"></a><p>Use a p&#225;gina Novo mapa de seguran&#231;a do conjunto de conex&#245;es do
conector para editar o mapa de seguran&#231;a de um conjunto de conex&#245;es
do conector.</p>

<p>A p&#225;gina Editar mapa de seguran&#231;a do conjunto de conex&#245;es do conector
cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Nome do conjunto de conex&#245;es</dt>
<dd><p>O nome do conjunto de conex&#245;es do conector ao qual pertence este mapa de seguran&#231;a. O nome do conjunto &#233; um campo somente leitura.</p>

</dd>
<dt>Nome do mapa de seguran&#231;a </dt>
<dd><p>O nome do mapa de seguran&#231;a. O nome &#233; um campo somente leitura. Voc&#234; pode apenas especificar um nome de mapa de seguran&#231;a quando cria um novo mapa de seguran&#231;a.</p>

</dd>
<dt>Nome do mapa de seguran&#231;a </dt>
<dd><p>O nome do mapa de seguran&#231;a.</p>

</dd>
<dt>Grupos de usu&#225;rios</dt>
<dd><p>Se este bot&#227;o &#233; selecionado, o campo de texto precisa conter os nomes dos grupos de usu&#225;rios, separados por v&#237;rgulas.</p>

</dd>
<dt>Principais</dt>
<dd><p>Se este bot&#227;o &#233; selecionado, o campo de texto precisa conter os nomes principais, separados por v&#237;rgulas.</p>

</dd>
<dt>Nome do usu&#225;rio</dt>
<dd><p>O nome do usu&#225;rio principal back-end requerido pelo EIS.</p>

</dd>
<dt>Senha</dt>
<dd><p>A senha do principal back-end requerido pelo EIS.</p>

</dd>
</dl>
<a name="gkomo"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li></ul>
<a name="gkoot"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-security-map-1"><tt>create-connector-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-security-maps-1"><tt>list-connector-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-security-map-1"><tt>delete-connector-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-security-map-1"><tt>update-connector-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
