<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectorsecuritymapnew"></a><h3>Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</h3><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><a name="indexterm-12"></a><p>Os mapas de seguran&#231;a dos conjuntos de conex&#245;es do conector permitem a
cria&#231;&#227;o de um mapeamento entre usu&#225;rios e grupos de Java EE e
usu&#225;rios e grupos de EIS.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>Expanda o n&#243; Conectores.</b></li>
<li><b>Sob o n&#243; Conectores, selecione o n&#243; Conjuntos de conex&#245;es do conector.</b><p>A p&#225;gina Conjuntos de conex&#245;es do conector &#233; aberta.</p></li>
<li><b>Na p&#225;gina Conjuntos de conex&#245;es do conector, clique no nome do conjunto
de conex&#245;es do conector a ser editado.</b><p>A p&#225;gina Editar o conjunto de conex&#245;es do conector &#233; aberta.</p></li>
<li><b>Na p&#225;gina Editar o conjunto de conex&#245;es do conector, clique na aba
Mapas de seguran&#231;a.</b><p>A p&#225;gina Mapas de seguran&#231;a do conjunto de conex&#245;es do conector &#233;
aberta.</p></li>
<li><b>Na p&#225;gina Mapas de seguran&#231;a do conjunto de conex&#245;es do conector, clique
em Novo.</b><p>A p&#225;gina Novo mapa de seguran&#231;a do conjunto de conex&#245;es do conector
&#233; aberta.</p></li>
<li><b>No campo Nome do mapa de seguran&#231;a, digite um nome para o
mapa de seguran&#231;a.</b></li>
<li><b>Siga um dos procedimentos a seguir, mas n&#227;o ambos:</b><ul>
<li><b>Selecione o bot&#227;o Grupos de usu&#225;rios e digite os nomes dos grupos
de usu&#225;rios, separado por v&#237;rgulas.</b></li>
<li><b>Selecione o bot&#227;o Principais e digite os nomes dos principais, separado por
v&#237;rgulas.</b></li></ul></li>
<li><b>No campo Nome do usu&#225;rio, especifique o nome do usu&#225;rio principal back-end
requerido pelo EIS.</b></li>
<li><b>No campo Senha, especifique a senha do principal back-end requerido pelo EIS.</b></li>
<li><b>Clique em OK.</b></li>
<li><b>Reinicie o Servidor GlassFish.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-connectorresourcenew.html">Para criar um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorresourceedit.html">Para editar um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Para excluir um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Para definir o acesso EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Para criar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Para editar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Para excluir um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Para criar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para excluir um mapa de seguran&#231;a do trabalho</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
