<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-worksecuritymapedit"></a><h3>Para editar um mapa de seguran&#231;a do trabalho</h3><a name="indexterm-26"></a><a name="indexterm-27"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>Expanda o n&#243; Conectores.</b></li>
<li><b>Sob o n&#243; Conectores, selecione o n&#243; Mapas de seguran&#231;a do trabalho.</b><p>A p&#225;gina Mapas de seguran&#231;a do trabalho &#233; aberta.</p></li>
<li><b>Na p&#225;gina Mapas de seguran&#231;a do trabalho, clique no nome do mapa
de seguran&#231;a do trabalho a ser editado.</b><p>A p&#225;gina Editar o mapa de seguran&#231;a do trabalho &#233; aberta.</p></li>
<li><b>Use o campo Grupo ou o Principal, como a seguir.</b><ul>
<li><b>Se o bot&#227;o Grupo &#233; selecionado, digite um mapa de cada grupo
de usu&#225;rios EIS back-end para o correspondente grupo de usu&#225;rios definido no
dom&#237;nio de seguran&#231;a do Servidor GlassFish.</b><p>Use uma lista separada por v&#237;rgula para especificar mais de um mapeamento.
Por exemplo:</p><pre>eis-group-1=server-group-1,eis-group-2=server-group-2</pre></li>
<li><b>Se o bot&#227;o Principal &#233; selecionado, digite um mapa de principal EIS
back-end para o correspondente principal definido no dom&#237;nio de seguran&#231;a do Servidor
GlassFish.</b><p>Use uma lista separada por v&#237;rgula para especificar mais de um mapeamento.
Por exemplo:</p><pre>eis-principal-1=server-principal-1,eis-principal-2=server-principal-2</pre></li></ul></li>
<li><b>Na lista suspensa Adaptador de recurso, selecione o adaptador de recurso para
o EIS.</b></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o do mapa de seguran&#231;a do trabalho.</b></li>
<li><b>Selecione a caixa de verifica&#231;&#227;o Status ativo, para ativar o mapa de
seguran&#231;a do trabalho.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>Clique em OK.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-connectorresourcenew.html">Para criar um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorresourceedit.html">Para editar um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Para excluir um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Para definir o acesso EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Para criar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Para editar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Para excluir um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Para criar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para excluir um mapa de seguran&#231;a do trabalho</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
