<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectionservice"></a><h4>Para configurar o servi&#231;o do conector</h4><a name="indexterm-34"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Servi&#231;o do conector.</b><p>&#201; aberta a p&#225;gina Servi&#231;o do conector.</p></li>
<li><b>No campo Tempo limite de desligamento, digite o n&#250;mero m&#225;ximo de segundos
permitidos durante o desligamento do Servidor GlassFish, para que o m&#233;todo <tt>ResourceAdapter.stop</tt>
da inst&#226;ncia do m&#243;dulo do conector seja completado.</b><p>Os adaptadores de recursos que levam mais tempo para serem desligados s&#227;o
ignorados e o desligamento do Servidor GlassFish continua. O valor padr&#227;o &#233;
30 segundos.</p></li>
<li><b>Na lista suspensa Diretriz de carga de classe de conector, selecione a
diretriz a ser usada.</b><ul>
<li><b>Selecione <tt>derivado</tt>, para especificar que o adaptador de recurso &#233; fornecido de
acordo com as refer&#234;ncias de um aplicativo para qual um dos recursos
do adaptador de recurso.</b><p>Essa diretriz &#233; a padr&#227;o.</p></li>
<li><b>Selecione <tt>global</tt>, para especificar que todos os adaptadores de recurso ser&#227;o vis&#237;veis
para todos os aplicativos.</b></li></ul><p>Esta diretriz n&#227;o se aplica ao adaptador de recurso JMS pr&#233;-instalado, <tt>jmsra</tt>,
que sempre est&#225; vis&#237;vel para todos os aplicativos.</p></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="../../../common/pt_BR/help/task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
