<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-resourceadapterconfigedit"></a><h4>Para editar um config do adaptador de recurso</h4><a name="indexterm-32"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>Sob o n&#243; Recursos, selecione o n&#243; Configs do adaptador de recurso.</b><p>A p&#225;gina Configs do adaptador de recurso &#233; aberta.</p></li>
<li><b>Na p&#225;gina Configs do adaptador de recurso, clique no nome do config
do adaptador de recurso a ser editado.</b><p>A p&#225;gina Editar configs do adaptador de recurso &#233; aberta.</p></li>
<li><b>Na lista suspensa ID de conjunto de segmentos, selecione o conjunto de
segmentos a ser usado para a configura&#231;&#227;o do adaptador de recurso.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique propriedades adicionais para o adaptador de recurso.</b><p>As propriedades dispon&#237;veis s&#227;o os nomes dos m&#233;todos setter da classe referenciada
pelo elemento <tt>resourceadapter-class</tt> no arquivo <tt>ra.xml</tt>, que define o nome da classe do
componente JavaBeans do adaptador de recurso. Quaisquer modifica&#231;&#245;es das propriedades aqui definidas
sobrep&#245;em os valores presentes no <tt>ra.xml</tt></p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de verifica&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-resourceadapterconfignew.html">Para criar um config do adaptador de recurso</a></p>

</li>
<li><p><a href="task-resourceadapterconfigdelete.html">Para excluir um config do adaptador de recurso</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
