<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectorconnectionpoolnew"></a><h3>Para criar um conjunto de conex&#245;es do conector</h3><a name="indexterm-4"></a><p><b>Antes de come&#231;ar</b></p><p>Antes de criar o conjunto, implemente o m&#243;dulo conector (adaptador de recurso)
associado com o conjunto. Os valores especificados para o novo conjunto dependem
do m&#243;dulo conector que &#233; implementado.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>Expanda o n&#243; Conectores.</b></li>
<li><b>Sob o n&#243; Conectores, selecione o n&#243; Conjuntos de conex&#245;es do conector.</b><p>A p&#225;gina Conjuntos de conex&#245;es do conector &#233; aberta.</p></li>
<li><b>Na p&#225;gina Conjuntos de conex&#245;es do conector, clique em Novo.</b><p>A p&#225;gina Novo Conjunto de Conex&#245;es do Conector (Etapa 1 de 2)
&#233; aberta.</p></li>
<li><b>No campo Nome do conjunto, digite um nome exclusivo para o conjunto.</b><p>Especifique esse nome ao criar um recurso do conector.</p></li>
<li><b>Na lista suspensa Adaptador de recurso, selecione entre os adaptadores de recurso
implementado (m&#243;dulos de conector).</b></li>
<li><b>Na lista suspensa Defini&#231;&#227;o da conex&#227;o, selecione a defini&#231;&#227;o de conex&#227;o para
o conjunto de conex&#245;es do conector.</b><p>As op&#231;&#245;es da lista dependem do adaptador de recurso selecionado. A defini&#231;&#227;o
da conex&#227;o identifica um elemento <tt>conex&#227;o-defini&#231;&#227;o</tt> do adaptador de recurso no arquivo
<tt>ra.xml</tt>.</p></li>
<li><b>Clique em Avan&#231;ar.</b><p>A p&#225;gina Novo conjunto de conex&#245;es do conector (Etapa 2 de 2)
&#233; aberta.</p></li>
<li><b>Selecione a caixa de verifica&#231;&#227;o Ping ativado, para efetuar o ping no
conjunto durante a cria&#231;&#227;o ou reconfigura&#231;&#227;o, para identificar e avisar sobre valores
de atributos com erros.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o para o conjunto de conex&#245;es.</b></li>
<li><b>No campo Tamanho inicial e m&#237;nimo do conjunto, especifique o n&#250;mero m&#237;nimo
de conex&#245;es no conjunto.</b><p>O valor padr&#227;o &#233; 8.</p></li>
<li><b>No campo Tamanho m&#225;ximo do conjunto, especifique o n&#250;mero m&#225;ximo de conex&#245;es
nesse conjunto.</b><p>O valor padr&#227;o &#233; 32.</p></li>
<li><b>No campo Quantidade de Redimensionamento do Conjunto, especifique o n&#250;mero de conex&#245;es
a serem removidas quando o tempo-limite de inatividade do conjunto expirar.</b><p>O valor padr&#227;o &#233; 2.</p></li>
<li><b>No campo Tempo limite de inatividade, especifique a quantidade m&#225;xima de tempo,
em segundos, para que uma conex&#227;o permane&#231;a ociosa no conjunto.</b><p>O valor padr&#227;o &#233; 300.</p></li>
<li><b>No campo Tempo m&#225;x. de espera, especifique a quantidade m&#225;xima de tempo
que o aplicativo solicitante da conex&#227;o aguardar&#225; at&#233; que o tempo-limite da
conex&#227;o seja atingido.</b><p>O valor padr&#227;o &#233; 60000.</p></li>
<li><b>Marque a caixa de verifica&#231;&#227;o Valida&#231;&#227;o de conex&#227;o exigida para ativar a
valida&#231;&#227;o de conex&#227;o.</b><p>Se a caixa de verifica&#231;&#227;o Obrigat&#243;rio estiver marcada, as conex&#245;es s&#227;o validadas
antes de serem dadas ao aplicativo. Se uma valida&#231;&#227;o de recurso falhar,
ela ser&#225; destru&#237;da e um novo recurso ser&#225; criado e retornado. Por
padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Marque a caixa de verifica&#231;&#227;o Fechar todas as conex&#245;es em qualquer falha
para que o Servidor GlassFish feche todas as conex&#245;es no conjunto e
as restabele&#231;a de uma &#250;nica conex&#227;o falhar.</b><p>Se n&#227;o marcar a caixa de verifica&#231;&#227;o, conex&#245;es individuais ser&#227;o restabelecidas somente
quando forem usadas. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Na lista suspensa Suporte da transa&#231;&#227;o, selecione o tipo de suporte da
transa&#231;&#227;o para o conjunto de conex&#245;es.</b><p>O suporte de transa&#231;&#227;o escolhido substitui o atributo do suporte de transa&#231;&#227;o
no adaptador de recurso associado a esse conjunto de conex&#227;o de uma
forma compat&#237;vel com descend&#234;ncia. Em outras palavras, pode dar suporte a um
n&#237;vel de transa&#231;&#227;o mais baixo do que o especificado no adaptador de
recurso, ou ao mesmo n&#237;vel de transa&#231;&#227;o especificado no adaptador de recurso,
mas n&#227;o pode especificar um n&#237;vel mais alto.</p><p>As op&#231;&#245;es a seguir est&#227;o dispon&#237;veis na lista suspensa:</p><ul>
<li><b>NoTransactions: indica que o adaptador de recurso n&#227;o suporta o gerenciador de
recursos local ou as transa&#231;&#245;es JTA,  e n&#227;o implementa as interfaces
XAResource ou LocalTransaction.</b></li>
<li><b>LocalTransaction: indica que o adaptador de recurso suporta as transa&#231;&#245;es locais ao
implementar a interface LocalTransaction.</b><p>As transa&#231;&#245;es locais s&#227;o gerenciadas internamente a um gerenciador de recursos e
n&#227;o envolve nenhum gerenciador de transa&#231;&#245;es.</p></li>
<li><b>XATransaction: indica que o adaptador de recurso suporta o gerenciador de recursos
local e as transa&#231;&#245;es JTA ao implementar as interfaces LocalTransaction e XAResource.</b><p>As transa&#231;&#245;es XA s&#227;o controladas e coordenadas por um gerenciador de transa&#231;&#245;es
externo ao gerenciador de recursos.</p></li></ul></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique propriedades adicionais para o conjunto de conex&#245;es
do conector.</b><p>As propriedades dispon&#237;veis dependem do adaptador de recurso para o conjunto de
conex&#245;es do conector.</p><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>Se voc&#234; n&#227;o especifica um nome para uma propriedade, ela &#233; removida
da tabela quando termina de criar o conjunto de conex&#245;es. Caso n&#227;o
deseje definir agora um valor para uma propriedade, mas deseja que a
propriedade permane&#231;a na tabela para que o valor possa ser definido em
outro momento, digite um conjunto de par&#234;nteses vazios no campo Valor:</p><pre>()</pre></li>
<li><b>Clique em OK.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-connectorresourcenew.html">Para criar um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorresourceedit.html">Para editar um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Para excluir um recurso do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Para editar um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Para editar os atributos avan&#231;ados do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Para criar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Para editar um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Para excluir um mapa de seguran&#231;a para um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Para excluir um conjunto de conex&#245;es do conector</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Para definir o acesso EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Para criar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Para editar um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Para excluir um recurso de objeto administrado</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Para criar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Para editar um mapa de seguran&#231;a do trabalho</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Para excluir um mapa de seguran&#231;a do trabalho</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
