<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a> <a id="sthref248" name="sthref248"></a>&#26032;&#24314;&#38598;&#32676;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26032;&#24314;&#38598;&#32676;&rdquo;&#39029;&#21487;&#21019;&#24314;&#38598;&#32676;&#12290;</p>
<p>&ldquo;&#26032;&#24314;&#38598;&#32676;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#65306;</p>
<dl>
<dt>&#38598;&#32676;&#21517;&#31216;</dt>
<dd>
<p>&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#24517;&#39035;&#28385;&#36275;&#20197;&#19979;&#35201;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21517;&#31216;&#20013;&#20165;&#21487;&#20197;&#21253;&#21547; ASCII &#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#24320;&#22836;&#24517;&#39035;&#26159;&#23383;&#27597;&#12289;&#25968;&#23383;&#25110;&#19979;&#21010;&#32447;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#21482;&#33021;&#21253;&#21547;&#20197;&#19979;&#23383;&#31526;&#65306;</p>
<ul>
<li>
<p>&#23567;&#20889;&#23383;&#27597;</p>
</li>
<li>
<p>&#22823;&#20889;&#23383;&#27597;</p>
</li>
<li>
<p>&#25968;&#23383;</p>
</li>
<li>
<p>&#36830;&#23383;&#31526;</p>
</li>
<li>
<p>&#21477;&#28857;</p>
</li>
<li>
<p>&#19979;&#21010;&#32447;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#31216;&#22312;&#22495;&#20013;&#24517;&#39035;&#26159;&#21807;&#19968;&#30340;&#65292;&#32780;&#19988;&#19981;&#24471;&#26159;&#21478;&#19968;&#20010;&#38598;&#32676;&#12289;&#21629;&#21517;&#37197;&#32622;&#12289;GlassFish Server &#23454;&#20363;&#25110;&#33410;&#28857;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#19981;&#24471;&#26159; <code>domain</code>&#12289;<code>server</code> &#25110; GlassFish Server &#20445;&#30041;&#30340;&#20219;&#20309;&#20854;&#20182;&#20851;&#38190;&#23383;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#37197;&#32622;</dt>
<dd>
<p>&#38598;&#32676;&#21487;&#20351;&#29992;&#30340;&#29616;&#26377;&#21629;&#21517;&#37197;&#32622;&#30340;&#19979;&#25289;&#21015;&#34920;&#12290;&#38598;&#32676;&#38656;&#35201;&#19968;&#20010;&#21629;&#21517;&#37197;&#32622;&#65292;&#29992;&#20110;&#23450;&#20041;&#35201;&#28155;&#21152;&#21040;&#38598;&#32676;&#30340;&#25152;&#26377;&#23454;&#20363;&#30340;&#37197;&#32622;&#12290;&#24517;&#39035;&#20174;&#35813;&#21015;&#34920;&#20013;&#36873;&#25321;&#19968;&#20010;&#37197;&#32622;&#12290;&#38598;&#32676;&#22312;&#21019;&#24314;&#26102;&#23558;&#20351;&#29992;&#25152;&#36873;&#37197;&#32622;&#12290;</p>
</dd>
<dt>&#22797;&#21046;&#25152;&#36873;&#37197;&#32622;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#21019;&#24314;&#38598;&#32676;&#26102;&#20250;&#22797;&#21046;&#25152;&#36873;&#37197;&#32622;&#12290;&#20250;&#20026;&#35813;&#37197;&#32622;&#30340;&#21103;&#26412;&#25351;&#23450;&#19968;&#20010;&#21517;&#31216; cluster-name<code>-config</code>&#65292;&#20854;&#20013; <i>cluster-name</i> &#26159;&#22312;&ldquo;&#38598;&#32676;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#30340;&#38598;&#32676;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#20174;&ldquo;&#37197;&#32622;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#20102; <code>default-config</code>&#65292;&#21017;&#24517;&#39035;&#36873;&#25321;&#27492;&#36873;&#39033;&#12290;<code>default-config</code> &#37197;&#32622;&#21482;&#33021;&#34987;&#22797;&#21046;&#32780;&#19981;&#33021;&#34987;&#24341;&#29992;&#12290;</p>
</dd>
<dt>&#24341;&#29992;&#25152;&#36873;&#37197;&#32622;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#38598;&#32676;&#23558;&#20351;&#29992;&#25351;&#23450;&#30340;&#29616;&#26377;&#21629;&#21517;&#37197;&#32622;&#12290;</p>
<p>&#22914;&#26524;&#20174;&ldquo;&#37197;&#32622;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#20102; <code>default-config</code>&#65292;&#21017;<i>&#19981;&#33021;</i>&#36873;&#25321;&#27492;&#36873;&#39033;&#12290;<code>default-config</code> &#37197;&#32622;&#21482;&#33021;&#34987;&#22797;&#21046;&#32780;&#19981;&#33021;&#34987;&#24341;&#29992;&#12290;</p>
</dd>
<dt>&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;</dt>
<dd>
<p>&#21019;&#24314;&#38598;&#32676;&#26102;&#35201;&#21019;&#24314;&#30340; GlassFish Server &#23454;&#20363;&#30340;&#21015;&#34920;&#12290;&#23545;&#20110;&#27599;&#20010;&#23454;&#20363;&#65292;&#23558;&#25552;&#20379;&#20197;&#19979;&#20449;&#24687;&#65306;</p>
<dl>
<dt>&#23454;&#20363;&#21517;&#31216;</dt>
<dd>
<p>&#23454;&#20363;&#30340;&#21517;&#31216;&#12290;</p>
</dd>
<dt>&#26435;&#37325;</dt>
<dd>
<p>&#19968;&#20010;&#34920;&#31034;&#23454;&#20363;&#30340;&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30340;&#25972;&#25968;&#12290;</p>
<p>&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30830;&#23450;&#22312;&#23545;&#38598;&#32676;&#30340;&#25152;&#26377;&#35831;&#27714;&#20013;&#65292;&#23454;&#20363;&#24212;&#22788;&#29702;&#30340;&#35831;&#27714;&#25152;&#21344;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#23454;&#20363;&#30340;&#38598;&#32676;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010;&#23454;&#20363;&#26469;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#30340;&#35831;&#27714;&#65292;&#21478;&#19968;&#23454;&#20363;&#22788;&#29702;&#22235;&#20998;&#20043;&#19977;&#30340;&#35831;&#27714;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23558;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#35831;&#27714;&#30340;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 1&#65292;&#23558;&#21478;&#19968;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 3&#12290;&#22914;&#26524;&#24744;&#21916;&#27426;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#21017;&#20998;&#21035;&#23558;&#26435;&#37325;&#35774;&#32622;&#20026; 25 &#21644; 75&#12290;</p>
<p>&#40664;&#35748;&#26435;&#37325;&#20026; 100&#12290;</p>
</dd>
<dt>&#33410;&#28857;</dt>
<dd>
<p>&#23454;&#20363;&#21487;&#39547;&#30041;&#30340;&#29616;&#26377;&#33410;&#28857;&#30340;&#19979;&#25289;&#21015;&#34920;&#12290;&#24517;&#39035;&#20174;&#21015;&#34920;&#20013;&#36873;&#25321;&#19968;&#20010;&#33410;&#28857;&#12290;&#21019;&#24314;&#38598;&#32676;&#26102;&#65292;&#23454;&#20363;&#23558;&#39547;&#30041;&#22312;&#25152;&#36873;&#33410;&#28857;&#19978;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#34920;&#36824;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#65306;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#29992;&#20110;&#21019;&#24314;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;&#21333;&#20987;&#27492;&#25353;&#38062;&#21487;&#21521;&ldquo;&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#34920;&#20013;&#28155;&#21152;&#19968;&#34892;&#12290;</p>
</dd>
<dt>&#21024;&#38500;</dt>
<dd>
<p>&#29992;&#20110;&#21024;&#38500;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<p><a href="task-create-cluster.html">&#21019;&#24314;&#38598;&#32676;</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>&#31561;&#25928;&#30340; asadmin &#23376;&#21629;&#20196;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
