<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbcconnpooladvanceattrtab"></a><h4>Erweiterte Attribute des Verbindungspools bearbeiten</h4>
<a name="indexterm-24"></a><p>Auf der Seite "Erweiterte Attribute des Verbindungspools bearbeiten" k&#246;nnen Sie Attribute festlegen,
die bei der Diagnose von Verbindungslecks helfen und die Benutzerfreundlichkeit verbessern.</p>

<p>Die Seite "Erweiterte Attribute des Verbindungspools bearbeiten" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r alle Einstellungen.</p>

</dd>
<dt>Pool Name (Poolname)</dt>
<dd><p>Der Name des Verbindungspools. Der Name ist ein schreibgesch&#252;tztes Feld. Sie k&#246;nnen den Verbindungspoolnamen nur angeben, wenn Sie einen neuen JDBC-Verbindungspool erstellen.</p>

</dd>
<dt>Statement Timeout (Anweisungs-Zeit&#252;berschreitung)</dt>
<dd><p>Der Zeitraum in Sekunden, nach dessen Ablauf abnormal lang ausgef&#252;hrte Abfragen beendet werden. GlassFish-Server legt f&#252;r die erstellten Anweisungen <tt>QueryTimeout</tt> fest. Der Wert &#8211;1 bedeutet, dass die Option deaktiviert ist. Der Standardwert ist &#8211;1.</p>

</dd>
<dt>Gr&#246;&#223;e des Anweisungs-Caches</dt>
<dd><p>Die Anzahl der Anweisungen, die mit dem LRU-Caching-Mechanismus (Least Recently Used, Zuletzt verwendet) zwischengespeichert werden sollen. Beim Wert 0 ist die Zwischenspeicherung von Anweisungen deaktiviert. Der Standardwert ist 0.</p>

</dd>
<dt>Init SQL</dt>
<dd><p>Eine SQL-Zeichenfolge, die jedesmal auszuf&#252;hren ist, wenn eine Verbindung im Pool erstellt (nicht wiederverwendet) wird. Bei Ausf&#252;hrung dieser Zeichenfolge wird der Status der Verbindung initialisiert.</p>

</dd>
<dt>SQL-Trace-Zielger&#228;te</dt>
<dd><p>Eine mit Kommata getrennte Liste mit Namen von Zielger&#228;te-Implementierungsklassen, die angibt, dass von Anwendungen ausgef&#252;hrte SQL-Anweisungen verfolgt werden. Die Zielger&#228;teklassen m&#252;ssen die Schnittstelle <tt>org.glassfish.api.jdbc.SQLTraceListener</tt> implementieren. Die Verwendung von Zielger&#228;ten erm&#246;glicht die problemlose Filterung von Protokollmeldungen f&#252;r die SQL-Anweisungen und unterst&#252;tzt Administratoren bei der Analyse der Anweisungen. </p>

</dd>
<dt>Wrap JDBC Objects (JDBC-Objekte umbrechen)</dt>
<dd><p>Wenn diese Option aktiviert ist, erhalten die Anwendungen umbrochene JDBC-Objekte f&#252;r Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Poolen</dt>
<dd><p>Aktiviert das Verbindungspooling f&#252;r den Pool. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Validate At Most Once (H&#246;chstens einmal &#252;berpr&#252;fen)</dt>
<dd><p>Gibt das Zeitintervall (in Sekunden) zwischen den aufeinander folgenden Anforderungen an, die dazu dienen, eine Verbindung maximal ein Mal zu validieren. Wenn Sie dieses Attribut auf einen angemessenen Wert setzen, wird die Anzahl der von einer Verbindung ausgegebenen Validierungsanforderungen minimiert. Der Standardwert lautet 0, d. h., das Attribut ist nicht aktiviert.</p>

</dd>
<dt>Leak Timeout (Verbindungsleck-Zeit&#252;berschreitung)</dt>
<dd><p>Die Zeitspanne in Sekunden zur Verfolgung von Verbindungslecks in einem Verbindungspool. Mit diesem Feld k&#246;nnen Sie potenzielle, durch die Anwendung verursachte Verbindungslecks ermitteln. Eine Verbindung, die von der Anwendung nicht innerhalb des angegebenen Zeitraums an den Pool zur&#252;ckgegeben wird, wird als potenzielles Leck betrachtet, und ein Stackprotokoll des aufrufenden Programms wird protokolliert. Der Wert 60 bedeutet, dass die Verfolgung von Verbindungslecks deaktiviert ist. Der Standardwert ist 0.</p>

<p>Verwenden Sie dieses Feld in Kombination mit "Leck zur&#252;ckfordern", um potenzielle, durch die Anwendung verursachte Verbindungslecks zu verhindern.</p>

</dd>
<dt>Leak Reclaim (Leck zur&#252;ckfordern)</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Verbindungen mit Leck im Pool wiederhergestellt, nachdem die Verfolgung von Verbindungslecks abgeschlossen ist. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Creation Retry Attempts (Herstellungs-Neuversuche)</dt>
<dd><p>Die Anzahl der Neuversuche, wenn bei der Erstellung einer neuen Verbindung ein Fehler aufgetreten ist. Der Wert 0 bedeutet, dass keine Neuversuche zur Verbindungsherstellung unternommen werden. Der Standardwert ist 0.</p>

</dd>
<dt>Retry Interval (Wiederholungsintervall)</dt>
<dd><p>Das Intervall (in Sekunden) zwischen zwei Versuchen zur Erstellung einer Verbindung. Der Standardwert ist 10. Dieses Attribut wird nur verwendet, wenn der Wert von "Herstellungs-Neuversuche" h&#246;her als 0 liegt.</p>

</dd>
<dt>Lazy Association (Tr&#228;ge Assoziation)</dt>
<dd><p>Bei aktivierter Option wird eine physische Verbindung nur dann mit einer logischen Verbindung verkn&#252;pft, wenn die Verbindung verwendet wird. Die Verkn&#252;pfung wird wieder aufgehoben, wenn die Transaktion abgeschlossen ist und eine Komponentenmethode beendet wird. Auf diese Weise wird die Wiederverwendung der physischen Verbindungen gef&#246;rdert. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Lazy Connection Enlistment (Inanspruchnahme tr&#228;ger Verbindungen)</dt>
<dd><p>Bei aktivierter Option wird eine Ressource nur dann f&#252;r die Transaktion eingetragen, wenn sie tats&#228;chlich in einer Methode verwendet wird. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Associate with Thread (Mit Thread verkn&#252;pfen)</dt>
<dd><p>Bei aktivierter Option wird eine Verbindung mit einem Thread verkn&#252;pft. Wenn derselbe Thread eine weitere Verbindung ben&#246;tigt, kann er die bereits mit diesem Thread verkn&#252;pfte Verbindung wiederverwenden, wodurch die zus&#228;tzliche Belastung durch das Abrufen einer weiteren Verbindung aus dem Pool vermieden wird. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Match Connections (Verbindungen abgleichen)</dt>
<dd><p>Bei aktivierter Option muss eine aus dem Pool ausgew&#228;hlte Verbindung mit den Verbindungen abgeglichen werden, die bestimmte Credentials aufweisen. Diese Option muss aktiviert werden, wenn der Verbindungspools von Anwendungen verwendet wird, die &#252;ber mehrere Benutzer-Credentials verf&#252;gen. Diese Option kann ohne Probleme deaktiviert werden, wenn der Administrator wei&#223;, dass die Verbindungen im Pool immer homogen sind und eine aus dem Pool abgerufene Verbindung daher nicht vom Ressourcenadapter abgeglichen werden muss. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Max Connection Usage (Max. Verbindungsnutzung)</dt>
<dd><p>Die Anzahl der Wiederverwendungen einer Verbindung durch den Pool. Nachdem eine Verbindung so h&#228;ufig wie angegeben wiederverwendet wurde, wird sie geschlossen. Indem Sie die Anzahl der Wiederverwendungen einer Verbindung beschr&#228;nken, k&#246;nnen Sie Anweisungslecks vermeiden, falls eine Anwendung Anweisungen nicht schlie&#223;t. Der Wert 0 bedeutet, dass die Option deaktiviert ist. Der Standardwert ist 0.</p>

</dd>
<dt>Connection Validation (Verbindungs&#252;berpr&#252;fung)</dt>
<dd><p>Bei aktivierter Option ist die Verbindungs&#252;berpr&#252;fung erforderlich, die dem Server bei einem Fehlschlagen einen erneuten Verbindungsaufbau erm&#246;glicht.</p>

</dd>
<dt>Validation Method (&#220;berpr&#252;fungsmethode)</dt>
<dd><p>GlassFish-Server kann Datenbankverbindungen auf folgende Weisen &#252;berpr&#252;fen.</p>

<dl><dt><tt>auto-commit</tt> und <tt>metadata</tt></dt>
<dd><p>GlassFish-Server &#252;berpr&#252;ft eine Verbindung durch Aufruf der Methode <tt>con.getAutoCommit</tt> oder <tt>con.getMetaData</tt>. </p>


<hr><p><b>Hinweis - </b>Viele JDBC-Treiber zwischenspeichern die Ergebnisse dieser Aufrufe. Folglich f&#252;hren diese Aufrufe nicht immer zu verl&#228;sslichen &#220;berpr&#252;fungen. Informieren Sie sich beim Treiberhersteller, ob diese Aufrufe zwischengespeichert werden oder nicht.</p>


<hr>
</dd>
<dt><tt>custom-validation</tt></dt>
<dd><p>GlassFish-Server verwendet einen benutzerdefinierten &#220;berpr&#252;fungsmechanismus, der durch die benutzerdefinierte Implementierungsklasse im Feld &#220;berpr&#252;fungsklassenname angegeben wird.</p>

</dd>
<dt><tt>table</tt></dt>
<dd><p>Die Anwendung fragt die angegebene Datenbanktabelle ab. Die Tabelle muss vorhanden und zug&#228;nglich sein, sie muss aber keine Zeilen enthalten. Sie sollten keine bereits vorhandene Tabelle mit einer gro&#223;en Anzahl Zeilen oder eine Tabelle verwenden, auf die h&#228;ufig zugegriffen wird.</p>

</dd>
</dl>
</dd>
<dt>Table Name (Tabellenname)</dt>
<dd><p>Name der zu &#252;berpr&#252;fenden Datenbanktabelle. Dieses Feld ist nur verf&#252;gbar, wenn die &#220;berpr&#252;fungsmethode <tt>table</tt> festgelegt wurde.</p>

</dd>
<dt>&#220;berpr&#252;fungsklassenname</dt>
<dd><p>Der Name einer benutzerdefinierten &#220;berpr&#252;fungsimplementierungsklasse. Dieses Feld ist nur verf&#252;gbar, wenn die &#220;berpr&#252;fungsmethode <tt>custom-validation?</tt> festgelegt wurde. Der angegebene Klassenname muss f&#252;r GlassFish-Server zug&#228;nglich sein. Die angegebene Klasse muss die Schnittstelle <tt>org.glassfish.api.jdbc.ConnectionValidation</tt> implementieren.</p>

</dd>
<dt>On Any Failure (Bei s&#228;mtlichen Fehlern)</dt>
<dd><p>Bei aktivierter Option schlie&#223;t GlassFish-Server alle Verbindungen im Pool und stellt sie erneut her, wenn eine Verbindung fehlschl&#228;gt. Bei deaktivierter Option werden einzelne Verbindungen nur bei Verwendung wiederhergestellt. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Allow Non Component Callers (Aufrufe durch Nicht-Komponenten zulassen)</dt>
<dd><p>Bei aktivierter Option kann der Pool durch Aufrufe von Nicht-Komponenten, wie z. B. Servletfilter und Persistance Manager von Drittanbietern, verwendet werden. Verbindungen, die durch Aufrufe von Nicht-Komponenten hergestellt werden, werden am Ende einer Transaktion nicht automatisch vom Container geschlossen. Sie m&#252;ssen explizit vom aufrufenden Programm geschlossen werden. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
</dl>
<a name="gkonw"></a><h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-setdbaccess.html">So richten Sie den Datenbankzugriff ein</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">So integrieren Sie einen JDBC-Treiber</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">So erstellen Sie einen JDBC-Verbindungspool</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">So bearbeiten Sie die allgemeinen JDBC-Verbindungspooleinstellungen</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">So &#252;berpr&#252;fen Sie die Verbindungspooleinstellungen</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">So bearbeiten Sie die erweiterten Attribute eines JDBC-Verbindungspools</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">So bearbeiten Sie Eigenschaften von JDBC-Verbindungspools</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">So l&#246;schen Sie einen JDBC-Verbindungspool</a></p>

</li></ul>
<a name="gkoli"></a><h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=add-resources-1"><tt>add-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jdbc-connection-pool-1"><tt>create-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jdbc-connection-pool-1"><tt>delete-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jdbc-connection-pools-1"><tt>list-jdbc-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=ping-connection-pool-1"><tt>ping-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-database-1"><tt>start-database</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-database-1"><tt>stop-database</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
