<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpooledit"></a><h4>Modification du pool de connexions du connecteur</h4>
<a name="indexterm-42"></a><p>Utilisez la page Modification du pool de connexions du connecteur pour modifier
les param&#232;tres d&#8217;un pool de connexions du connecteur. </p>

<p>La page Modification du pool de connexions du connecteur contient les options
suivantes.</p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Vider</dt>
<dd><p>Bouton pour r&#233;initialiser les connexions dans le pool de connexions. Cliquer sur ce bouton revient &#224; d&#233;truire toutes les connexions existantes, &#224; recr&#233;er les connexions &#233;tablies pour le pool, et &#224; restaurer le pool &#224; sa taille initiale et minimale. </p>

</dd>
<dt>Ping</dt>
<dd><p>Bouton pour v&#233;rifier que le pool de connexions est utilisable. </p>

</dd>
<dt>Nom du pool</dt>
<dd><p>Un nom unique qui identifie le pool de connexions du connecteur. Ce champ est en lecture seule. Vous pouvez sp&#233;cifier le nom de pool uniquement lorsque vous cr&#233;ez un pool de connexions du connecteur.</p>

</dd>
<dt>Adaptateur de ressources</dt>
<dd><p>L&#8217;adaptateur de ressources associ&#233; au pool de connexions du connecteur. </p>

</dd>
<dt>D&#233;finition de connexion</dt>
<dd><p>La d&#233;finition de connexion pour le pool de connexions du connecteur. Les choix dans la liste d&#233;pendent de l&#8217;adaptateur de ressource que vous avez s&#233;lectionn&#233;. La d&#233;finition de connexion identifie l&#8217;&#233;l&#233;ment <tt>connection-definition</tt> de l&#8217;adaptateur de ressources dans le fichier <tt>ra.xml</tt>.</p>

</dd>
<dt>Ping</dt>
<dd><p>Lorsque cette option est activ&#233;e, un ping est r&#233;alis&#233; vers le pool au cours de la cr&#233;ation ou de la reconfiguration afin d&#8217;identifier et de signaler les valeurs incorrectes de ses attributs, le cas &#233;ch&#233;ant. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Description</dt>
<dd><p>Une description du pool de connexions du connecteur. </p>

</dd>
<dt>Taille initiale et minimale du pool</dt>
<dd><p>Le nombre minimum de connexions dans le pool de connexions de connecteur. La valeur par d&#233;faut est 8.</p>

</dd>
<dt>Taille maximale du pool</dt>
<dd><p>Le nombre maximum de connexions dans le pool de connexions de connecteur. La valeur par d&#233;faut est 32.</p>

</dd>
<dt>Valeur de redimensionnement du pool</dt>
<dd><p>Le nombre de connexions &#224; supprimer lorsque le d&#233;lai d&#8217;inactivit&#233; du pool expire. La valeur par d&#233;faut est 2.</p>

</dd>
<dt>D&#233;lai d&#8217;inactivit&#233;</dt>
<dd><p>Temps maximum en secondes durant lequel une connexion demeure inactive dans le pool. La valeur par d&#233;faut est 300.</p>

</dd>
<dt>Attente max.</dt>
<dd><p>Dur&#233;e pendant laquelle l&#8217;application demandant une connexion doit patienter avant d&#8217;&#234;tre notifi&#233;e de l&#8217;expiration de la connexion. La valeur par d&#233;faut est 60 000.</p>

</dd>
<dt>Validation des connexions</dt>
<dd><p>Si la case Requis est s&#233;lectionn&#233;e, les connexions sont valid&#233;es avant d&#8217;&#234;tre donn&#233;es &#224; l&#8217;application. Si la validation d&#8217;une ressource &#233;choue, elle est d&#233;truite et une nouvelle ressource est cr&#233;&#233;e et renvoy&#233;e. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Sur tout &#233;chec</dt>
<dd><p>Si la case Fermer toutes les connexions est coch&#233;e, GlassFish Server ferme toutes les connexions du pool et les r&#233;tablit si une seule connexion &#233;choue. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Prise en charge des transactions</dt>
<dd><p>La prise en charge des transactions choisie remplace l&#8217;attribut de prise en charge des transactions dans l&#8217;adaptateur de ressources associ&#233; &#224; ce pool de connexions de fa&#231;on &#224; garantir la compatibilit&#233; descendante. En d&#8217;autres mots, il peut prendre en charge un niveau de transaction inf&#233;rieur &#224; celui sp&#233;cifi&#233; dans l&#8217;adaptateur de ressources, ou le m&#234;me niveau de transaction que celui sp&#233;cifi&#233; dans l&#8217;adaptateur de ressources, mais il ne peut pas sp&#233;cifier un niveau sup&#233;rieur.</p>

<p>La valeur peut &#234;tre l&#8217;une des suivantes&#160;:</p>

<dl><dt>XATransaction</dt>
<dd><p>L&#8217;adaptateur de ressources prend en charge les transactions JTA et les transactions locales du gestionnaire de ressources en impl&#233;mentant les interfaces LocalTransaction et XAResource. Les transactions XA sont contr&#244;l&#233;es et d&#233;termin&#233;es par un gestionnaire de transactions externe &#224; un gestionnaire de ressources.</p>

</dd>
<dt>LocalTransaction</dt>
<dd><p>L&#8217;adaptateur de ressources prend en charge les transactions locales en impl&#233;mentant l&#8217;interface LocalTransaction. Les transactions locales sont g&#233;r&#233;es dans un gestionnaire de ressources et n&#8217;impliquent aucun gestionnaire de transactions externe.</p>

</dd>
<dt>NoTransaction</dt>
<dd><p>L&#8217;adaptateur de ressources ne prend pas en charge des transactions JTA ou des transactions locales du gestionnaire de ressources et n&#8217;impl&#233;mente pas les interfaces XAResource ou LocalTransaction. </p>

</dd>
</dl>
</dd>
</dl>
<a name="gkoko"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Cr&#233;er un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Modifier un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Pour modifier un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Supprimer un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Supprimer un pool de connexions du connecteur</a></p>

</li></ul>
<a name="gkold"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=flush-connection-pool-1"><tt>flush-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
