<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-adminobjectedit"></a><h4>Modification d&#8217;une ressource d&#8217;objet d&#8217;administration</h4>
<a name="indexterm-54"></a><p>Utilisez la page Modification d&#8217;une ressource d&#8217;objet d&#8217;administration pour modifier les param&#232;tres
d&#8217;une ressource d&#8217;objet d&#8217;administration. </p>

<p>La page Modification d&#8217;une ressource d&#8217;objet d&#8217;administration contient les options suivantes. </p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom JNDI</dt>
<dd><p>Un nom unique qui identifie la ressource d&#8217;objet d&#8217;administration. Le champ Nom JNDI est en lecture seule. Vous pouvez sp&#233;cifier le nom JNDI uniquement lorsque vous cr&#233;ez une nouvelle ressource d&#8217;objet d&#8217;administration.</p>

</dd>
<dt>Adaptateur de ressources</dt>
<dd><p>L&#8217;adaptateur de ressources pour la ressource d&#8217;objet d&#8217;administration. </p>

</dd>
<dt>Type de ressource</dt>
<dd><p>Le type Java de la ressource d&#8217;objet d&#8217;administration (ou par exemple <tt>javax.jms.Topic</tt>). </p>

</dd>
<dt>Nom de classe</dt>
<dd><p>Le nom de la classe d&#8217;impl&#233;mentation associ&#233; au type de ressource.</p>

</dd>
<dt>Description</dt>
<dd><p>Une description de la ressource d&#8217;objet d&#8217;administration. </p>

</dd>
<dt>Statut</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, la ressource d&#8217;objet d&#8217;administration est activ&#233;e. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Propri&#233;t&#233;s suppl&#233;mentaires pour la ressource d&#8217;objet d&#8217;administration. Les propri&#233;t&#233;s disponibles d&#233;pendent de l&#8217;adaptateur de ressources pour le pool de connexions du connecteur. Les paires Nom-Valeur sp&#233;cifi&#233;es dans ce tableau peuvent &#234;tre utilis&#233;es pour remplacer les valeurs par d&#233;faut pour les propri&#233;t&#233;s d&#233;finies par le fournisseur de l&#8217;adaptateur de ressources.</p>

</dd>
</dl>
<a name="gkomq"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-adminobjectnew.html">Cr&#233;er une ressource d'objet g&#233;r&#233;</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Modifier une ressource d'objet administr&#233;</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Supprimer une ressource d'objet g&#233;r&#233;</a></p>

</li></ul>
<a name="gkonl"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-admin-object-1"><tt>create-admin-object</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-admin-objects-1"><tt>list-admin-objects</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-admin-object-1"><tt>delete-admin-object</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
