<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorconnectionpoolproperty"></a><h4>Modifier les propri&#233;t&#233;s d&#8217;un pool de connexions de connecteur</h4>
<a name="indexterm-44"></a><a name="indexterm-45"></a><p>Utilisez la page Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur
pour modifier les propri&#233;t&#233;s d&#8217;un pool de connexions de connecteur. </p>

<p>La page Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur contient
les options suivantes.</p>

<dl><dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Propri&#233;t&#233;s suppl&#233;mentaires pour le pool de connexions de connecteur. Les propri&#233;t&#233;s disponibles d&#233;pendent de l&#8217;adaptateur de ressources pour le pool de connexions du connecteur. Les paires Nom-Valeur sp&#233;cifi&#233;es dans ce tableau peuvent &#234;tre utilis&#233;es pour remplacer les valeurs par d&#233;faut pour les propri&#233;t&#233;s d&#233;finies par le fournisseur de l&#8217;adaptateur de ressources.</p>

<p>Si vous n&#8217;indiquez pas de valeur pour une propri&#233;t&#233;, celle-ci est supprim&#233;e de la table &#224; l&#8217;issue de la modification du pool de connexions. Si vous ne souhaitez pas d&#233;finir imm&#233;diatement la valeur d&#8217;une propri&#233;t&#233; mais souhaitez conserver cette propri&#233;t&#233; dans la table afin de d&#233;finir sa valeur ult&#233;rieurement, entrez des parenth&#232;ses vides dans le champ Valeur&#160;:</p>

<pre>()</pre></dd>
</dl>
<a name="gkols"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Cr&#233;er un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Modifier un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Pour modifier un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Supprimer un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Supprimer un pool de connexions du connecteur</a></p>

</li></ul>
<a name="gkolf"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-connection-pool-1"><tt>create-connector-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-connection-pools-1"><tt>list-connector-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-connection-pool-1"><tt>delete-connector-connection-pool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
