<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectionservice"></a><h4>Service du connecteur </h4>
<a name="indexterm-62"></a><p>Utilisez la page Service du connecteur pour modifier les param&#232;tres g&#233;n&#233;raux pour
le service du connecteur, qui r&#233;git les adaptateurs de ressources. </p>

<p>La page Service du connecteur contient les options suivantes.</p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>D&#233;lai d&#8217;arr&#234;t</dt>
<dd><p>Le nombre maximum de secondes autoris&#233; pendant l&#8217;arr&#234;t de GlassFish Server pour que la m&#233;thode <tt>ResourceAdapter.stop</tt> d&#8217;une instance de module connecteur se termine. Les adaptateurs de ressources d&#233;passant ce d&#233;lai pour s&#8217;arr&#234;ter sont ignor&#233;s et l&#8217;arr&#234;t de GlassFish Server se poursuit. La valeur par d&#233;faut est 30 secondes.</p>

</dd>
<dt>Strat&#233;gie de chargement de classe de connecteur</dt>
<dd><p>La strat&#233;gie &#224; utiliser pour le chargement des classes. Les choix disponibles sont les suivants :</p>

<dl><dt><tt>derived</tt></dt>
<dd><p>Indique que les adaptateurs de ressources sont fournis selon les r&#233;f&#233;rences d&#8217;une application vers l&#8217;une des ressources de l&#8217;adaptateur de ressources. Cette strat&#233;gie est la strat&#233;gie par d&#233;faut.</p>

</dd>
<dt><tt>global</tt></dt>
<dd><p>Indique que tous les adaptateurs de ressources seront visibles &#224; toutes les applications.</p>

</dd>
</dl>
<p>Cette strat&#233;gie ne s&#8217;applique pas &#224; l&#8217;adaptateur de ressources du syst&#232;me JMS pr&#233;install&#233;, <tt>jmsra</tt>, qui est toujours visible de toutes les applications. </p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-connectionservice.html">Configurer le service du connecteur</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3029&id=task-appdeployconn">D&#233;ployer un module connecteur</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
