<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-worksecuritymaps"></a><h4>Mappages de s&#233;curit&#233; de travail</h4>
<a name="indexterm-55"></a><a name="indexterm-56"></a><p>Utilisez la page Mappages de s&#233;curit&#233; de travail pour configurer les mappages
de s&#233;curit&#233; de travail pour les adaptateurs de ressources. </p>

<p>Un mappage de s&#233;curit&#233; de travail du connecteur associe l&#8217;identit&#233; de l&#8217;appelant
du travail fourni par le principal SIE ou un groupe d&#8217;utilisateurs SIE de
l&#8217;adaptateur de ressources &#224; un principal ou &#224; un groupe d&#8217;utilisateurs appropri&#233;
dans le domaine de s&#233;curit&#233; GlassFish Server. Un ou plusieurs mappages de
s&#233;curit&#233; de travail peuvent &#234;tre associ&#233;s &#224; un adaptateur de ressources. La
configuration du mappage de s&#233;curit&#233; de travail du connecteur prend en charge
l&#8217;utilisation du caract&#232;re g&#233;n&#233;rique ast&#233;risque (<tt>*</tt>) pour indiquer tous les utilisateurs ou
tous les groupes d&#8217;utilisateur. </p>

<p>Un mappage de s&#233;curit&#233; de travail diff&#232;re d&#8217;un mappage de s&#233;curit&#233; pour
un pool de connexions de connecteur, qui associe le principal re&#231;u pendant
l&#8217;authentification EJB ou du servlet aux donn&#233;es d&#8217;authentification accept&#233;es par le syst&#232;me
SIE. Reportez-vous &#224; la section <a href="ref-connectorsecuritymaps.html">Mappages de s&#233;curit&#233; des pools de connexions du connecteur</a> pour de plus amples informations sur
les mappages de s&#233;curit&#233; des pools de connexions du connecteur.</p>

<p>Le syst&#232;me d&#8217;information d&#8217;entreprise (SIE) constitue tout syst&#232;me contenant des donn&#233;es de
l&#8217;organisation. Il peut s&#8217;agir d&#8217;un mainframe, d&#8217;un syst&#232;me de messagerie, d&#8217;un syst&#232;me
de base de donn&#233;es ou d&#8217;une application.</p>

<p>Pour chaque mappage de s&#233;curit&#233; de travail, les informations suivantes sont fournies.</p>

<dl><dt>Nom</dt>
<dd><p>Le nom du mappage de s&#233;curit&#233; de travail.</p>

</dd>
</dl>
<p>Le tableau Mappages de s&#233;curit&#233; de travail contient &#233;galement les options suivantes.
</p>

<dl><dt>Nouveau</dt>
<dd><p>Bouton pour cr&#233;er un nouveau mappage de s&#233;curit&#233; de travail. </p>

</dd>
<dt>Supprimer</dt>
<dd><p>Bouton pour supprimer un ou plusieurs mappages de s&#233;curit&#233; de travail s&#233;lectionn&#233;s. </p>

</dd>
</dl>
<a name="gkonb"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-worksecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; de travail</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Modifier un mappage de s&#233;curit&#233; de travail</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Supprimer un mappage de s&#233;curit&#233; de travail</a></p>

</li></ul>
<a name="gkolk"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-work-security-map-1"><tt>create-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-work-security-maps-1"><tt>list-connector-work-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-work-security-map-1"><tt>delete-connector-work-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-work-security-map-1"><tt>update-connector-work-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
