<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorresourcenew"></a><h4>Nouvelle ressource de connecteur</h4>
<a name="indexterm-37"></a><p>Utilisez la page Nouvelle ressource de connecteur pour cr&#233;er une nouvelle ressource
du connecteur.</p>

<p>La page Nouvelle ressource de connecteur contient les options suivantes.</p>

<dl><dt>Nom JNDI</dt>
<dd><p>Un nom unique qui identifie la ressource du connecteur.</p>

</dd>
<dt>Nom du pool</dt>
<dd><p>Le pool de connexions auquel appartient la nouvelle ressource de connecteur. </p>

</dd>
<dt>Description</dt>
<dd><p>Une description de la ressource du connecteur. </p>

</dd>
<dt>Statut</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, la ressource du connecteur est activ&#233;e. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Propri&#233;t&#233;s suppl&#233;mentaires pour la ressource du connecteur. Les propri&#233;t&#233;s disponibles d&#233;pendent de l&#8217;adaptateur de ressources pour le pool de connexions du connecteur. Les paires Nom-Valeur sp&#233;cifi&#233;es dans ce tableau peuvent &#234;tre utilis&#233;es pour remplacer les valeurs par d&#233;faut pour les propri&#233;t&#233;s d&#233;finies par le fournisseur de l&#8217;adaptateur de ressources.</p>

</dd>
<dt>Cibles</dt>
<dd><p>Clusters et instances autonomes pour la ressource du connecteur. D&#233;placez les cibles voulues dans la colonne Cibles s&#233;lectionn&#233;es &#224; l'aide des boutons Ajouter et Tout Ajouter. D&#233;placez toutes les cibles inutiles dans la colonne Cibles disponibles &#224; l'aide des boutons Supprimer et Tout Supprimer. </p>

<p>Cette option s'affiche uniquement si les clusters ou les instances autonomes ont &#233;t&#233; cr&#233;&#233;s dans le domaine. </p>

</dd>
</dl>
<a name="gkokp"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-connectorresourcenew.html">Cr&#233;er une ressource de connecteur</a></p>

</li>
<li><p><a href="task-connectorresourceedit.html">Modifier une ressource du connecteur</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Pour supprimer une ressource de connecteur</a></p>

</li></ul>
<a name="gkooc"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-resource-1"><tt>create-connector-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-resources-1"><tt>list-connector-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-resource-1"><tt>delete-connector-resource</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
