<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-connectorsecuritymaps"></a><h4>Mappages de s&#233;curit&#233; des pools de connexions du connecteur</h4>
<a name="indexterm-46"></a><a name="indexterm-47"></a><p>Utilisez la page Mappages de s&#233;curit&#233; du pool de connexions du connecteur
pour g&#233;rer les mappages de s&#233;curit&#233; des pools de connexions du connecteur.</p>

<p>Les mappages de s&#233;curit&#233; des pools de connexions de connecteur permettent la
cr&#233;ation d&#8217;un Mappage entre les utilisateurs et groupes de Java EE et
ceux d&#8217;EIS. Un mappage de s&#233;curit&#233; associe le principal re&#231;u durant l&#8217;authentification
EJB ou du servlet &#224; l&#8217;aide des informations d&#8217;authentification accept&#233;es par le
syst&#232;me EIS. Il est possible d&#8217;associer plusieurs principals GlassFish Server au m&#234;me principal
back-end. </p>

<p>Un mappage de s&#233;curit&#233; pour un pool de connexions est diff&#233;rent d&#8217;un
mappage de s&#233;curit&#233; de travail d&#8217;un connecteur, qui fait correspondre un principal
associ&#233; &#224; une instance de travail entrante &#224; un principal dans un
domaine de s&#233;curit&#233; du domaine GlassFish Server.  Consultez <a href="ref-worksecuritymaps.html">Mappages de s&#233;curit&#233; de travail</a> pour plus
d&#8217;informations sur les mappages de s&#233;curit&#233; de travail du connecteur.</p>

<p>Pour chaque mappage de s&#233;curit&#233;, les informations suivantes sont fournies.</p>

<dl><dt>Nom</dt>
<dd><p>Le nom du mappage de s&#233;curit&#233;. </p>

</dd>
</dl>
<p>Le tableau Mappages de s&#233;curit&#233; contient &#233;galement les options suivantes. </p>

<dl><dt>Nouveau</dt>
<dd><p>Bouton pour cr&#233;er un nouveau mappage de s&#233;curit&#233;.</p>

</dd>
<dt>Supprimer</dt>
<dd><p>Bouton pour supprimer un ou plusieurs mappages de s&#233;curit&#233; s&#233;lectionn&#233;s. </p>

</dd>
</dl>
<a name="gkolo"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-connectorconnectionpoolnew.html">Cr&#233;er un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Modifier un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Pour modifier un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Supprimer un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Supprimer un pool de connexions du connecteur</a></p>

</li></ul>
<a name="gkolh"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-connector-security-map-1"><tt>create-connector-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-connector-security-maps-1"><tt>list-connector-security-maps</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-connector-security-map-1"><tt>delete-connector-security-map</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-connector-security-map-1"><tt>update-connector-security-map</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
