<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-resourceadapterconfigedit"></a><h4>Modifier une configuration de l&#8217;adaptateur de ressources</h4><a name="indexterm-32"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le noeud Ressources, s&#233;lectionnez le noeud Configurations d&#8217;adaptateurs de ressources. </b><p>La page Configurations d&#8217;adaptateurs de ressources s&#8217;ouvre. </p></li>
<li><b>Sur la page Configurations d&#8217;adaptateurs de ressources, cliquez sur le nom de
la configuration de l&#8217;adaptateur de ressources que vous modifiez. </b><p>La page Modifier la configuration de l&#8217;adaptateur de ressources s&#8217;ouvre. </p></li>
<li><b>Dans la liste d&#233;roulante ID du pool de threads, s&#233;lectionnez le pool
de threads &#224; utiliser pour la configuration de l&#8217;adaptateur de ressources. </b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s pour l&#8217;adaptateur de
ressources.</b><p>Les propri&#233;t&#233;s disponibles sont les noms des m&#233;thodes de mutateur de la
classe r&#233;f&#233;renc&#233;e par l&#8217;&#233;l&#233;ment <tt>resourceadapter-class</tt> dans le fichier <tt>ra.xml</tt>, qui d&#233;finit le
nom de la classe du composant JavaBeans de l&#8217;adaptateur de ressources. Toutes
les modifications apport&#233;es aux propri&#233;t&#233;s d&#233;finies ici remplacent les valeurs par d&#233;faut
pr&#233;sentes dans le fichier <tt>ra.xml</tt>. </p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez, puis cliquez sur le bouton
Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-resourceadapterconfignew.html">Cr&#233;er une configuration de l'adaptateur de ressources</a></p>

</li>
<li><p><a href="task-resourceadapterconfigdelete.html">Supprimer une configuration de l'adaptateur de ressources</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
