<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectionservice"></a><h4>Configurer le service du connecteur</h4><a name="indexterm-34"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Service du connecteur.</b><p>La page Service du connecteur s&#8217;ouvre.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;arr&#234;t, saisissez le nombre maximum de secondes autoris&#233;
pendant l&#8217;arr&#234;t de GlassFish Server pour que la m&#233;thode <tt>ResourceAdapter.stop</tt> d&#8217;une instance
du module de connecteur se termine.</b><p>Les adaptateurs de ressources d&#233;passant ce d&#233;lai pour s&#8217;arr&#234;ter sont ignor&#233;s et l&#8217;arr&#234;t
de GlassFish Server se poursuit. La valeur par d&#233;faut est 30 secondes.</p></li>
<li><b>Dans la liste d&#233;roulante Strat&#233;gie de chargement de classe de connecteur, s&#233;lectionnez
la strat&#233;gie &#224; utiliser. </b><ul>
<li><b>S&#233;lectionnez <tt>derived</tt> pour indiquer que les adaptateurs de ressources sont fournis selon les
r&#233;f&#233;rences d&#8217;une application vers l&#8217;une des ressources de l&#8217;adaptateur de ressources. </b><p>Cette strat&#233;gie est la strat&#233;gie par d&#233;faut.</p></li>
<li><b>S&#233;lectionnez <tt>global</tt> pour indiquer que tous les adaptateurs de ressources seront visibles de
toutes les applications. </b></li></ul><p>Cette strat&#233;gie ne s&#8217;applique pas &#224; l&#8217;adaptateur de ressources du syst&#232;me JMS
pr&#233;install&#233;, <tt>jmsra</tt>, qui est toujours visible de toutes les applications. </p></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="../../../common/fr/help/task-appdeployconn.html">D&#233;ployer un module connecteur</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
