<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectorsecuritymapnew"></a><h4>Cr&#233;er un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</h4><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><a name="indexterm-12"></a><p>Les mappages de s&#233;curit&#233; des pools de connexions de connecteur permettent la
cr&#233;ation d&#8217;un Mappage entre les utilisateurs et groupes de Java EE et
ceux d&#8217;EIS. </p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>D&#233;veloppez le n&#339;ud Connecteurs.</b></li>
<li><b>Sous le n&#339;ud Connecteurs, s&#233;lectionnez le n&#339;ud Pools de connexions du connecteur.</b><p>La page Pools de connexions du connecteur s&#8217;ouvre.</p></li>
<li><b>Sur la page Pools de connexions de connecteurs, cliquez sur le nom
du pool de connexions que vous modifiez.</b><p>La page Modification du pool de connexions du connecteur s&#8217;ouvre.</p></li>
<li><b>Sur la page Modification du pool de connexions du connecteur, cliquez sur
l&#8217;onglet Mappages de s&#233;curit&#233;.</b><p>La page Mappages de s&#233;curit&#233; du pool de connexions du connecteur s'ouvre.
</p></li>
<li><b>Sur la page Mappages de s&#233;curit&#233; du pool de connexions du connecteur,
cliquez sur Nouveau. </b><p>La page Cr&#233;er un mappage de s&#233;curit&#233; pour le pool de connexions
du connecteur s'ouvre.</p></li>
<li><b>Dans le champ Nom de la carte de s&#233;curit&#233;, entrez un nom
pour le mappage de s&#233;curit&#233;. </b></li>
<li><b>Effectuez l&#8217;une des op&#233;rations suivantes, mais pas les deux : </b><ul>
<li><b>S&#233;lectionnez le bouton radio Groupes d&#8217;utilisateurs et tapez le nom des groupes d&#8217;utilisateurs,
s&#233;par&#233;es par des virgules. </b></li>
<li><b>S&#233;lectionnez le bouton radio Principals et entrez les noms des principals, s&#233;par&#233;s par
des virgules. </b></li></ul></li>
<li><b>Dans le champ Nom d&#8217;utilisateur, sp&#233;cifiez le nom d&#8217;utilisateur du principal back-end
requis par le syst&#232;me SIE. </b></li>
<li><b>Dans le champ Mot de passe, sp&#233;cifiez le mot de passe du
principal back-end requis par le syst&#232;me SIE. </b></li>
<li><b>Cliquez sur OK.</b></li>
<li><b>Red&#233;marrez GlassFish Server.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-connectorresourcenew.html">Cr&#233;er une ressource de connecteur</a></p>

</li>
<li><p><a href="task-connectorresourceedit.html">Modifier une ressource du connecteur</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Pour supprimer une ressource de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolnew.html">Cr&#233;er un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Modifier un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Pour modifier un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Supprimer un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Supprimer un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Configurer l'acc&#232;s &#224; EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Cr&#233;er une ressource d'objet g&#233;r&#233;</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Modifier une ressource d'objet administr&#233;</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Supprimer une ressource d'objet g&#233;r&#233;</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; de travail</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Modifier un mappage de s&#233;curit&#233; de travail</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Supprimer un mappage de s&#233;curit&#233; de travail</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
