<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-connectorresourceedit"></a><h3>Modifier une ressource du connecteur</h3><a name="indexterm-2"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>D&#233;veloppez le n&#339;ud Connecteurs.</b></li>
<li><b>Sous le n&#339;ud Connecteurs, s&#233;lectionnez le n&#339;ud Ressources du connecteur.</b><p>La page Ressources du connecteur s&#8217;ouvre.</p></li>
<li><b>Sur la page Ressources du connecteur, cliquez sur le nom de la
ressource que vous modifiez.</b><p>La page Modification d&#8217;une ressource de connecteur s&#8217;ouvre.</p></li>
<li><b>Dans la liste d&#233;roulante Nom du pool, s&#233;lectionnez le pool de connexions
de connecteur auquel la ressource du connecteur appartient. </b></li>
<li><b>Dans le champ Description, saisissez une description de la ressource de connecteur.</b></li>
<li><b>Dans l'onglet Cible, s&#233;lectionnez les cibles souhait&#233;es et cliquez sur Activer ou
D&#233;sactiver. </b><p>Pour ajouter ou supprimer des cibles de la liste, cliquez sur Gestion
des cibles. </p><p>Retournez &#224; la page Modification d'une ressource de connecteur en cliquant sur
l'onglet G&#233;n&#233;ral. </p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Statut pour activer la ressource de connecteur
lors de l&#8217;ex&#233;cution.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez des propri&#233;t&#233;s suppl&#233;mentaires pour la ressource
du connecteur.</b><p>Les propri&#233;t&#233;s disponibles d&#233;pendent de l&#8217;adaptateur de ressources pour le pool de
connexions du connecteur.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez, puis cliquez sur le bouton
Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-connectorresourcenew.html">Cr&#233;er une ressource de connecteur</a></p>

</li>
<li><p><a href="task-connectorresourcesdelete.html">Pour supprimer une ressource de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolnew.html">Cr&#233;er un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooledit.html">Modifier un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions de connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapedit.html">Pour modifier un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorsecuritymapdel.html">Supprimer un mappage de s&#233;curit&#233; pour un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-connectorconnectionpooldel.html">Supprimer un pool de connexions du connecteur</a></p>

</li>
<li><p><a href="task-setupeisaccess.html">Configurer l'acc&#232;s &#224; EIS</a></p>

</li>
<li><p><a href="task-adminobjectnew.html">Cr&#233;er une ressource d'objet g&#233;r&#233;</a></p>

</li>
<li><p><a href="task-adminobjectedit.html">Modifier une ressource d'objet administr&#233;</a></p>

</li>
<li><p><a href="task-administeredobjectresourcedelete.html">Supprimer une ressource d'objet g&#233;r&#233;</a></p>

</li>
<li><p><a href="task-worksecuritymapnew.html">Cr&#233;er un mappage de s&#233;curit&#233; de travail</a></p>

</li>
<li><p><a href="task-worksecuritymapedit.html">Modifier un mappage de s&#233;curit&#233; de travail</a></p>

</li>
<li><p><a href="task-worksecuritymapdelete.html">Supprimer un mappage de s&#233;curit&#233; de travail</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
