<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbcontaineravailability"></a><h4>Disponibilit&#233; du conteneur EJB</h4>
<a name="indexterm-13"></a><a name="indexterm-14"></a><p>La page Disponibilit&#233; du conteneur EJB vous permet de configurer les param&#232;tres
de disponibilit&#233; du conteneur EJB. </p>

<p>Elle contient les options suivantes.</p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton permettant de restaurer les valeurs par d&#233;faut de tous les param&#232;tres.</p>

</dd>
<dt>Nom de configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Service de disponibilit&#233;</dt>
<dd><p>Si la case Activ&#233; est coch&#233;e, la disponibilit&#233; est activ&#233;e pour le conteneur EJB.</p>

</dd>
<dt>Type de persistance HA</dt>
<dd><p>M&#233;canisme de persistance utilis&#233; lorsque le service de disponibilit&#233; est activ&#233;. La valeur par d&#233;faut est <tt>replicated</tt>, qui fournit la persistance bas&#233;e sur le basculement dans un cluster. Ne modifiez pas cette valeur. </p>

</dd>
<dt>Type de persistance SFSB</dt>
<dd><p>M&#233;canisme de persistance utilis&#233; lorsque le service de disponibilit&#233; n'est <b>pas</b> activ&#233;. La valeur par d&#233;faut est <tt>file</tt>, qui fournit la persistance en fonction du syst&#232;me de fichiers. Ne modifiez pas cette valeur. </p>

<p>Le champ Emplacement de stockage des sessions d&#233;termine o&#249; les &#233;tats de point de contr&#244;le SFSB sont maintenus. Pour d&#233;finir l'emplacement de stockage des sessions, voir <a href="../../../ejb-lite/fr/help/task-ejbgeneral.html">To Configure EJB Settings</a>.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Propri&#233;t&#233;s suppl&#233;mentaires de la disponibilit&#233; du conteneur EJB. </p>

<p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; de disponibilit&#233; du conteneur EJB.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-ejbcontaineravailability.html">Pour configurer les param&#232;tres de disponibilit&#233; du conteneur EJB</a></p>

</li>
<li><p><a href="../../../ejb-lite/fr/help/task-ejbgeneral.html">To Configure EJB Settings</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
