<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbmdbpoolsettings"></a><h4>Param&#232;tres de pool MDB par d&#233;faut</h4>
<a name="indexterm-15"></a><a name="indexterm-16"></a><a name="indexterm-17"></a><p>Utilisez la page Param&#232;tres de pool MDB par d&#233;faut pour configurer le
pool.</p>

<p>La page Param&#232;tres de pool MDB par d&#233;faut contient les options suivantes.</p>

<dl><dt>Charger les valeurs par d&#233;faut</dt>
<dd><p>Bouton permettant de restaurer les valeurs par d&#233;faut de tous les param&#232;tres.</p>

</dd>
<dt>Nom de configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Taille initiale et minimale du pool</dt>
<dd><p>Nombre minimum de beans de message &#224; conserver dans le pool. La valeur par d&#233;faut est 0.</p>

</dd>
<dt>Taille maximale du pool</dt>
<dd><p>Nombre maximal de beans pouvant &#234;tre conserv&#233;s par le conteneur dans le pool &#224; un moment donn&#233;. La valeur par d&#233;faut est 32.</p>

</dd>
<dt>Valeur de redimensionnement du pool</dt>
<dd><p>Nombre de beans supprim&#233;s du pool s&#8217;ils sont inactifs pass&#233;e la dur&#233;e sp&#233;cifi&#233;e dans le champ D&#233;lai d&#8217;inactivit&#233; du pool. La valeur doit &#234;tre 0 minimum et &#234;tre inf&#233;rieure &#224; la valeur du champ Taille maximale du pool. La valeur par d&#233;faut est 8.</p>

</dd>
<dt>D&#233;lai d&#8217;inactivit&#233; du pool</dt>
<dd><p>Dur&#233;e exprim&#233;e en secondes pendant laquelle un bean du pool peut rester inactif avant d&#8217;&#234;tre supprim&#233; de celui-ci. Au-del&#224; de cette p&#233;riode, le bean est d&#233;truit. La valeur 0 signifie qu&#8217;un bean peut rester inactif pendant une dur&#233;e ind&#233;finie. La valeur par d&#233;faut est 600.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s du pool MDB. GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour le pool MDB.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-ejbmdbpoolsettings.html">Pour configurer les param&#232;tres du pool MDB</a></p>

</li>
<li><p><a href="../../../ejb-lite/fr/help/task-ejbgeneral.html">To Configure EJB Settings</a></p>

</li>
<li><p><a href="task-ejbtimerservice.html">Pour configurer le service d'horloge EJB</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
