<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-ejbcontaineravailability"></a><h3>Pour configurer les param&#232;tres de disponibilit&#233; du conteneur EJB</h3><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><a name="indexterm-12"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez la configuration que vous &#234;tes en train de modifier. </b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Service de disponibilit&#233;.</b><p>La page Service de disponibilit&#233; s'ouvre.</p></li>
<li><b>Sur la page Service de disponibilit&#233;, cliquez sur l'onglet Disponibilit&#233; du conteneur
EJB. </b><p>La page correspondante s'ouvre. </p></li>
<li><b>Cochez la case Activ&#233; pour activer la disponibilit&#233; du conteneur EJB. </b><p>Pour d&#233;sactiver la disponibilit&#233;, d&#233;cochez la case Service de disponibilit&#233; activ&#233;.</p></li>
<li><b>Le type de persistance HA est <tt>replicated</tt>.</b><p>Ce m&#233;canisme de persistance est utilis&#233; lorsque le service de disponibilit&#233; est
activ&#233;. La persistance est bas&#233;e sur le basculement sur un cluster. Ne
modifiez pas cette valeur. </p></li>
<li><b>Le type de persistance SFSB est <tt>file</tt>.</b><p>Ce m&#233;canisme de persistance est utilis&#233; lorsque le service de disponibilit&#233; n'est
<b>pas</b> activ&#233;. La persistance est bas&#233;e sur le syst&#232;me de fichiers. Ne
modifiez pas cette valeur. </p><p>Le champ Emplacement de stockage des sessions d&#233;termine o&#249; les &#233;tats de
point de contr&#244;le SFSB sont maintenus. Pour d&#233;finir l'emplacement de stockage des
sessions, voir <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2964&id=task-ejbgeneral">To Configure EJB Settings</a>.</p></li>
<li><b>Pour restaurer les valeurs par d&#233;faut, cliquez sur le bouton Charger les
valeurs par d&#233;faut.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour la disponibilit&#233; du conteneur
EJB.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2964&id=task-ejbgeneral">To Configure EJB Settings</a></p>

</li>
<li><p><a href="task-ejbmdbpoolsettings.html">Pour configurer les param&#232;tres du pool MDB</a></p>

</li>
<li><p><a href="task-ejbtimerservice.html">Pour configurer le service d'horloge EJB</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
