<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcconnectionpoolnew"></a><h4>Para crear un conjunto de conexiones JDBC</h4><a name="indexterm-7"></a><a name="indexterm-8"></a><a name="indexterm-9"></a><p>Cuando se crea un conjunto de conexiones con Consola de administraci&#243;n, est&#225;
definiendo los aspectos de una conexi&#243;n con una base de datos espec&#237;fica.</p>

<h6>Antes de empezar</h6><p>Para crear un conjunto de conexiones, en primer lugar, debe instalar e
integrar un controlador compatible con la API JDBC (controlador JDBC). Consulte <a href="task-integratejdbcdriver.html">Para integrar un controlador JDBC</a>.</p>

<p>La siguiente informaci&#243;n es necesaria a la hora de crear el conjunto
de conexiones JDBC. Recopile esta informaci&#243;n antes de continuar:</p>


<ul><li><p>Nombre de proveedor de la base de datos</p>

</li>
<li><p>Tipos de recursos, como <tt>javax.sql.DataSource</tt> (s&#243;lo transacciones locales), <tt>java.sql.ConnectionPoolDataSource</tt> (transacciones locales, posibles mejoras de rendimiento), <tt>javax.sql.XADataSource </tt> (transacciones globales) y <tt>java.sql.Driver</tt></p>

</li>
<li><p>Nombre de clase de origen de datos</p>

</li>
<li><p>Propiedades obligatorias, como el nombre de la base de datos (URL), nombre de usuario y la contrase&#241;a.</p>

</li></ul>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Tareas comunes.</b><p>Se abrir&#225; la p&#225;gina Tareas comunes.</p></li>
<li><b>En la p&#225;gina Tareas comunes, haga clic en el bot&#243;n Crear nuevo
conjunto de conexiones JDBC.</b><p>Se abrir&#225; la p&#225;gina Nuevo conjunto de conexiones JDBC (paso 1 de
2).</p>
<hr><p><b>Nota - </b>Tambi&#233;n puede acceder a la p&#225;gina Nuevo conjunto de conexiones JDBC si
expande los nodos Recursos y JDBC, y despu&#233;s selecciona el nodo Conjuntos
de conexiones. A continuaci&#243;n, en la p&#225;gina Conjuntos de conexiones, haga clic
en Nuevo para crear un conjunto de conexiones.</p>


<hr>
</li>
<li><b>En el campo Nombre de conjunto, asigne un nombre al nuevo conjunto
de conexiones.</b><p>Se trata de un campo obligatorio.</p></li>
<li><b>En la lista desplegable Tipo de recurso, seleccione un tipo de recurso.</b><p>Entre las opciones se incluyen <tt>javax.sql.XADataSource</tt> (transacciones globales), <tt>java.sql.ConnectionPoolDataSource</tt> (transacciones locales, posibles
mejoras del rendimiento), <tt>javax.sql.DataSource </tt> (s&#243;lo transacciones locales) y <tt>java.sql.Driver</tt>.</p></li>
<li><b>Especifique un proveedor de bases de datos mediante una de las siguientes
acciones:</b><ul>
<li><b>En la lista desplegable Proveedor de bases de datos, seleccione un proveedor
de bases de datos.</b></li>
<li><b>Si el proveedor de bases de datos no aparece en la lista,
escriba el nombre del proveedor en el campo de texto Proveedor de
la base de datos.</b></li></ul></li>
<li><b>Haga clic en Siguiente.</b><p>Se abrir&#225; la p&#225;gina Nuevo conjunto de conexiones JDBC (paso 2 de
2).</p></li>
<li><b>En el campo Nombre de clase de fuente de datos, introduzca el
nombre de la clase espec&#237;fica del proveedor que implementa las API <tt>DataSource</tt>,
<tt>ConnectionPoolDataSource</tt> o <tt>XADataSource </tt>.</b><p>Si seleccion&#243; uno de los tipos de recursos de fuente de datos
("datasource"), este campo se suele rellenar autom&#225;ticamente con el nombre de clase asociado
al tipo de recurso y al proveedor de bases de datos que
hubiera seleccionado. Si seleccion&#243; el tipo de recurso <tt>java.sql.Driver</tt>, este campo est&#225;
desactivado.</p></li>
<li><b>En el campo Nombre de clase del controlador, escriba la clase espec&#237;fica
del proveedor que implementa la API <tt>java.sql.Driver</tt>.</b><p>Si seleccion&#243; el tipo de de recurso   <tt>java.sql.Driver</tt>, este campo se
suele  rellenar autom&#225;ticamente con el nombre de clase asociada al controlador y
al proveedor de bases de datos que hubiera elegido. Si seleccion&#243; uno de
los tipos de recursos de fuente de datos ("datasource"), este campo est&#225;
desactivado.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Ping habilitado para hacer ping autom&#225;ticamente en
el conjunto de conexiones durante la creaci&#243;n o reconfiguraci&#243;n del conjunto para identificar
y avisarle de cualquier valor de atributo incorrecto.</b><p>Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>En el campo Descripci&#243;n, introduzca una breve descripci&#243;n del conjunto de conexiones.</b></li>
<li><b>En el campo Tama&#241;o de conjunto inicial y m&#237;nimo, introduzca el n&#250;mero
m&#237;nimo de conexiones de este conjunto.</b><p>Este valor tambi&#233;n determina el n&#250;mero de conexiones incluidas en el conjunto
cuando se crea el conjunto por primera vez o cuando se inicia
GlassFish Server. El valor predeterminado es 8.</p></li>
<li><b>En el campo Tama&#241;o de conjunto m&#225;ximo, introduzca el n&#250;mero m&#225;ximo de
conexiones de este conjunto.</b><p>El valor predeterminado es 32.</p></li>
<li><b>En el campo Cantidad de cambio de tama&#241;o de conjunto, introduzca el
n&#250;mero de conexiones por lote de cambio de tama&#241;o de conjunto.</b><p>Cuando el conjunto aumenta y disminuye hacia el tama&#241;o m&#225;ximo y m&#237;nimo
respectivamente, se cambia el tama&#241;o en lotes. Este valor determina el n&#250;mero
de conexiones en el lote. Si este valor es demasiado grande, se
retrasar&#225; la creaci&#243;n y el reciclado de las conexiones y, si es
demasiado peque&#241;o, el proceso perder&#225; eficacia. El valor predeterminado es 2.</p></li>
<li><b>En el campo Tiempo de espera de inactividad, introduzca el tiempo m&#225;ximo,
en segundos, que una conexi&#243;n puede permanecer inactiva en el conjunto.</b><p>Una vez vencido el tiempo, se elimina la conexi&#243;n del conjunto. El
valor predeterminado es 300.</p></li>
<li><b>En el campo Tiempo de espera m&#225;ximo, introduzca el tiempo m&#225;ximo, en
mil&#233;simas de segundo, que la aplicaci&#243;n que solicita una conexi&#243;n esperar&#225; antes
de que se agote el tiempo de espera de la conexi&#243;n.</b><p>El valor predeterminado es 60.000.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Conexiones no transaccionales habilitadas para devolver conexiones
que no sean de transacci&#243;n.</b><p>Esta opci&#243;n se deshabilita por defecto.</p></li>
<li><b>En la lista desplegable Nivel de aislamiento de transacci&#243;n, seleccione un nivel
de aislamiento de transacci&#243;n para este conjunto de conexiones.</b><p>Si no se especifica nada, las conexiones funcionan con los niveles de
aislamiento predeterminados que proporciona el controlador JDBC. Por defecto, no se especifica
esta opci&#243;n.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Nivel garantizado para asegurarse de que todas
las conexiones tomadas del conjunto tengan el mismo nivel de aislamiento.</b><p>Por ejemplo, si el nivel de aislamiento para la conexi&#243;n se cambia
de forma programada (con <tt>con.setTransactionIsolation </tt>) cuando se utiliza por &#250;ltima vez, este
mecanismo devuelve el estado al nivel de aislamiento especificado. Esta opci&#243;n se
habilita por defecto.</p><p>Esta configuraci&#243;n s&#243;lo es aplicable si se ha especificado un nivel de
aislamiento de transacci&#243;n.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Entre los ejemplos de propiedades necesarias, se incluyen el nombre de la
base de datos (URL), el nombre de usuario y la contrase&#241;a. La tabla
suele contener las propiedades utilizadas por el proveedor de la base de
datos. Para obtener informaci&#243;n sobre algunas de las propiedades disponibles, consulte <a href="ref-jdbc-properties.html">Propiedades espec&#237;ficas de los conjuntos de conexiones JDBC</a>.</p><p>Si no especifica un valor para una propiedad, &#233;ste se eliminar&#225; de
la tabla cuando acabe de crear el conjunto de conexiones. Si no desea definir
un valor para una propiedad ahora, pero desea que la propiedad permanezca
en la tabla para que el valor se pueda definir m&#225;s adelante,
escriba un conjunto de par&#233;ntesis vac&#237;o en el campo Valor: </p><pre>()</pre><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite su campo Valor.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Finalizar (Finish).</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-setdbaccess.html">Para configurar el acceso a la base de datos</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar un controlador JDBC</a>.</p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Para editar un recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Para eliminar un recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&#243;n general del conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&#243;n del conjunto de conexiones</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Para editar las propiedades del conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para eliminar un conjunto de conexiones JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
