<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcresourcesedit"></a><h4>Para editar un recurso JDBC</h4><a name="indexterm-5"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Recursos.</b></li>
<li><b>Bajo el nodo Recursos, ampl&#237;e el nodo JDBC.</b></li>
<li><b>En el nodo JDBC, seleccione el nodo Recursos JDBC.</b><p>Se abre la p&#225;gina Recursos de JDBC.</p></li>
<li><b>En la p&#225;gina Recursos JDBC, haga clic en el nombre del recurso
que desee editar.</b><p>Se abrir&#225; la p&#225;gina Editar recurso JDBC.</p></li>
<li><b>En la lista desplegable Nombre de conjunto, seleccione un conjunto de conexiones
para asociarlo al recurso JDBC.</b></li>
<li><b>En el campo Descripci&#243;n, introduzca una breve descripci&#243;n del recurso JDBC.</b></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>GlassFish Server no define ninguna propiedad adicional para recursos JDBC.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n A&#241;adir propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite su campo Valor.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en la ficha Destino para administrar los destinos de recurso.</b><ol style="list-style-type: lower-alpha">
<li><b>Habilite o deshabilite los destinos definidos para el recurso, seg&#250;n desee.</b></li>
<li><b>Haga clic en el bot&#243;n Administrar destinos para agregar o quitar destinos
para el recurso.</b></li></ol><p>Consulte <a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a> para obtener m&#225;s informaci&#243;n.</p></li>
<li><b>Haga clic en la ficha General para volver a la p&#225;gina Editar
recurso JDBC.</b></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-setdbaccess.html">Para configurar el acceso a la base de datos</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar un controlador JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Para eliminar un recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para crear un conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&#243;n general del conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&#243;n del conjunto de conexiones</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Para editar las propiedades del conjunto de conexiones JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para eliminar un conjunto de conexiones JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
