<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a><a id="GHJDB00037" name="GHJDB00037"></a></p>

<h4><a id="sthref17" name="sthref17"></a>Editar Configuraci&oacute;n General de los Pools de Conexiones JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>Bajo el nodo Recursos, ampl&iacute;e el nodo JDBC.</p>
</li>
<li>
<p>En el nodo JDBC, seleccione el nodo Conjuntos de conexiones.</p>
<p>Se abrir&aacute; la p&aacute;gina Conjuntos de conexiones.</p>
</li>
<li>
<p>Haga clic en el nombre del conjunto de conexiones que desea verificar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar conjunto de conexiones.</p>
</li>
<li>
<p>En la lista desplegable Tipo de recurso, seleccione un tipo de recurso.</p>
<p>Las opciones incluyen <code>javax.sql.DataSource</code> (s&oacute;lo transacciones locales), <code>javax.sql.XADataSource</code> (transacciones globales) y <code>java.sql.ConnectionPoolDataSource</code> (transacciones locales, posibles mejoras de rendimiento).</p>
</li>
<li>
<p>En el campo Nombre de Clase de Origen de Datos, introduzca el nombre de la clase espec&iacute;fica del proveedor que implanta las API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> o <code>XADataSource</code> .</p>
<p>Si seleccion&oacute; uno de los tipos de recursos de fuente de datos ("datasource"), este campo se suele rellenar autom&aacute;ticamente con el nombre de clase asociado al tipo de recurso y al proveedor de bases de datos que hubiera seleccionado. Si seleccion&oacute; el tipo de recurso <code>java.sql.Driver</code> , este campo est&aacute; desactivado.</p>
</li>
<li>
<p>En el campo Nombre de clase del controlador, escriba la clase espec&iacute;fica del proveedor que implementa la API <code>java.sql.Driver</code>.</p>
<p>Si seleccion&oacute; el tipo de de recurso <code>java.sql.Driver</code>, este campo se suele rellenar autom&aacute;ticamente con el nombre de clase asociada al controlador y al proveedor de bases de datos que hubiera elegido. Si seleccion&oacute; uno de los tipos de recursos de fuente de datos ("datasource"), este campo est&aacute; desactivado.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Ping habilitado para hacer ping autom&aacute;ticamente en el conjunto de conexiones durante la creaci&oacute;n o reconfiguraci&oacute;n del conjunto para identificar y avisarle de cualquier valor de atributo incorrecto.</p>
<p>Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del conjunto de conexiones.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de conjunto inicial y m&iacute;nimo, introduzca el n&uacute;mero m&iacute;nimo de conexiones de este conjunto.</p>
<p>Este valor tambi&eacute;n determina el n&uacute;mero de conexiones incluidas en el conjunto cuando se crea el conjunto por primera vez o cuando se inicia GlassFish Server. El valor predeterminado es 8.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de conjunto m&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de conexiones de este conjunto.</p>
<p>El valor predeterminado es 32.</p>
</li>
<li>
<p>En el campo Cantidad de cambio de tama&ntilde;o de conjunto, introduzca el n&uacute;mero de conexiones por lote de cambio de tama&ntilde;o de conjunto.</p>
<p>Cuando el conjunto aumenta y disminuye hacia el tama&ntilde;o m&aacute;ximo y m&iacute;nimo respectivamente, se cambia el tama&ntilde;o en lotes. Este valor determina el n&uacute;mero de conexiones en el lote. Si este valor es demasiado grande, se retrasar&aacute; la creaci&oacute;n y el reciclado de las conexiones y, si es demasiado peque&ntilde;o, el proceso perder&aacute; eficacia. El valor predeterminado es 2.</p>
</li>
<li>
<p>En el campo Tiempo de espera de inactividad, introduzca el tiempo m&aacute;ximo, en segundos, que una conexi&oacute;n puede permanecer inactiva en el conjunto.</p>
<p>Una vez vencido el tiempo, se elimina la conexi&oacute;n del conjunto. El valor predeterminado es 300.</p>
</li>
<li>
<p>En el campo Tiempo de espera m&aacute;ximo, introduzca el tiempo m&aacute;ximo, en mil&eacute;simas de segundo, que la aplicaci&oacute;n que solicita una conexi&oacute;n esperar&aacute; antes de que se agote el tiempo de espera de la conexi&oacute;n.</p>
<p>El valor predeterminado es 60.000.</p>
</li>
<li>
<p>Marque la casilla de verificaci&oacute;n Conexiones no transaccionales habilitadas para devolver conexiones que no sean de transacci&oacute;n.</p>
<p>Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>Seleccione el nivel de aislamiento de transacci&oacute;n del conjunto de conexiones en la lista desplegable.</p>
<p>Si no se especifica nada, las conexiones funcionan con los niveles de aislamiento predeterminados que proporciona el controlador JDBC. Por defecto, no se especifica esta opci&oacute;n.</p>
</li>
<li>
<p>Marque la casilla de verificaci&oacute;n Nivel garantizado si quiere que todas las conexiones tomadas del conjunto tengan el mismo nivel de aislamiento.</p>
<p>Por ejemplo, si el nivel de aislamiento para la conexi&oacute;n se cambia de forma programada (con <code>con.setTransactionIsolation</code> ) cuando se utiliza por &uacute;ltima vez, este mecanismo devuelve el estado al nivel de aislamiento especificado.</p>
<p>Esta configuraci&oacute;n s&oacute;lo es aplicable si se ha especificado un nivel de aislamiento de transacci&oacute;n.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n Ping para verificar la conexi&oacute;n de la base de datos.</p>
<p>La Consola de Administraci&oacute;n intenta la conexi&oacute;n a la base de datos. Si aparece un mensaje de error, compruebe si el servidor de la base de datos se ha reiniciado.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n Vaciar para restablecer la agrupaci&oacute;n de conexiones a su estado inicial.</p>
<p>Las conexiones existentes se destruyen, lo que significa que las transacciones asociadas con estas conexiones se perder&aacute;n. A continuaci&oacute;n, el subcomando vuelve a crear las conexiones iniciales del conjunto y lo restaura a su tama&ntilde;o de conjunto estable.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configurar el Acceso a la Base de Datos</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Integrar un Controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Crear un Recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Editar un Recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Suprimir un Recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Crear un Pool de Conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avanzados de Pools de Conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Verificar la Configuraci&oacute;n del Pool de Conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar las Propiedades de los Pools de Conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suprimir un Pool de Conexiones JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
