<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooladvance" name="task-jdbcconnectionpooladvance"></a><a id="GHJDB00038" name="GHJDB00038"></a></p>

<h4><a id="sthref19" name="sthref19"></a>Editar Atributos Avanzados de Pools de Conexiones JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, seleccione el nodo JDBC.</p>
</li>
<li>
<p>En el nodo JDBC, seleccione el nodo Conjuntos de conexiones.</p>
<p>Se abrir&aacute; la p&aacute;gina Conjuntos de conexiones.</p>
</li>
<li>
<p>En la p&aacute;gina Conjuntos de conexiones, haga clic en el nombre del conjunto que desea editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar conjunto de conexiones.</p>
</li>
<li>
<p>En la p&aacute;gina Editar conjunto de conexiones, haga clic en la ficha Avanzado.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar atributos avanzados del conjunto de conexiones.</p>
</li>
<li>
<p>En el campo Tiempo de espera de instrucci&oacute;n, introduzca el periodo de tiempo, en segundos, tras el que finalizar&aacute;n las consultas que duren demasiado.</p>
<p>GlassFish Server establecer&aacute; <code>QueryTimeout</code> en las instrucciones creadas. Establezca el valor en -1 para deshabilitar esta opci&oacute;n. El valor predeterminado es -1.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de la cach&eacute; de instrucci&oacute;n, escriba el n&uacute;mero de las instrucciones que almacenar en la memoria cach&eacute; utilizando el mecanismo LRU (Least Recently Used).</p>
<p>Para deshabilitar el almacenamiento de instrucciones en la memoria cach&eacute;, especifique un valor de 0. El valor predeterminado es 0.</p>
</li>
<li>
<p>En el campo Init SQL, escriba la cadena SQL que debe ejecutarse cada vez que se crea (no se reutiliza) una conexi&oacute;n en el grupo.</p>
<p>La ejecuci&oacute;n de esta cadena inicia el estado de la conexi&oacute;n.</p>
</li>
<li>
<p>En el campo Escuchas de rastreo SQL, escriba una lista separada por comas de los nombres de clases de implementaciones de escuchas para especificar que se realizar&aacute; un seguimiento de las instrucciones SQL ejecutadas por las aplicaciones.</p>
<p>Las clases de listener deben implantar la interfaz <code>org.glassfish.api.jdbc.SQLTraceListener</code>. El uso de listeners permite filtrar f&aacute;cilmente los mensajes de log de las sentencias SQL y ayuda a los administradores analizar las sentencias.</p>
</li>
<li>
<p>Active la casilla de control Ajustar Objetos JDBC Activado para que las aplicaciones obtengan objetos JDBC ajustados para <code>Statement</code>, <code>PreparedStatement</code> , <code>CallableStatement</code>, <code>ResultSet</code>, <code>DatabaseMetaData</code>.</p>
<p>Esta opci&oacute;n se habilita por defecto.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Agrupaci&oacute;n para habilitar la agrupaci&oacute;n de conexiones para el conjunto de conexiones.</p>
<p>Esta opci&oacute;n se habilita por defecto.</p>
</li>
<li>
<p>En el campo Validar al menos una vez, introduzca el tiempo, en segundos, tras el cual se valida una conexi&oacute;n al menos una vez.</p>
<p>Si se define este atributo con un valor apropiado se minimiza el n&uacute;mero de solicitudes de validaci&oacute;n por conexi&oacute;n. El valor predeterminado es 0, lo que significa que el atributo no est&aacute; habilitado.</p>
</li>
<li>
<p>En el campo Timeout de P&eacute;rdida de Conexi&oacute;n, introduzca el tiempo, en segundos, para realizar un rastreo de las p&eacute;rdidas de conexi&oacute;n de un pool de conexiones.</p>
<p>Use este campo para detectar fallos potenciales en la conexi&oacute;n por la aplicaci&oacute;n. En caso de que la aplicaci&oacute;n no devuelva la conexi&oacute;n al conjunto de conexiones dentro del per&iacute;odo especificado, se considerar&aacute; que existen fallos potenciales, y se registrar&aacute; un seguimiento de la pila del origen de la llamada. Establezca el valor en 0 para deshabilitar el seguimiento de las p&eacute;rdidas de conexi&oacute;n. El valor predeterminado es 0.</p>
<p>Utilice este campo junto con la reclamaci&oacute;n de p&eacute;rdidas de conexiones para evitar p&eacute;rdidas potenciales de conexi&oacute;n desde la aplicaci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Reclamaci&oacute;n de P&eacute;rdida de Conexi&oacute;n para restaurar las conexiones perdidas en el pool una vez haya finalizado el rastreo de conexiones de p&eacute;rdidas.</p>
<p>Esta opci&oacute;n est&aacute; desactivada por defecto.</p>
</li>
<li>
<p>En el campo Timeout de P&eacute;rdida de Sentencia, introduzca el tiempo, en segundos, para realizar un rastreo de las p&eacute;rdidas de sentencias de un pool de conexiones.</p>
<p>Use este campo para detectar p&eacute;rdidas potenciales de sentencias por parte de la aplicaci&oacute;n. En caso de que la aplicaci&oacute;n no devuelva una sentencia al pool dentro del per&iacute;odo especificado, se considerar&aacute; que existen p&eacute;rdidas potenciales, y se registrar&aacute; un rastreo de pila del origen de la llamada. Defina el valor en 0 para desactivar el rastreo de las p&eacute;rdidas de sentencias. El valor por defecto es 0.</p>
<p>Utilice este campo junto con la reclamaci&oacute;n de p&eacute;rdida de sentencia para evitar p&eacute;rdidas potenciales de sentencias desde la aplicaci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Reclamaci&oacute;n de P&eacute;rdida de Sentencia para restaurar las sentencias perdidas en el pool una vez haya finalizado el rastreo de sentencias de p&eacute;rdidas.</p>
<p>Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>En el campo Reintentos de creaci&oacute;n, introduzca el n&uacute;mero de intentos que se realizar&aacute;n si se produjera un error al crear una conexi&oacute;n nueva.</p>
<p>Establezca el valor en 0 para que no se intente crear de nuevo una conexi&oacute;n. El valor predeterminado es 0.</p>
</li>
<li>
<p>En el campo Intervalo de reintentos, introduzca el intervalo, en segundos, que hay entre dos intentos de creaci&oacute;n de una conexi&oacute;n.</p>
<p>El valor predeterminado es 10. Este atributo se utiliza s&oacute;lo si el valor de Intentos de creaci&oacute;n es mayor que 0.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Asociaci&oacute;n inactiva habilitada para asociar una conexi&oacute;n f&iacute;sica con una conexi&oacute;n l&oacute;gica s&oacute;lo cuando se use la conexi&oacute;n.</p>
<p>Las conexiones se desvinculan una vez completada la transacci&oacute;n y cuando el m&eacute;todo de componente finaliza, lo cual sirve para reutilizar las conexiones f&iacute;sicas. Si esta opci&oacute;n est&aacute; desactivada, una conexi&oacute;n f&iacute;sica se asocia con una conexi&oacute;n l&oacute;gica s&oacute;lo incluso antes de usar la conexi&oacute;n. Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Alistamiento de conexiones no activas habilitado para alistar un recurso a la transacci&oacute;n s&oacute;lo cuando realmente se est&eacute; utilizando por un m&eacute;todo.</p>
<p>Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Asociaci&oacute;n con subprocesos activada para crear asociaciones entre las conexiones y los subprocesos.</p>
<p>Cuando otra conexi&oacute;n necesita el mismo subproceso, puede volver a utilizar la conexi&oacute;n que ya est&aacute; asociada con ese subproceso, sin necesidad de incurrir en la sobrecarga de coger otra conexi&oacute;n del conjunto. Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n Correspondencia de conexiones activada para habilitar la correspondencia de conexiones para el conjunto.</p>
<p>Si esta opci&oacute;n est&aacute; habilitada, las conexiones que se seleccionen en el conjunto deber&iacute;an coincidir con las conexiones que tienen determinadas credenciales. Esta opci&oacute;n debe estar habilitada si el conjunto de conexiones lo utilizan aplicaciones que tienen varias credenciales de usuario. Esta opci&oacute;n se puede deshabilitar si el administrador sabe que las conexiones del conjunto siempre ser&aacute;n homog&eacute;neas y, por tanto, para una conexi&oacute;n recogida del conjunto no se necesita establecer correspondencia mediante el adaptador de recursos. Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>En el campo Uso m&aacute;x. de conexi&oacute;n, introduzca el n&uacute;mero de veces que el conjunto debe utilizar una conexi&oacute;n.</p>
<p>La conexi&oacute;n se cerrar&aacute; una vez reutilizada durante un n&uacute;mero espec&iacute;fico de veces. Al limitar el n&uacute;mero de veces que una conexi&oacute;n se puede reutilizar, puede evitar fallos potenciales en las instrucciones si una aplicaci&oacute;n no las cierra. Establezca el valor en 0 para deshabilitar este atributo. El valor predeterminado es 0.</p>
</li>
<li>
<p>Marque la casilla de verificaci&oacute;n Validaci&oacute;n de conexi&oacute;n necesaria para habilitar la validaci&oacute;n de la conexi&oacute;n.</p>
<p>La validaci&oacute;n de conexi&oacute;n permite al servidor volver a conectarse en caso de error.</p>
</li>
<li>
<p>En la lista desplegable M&eacute;todo de validaci&oacute;n, seleccione un m&eacute;todo de validaci&oacute;n.</p>
<p>GlassFish Server puede validar las conexiones de la base de datos de las siguientes maneras.</p>
<dl>
<dt><code>auto-commit</code> y <code>metadata</code></dt>
<dd>
<p>GlassFish Server valida una conexi&oacute;n llamando a los m&eacute;todos <code>con.getAutoCommit</code> y <code>con.getMetaData</code>.</p>

<hr>
<p><b>Nota:</b></p>
Muchos controladores JDBC guardan en la memoria cach&eacute; los resultados de estas llamadas. Como resultado, al utilizar estas llamadas es posible que no siempre se obtengan validaciones fiables. Compruebe con el proveedor del controlador para determinar si estas llamadas est&aacute;n guardadas en la memoria cach&eacute; o no.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server utiliza un mecanismo de validaci&oacute;n definido por el usuario especificado en la clase de implementaci&oacute;n personalizada, dentro del campo Nombre de clase de validaci&oacute;n.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>La aplicaci&oacute;n consulta la tabla de la base de datos especificada. La tabla debe existir y estar accesible, aunque no requiere ninguna fila. No utilice una tabla existente que tenga un gran n&uacute;mero de filas, o una tabla a la que ya se accede con frecuencia.</p>
</dd>
</dl>
</li>
<li>
<p>Si seleccion&oacute; <code>table</code> en la lista desplegable M&eacute;todo de Validaci&oacute;n, escriba el nombre de la tabla de base de datos en la lista desplegable Nombre de Tabla.</p>
</li>
<li>
<p>Si ha seleccionado <code>custom-validation</code> en la lista desplegable M&eacute;todo de Validaci&oacute;n, escriba el nombre de clase de la implantaci&oacute;n de validaci&oacute;n personalizada o selecci&oacute;nelo en la lista desplegable Nombre de Clase de Validaci&oacute;n.</p>
<p>El nombre de clase proporcionado debe ser accesible para GlassFish Server. La clase especificada debe implantar la interfaz <code>org.glassfish.api.jdbc.ConnectionValidation</code>.</p>
</li>
<li>
<p>Marque la casilla de verificaci&oacute;n Cerrar todas las conexiones ante cualquier fallo para cerrar el servidor y volver a establecer todas las conexiones en conjunto cuando no se realice correctamente una conexi&oacute;n &uacute;nica.</p>
<p>Si esta opci&oacute;n est&aacute; deshabilitada, las conexiones individuales s&oacute;lo se restablecer&aacute;n cuando se utilicen. Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>Marque la casilla de verificaci&oacute;n Permitir solicitantes que no son componentes habilitados para que los solicitantes que no sean componentes, como los filtros de servlet y los administradores de persistencia de terceros, puedan utilizar el conjunto.</p>
<p>Las conexiones obtenidas por solicitantes que no son componentes no se cierran autom&aacute;ticamente al final de una transacci&oacute;n realizada por el contenedor. El solicitante ha de cerrarla &eacute;l mismo. Esta opci&oacute;n se deshabilita por defecto.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n Vaciar en la ficha General para vaciar todas las conexiones de la agrupaci&oacute;n.</p>
<p>Al hacer clic en este bot&oacute;n se destruyen todas las conexiones existentes, se recrean las conexiones establecidas para el conjunto y se restablece el tama&ntilde;o de conjunto inicial y m&iacute;nimo del conjunto.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configurar el Acceso a la Base de Datos</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Integrar un Controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Crear un Recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Editar un Recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Suprimir un Recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Crear un Pool de Conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Editar Configuraci&oacute;n General de los Pools de Conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Verificar la Configuraci&oacute;n del Pool de Conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar las Propiedades de los Pools de Conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suprimir un Pool de Conexiones JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
