<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-iioplisteneredit" name="task-iioplisteneredit"></a><a id="GHCOR00008" name="GHCOR00008"></a></p>

<h4><a id="sthref7" name="sthref7"></a>Modificare un listener IIOP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Nella struttura ad albero di navigazione, espandere il nodo Configurazione.</p>
</li>
<li>
<p>Selezionare l'istanza da configurare:</p>
<ul>
<li>
<p>Per configurare un'istanza specifica, selezionare il nodo di configurazione dell'istanza. Ad esempio, per l'istanza predefinita <code>server</code>, selezionare il nodo <code>server-config</code>.</p>
</li>
<li>
<p>Per configurare le impostazioni predefinite di istanze future che utilizzano una copia di <code>default-config</code>, selezionare il nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Nel nodo Configurazione, espandere il nodo ORB.</p>
</li>
<li>
<p>Selezionare il nodo Listener IIOP.</p>
<p>Viene visualizzata la pagina Listener IIOP.</p>
</li>
<li>
<p>Nella tabella fare clic sul nome del listener da modificare.</p>
<p>Viene visualizzata la pagina Modifica listener IIOP.</p>
</li>
<li>
<p>Nel campo Indirizzo di rete, immettere l'indirizzo di rete del listener.</p>
<p>&Egrave; possibile immettere un indirizzo IP o un nome host DNS risolvibile.</p>
</li>
<li>
<p>Nel campo Porta listener, immettere il numero della porta in cui il listener IIOP &egrave; in ascolto.</p>
</li>
<li>
<p>Selezionare la casella di controllo Listener abilitato per abilitare le connessioni in entrata ORB IIOP per GlassFish Server.</p>
<p>Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</li>
<li>
<p>Selezionare la casella di controllo Sicurezza abilitata per abilitare SSL per il listener IIOP.</p>
<p>Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>In GlassFish Server non &egrave; definita alcuna propriet&agrave; aggiuntiva per i listener IIOP.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome relativo alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>

<hr>
<p><b>Suggerimento:</b></p>
Per tornare alle impostazioni predefinite, fare clic sul pulsante Carica impostazioni predefinite, quindi su Salva.
<hr>

</li>
<li>
<p>Se la casella di controllo Sicurezza abilitata &egrave; selezionata, fare clic sul riquadro a schede SSL per modificare le impostazioni Secure Socket Layer relative a tale listener IIOP.</p>
<p>Per ulteriori dettagli, vedere<a href="task-editiiopssl.html">Modificare le impostazioni SSL per un listener IIOP sicuro</a>.</p>
</li>
<li>
<p>Se &egrave; stato modificato il numero di porta del listener, riavviare il GlassFish Server.</p>
</li>
</ol>
<a id="sthref8" name="sthref8"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-orb.html">Configurazione dell'ORB</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">Creare un listener IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Modificare le impostazioni SSL per un listener IIOP sicuro</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Eliminare un listener IIOP</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
