<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a><a id="GHCOM00120" name="GHCOM00120"></a></p>

<h4><a id="sthref426" name="sthref426"></a>Nachrichtensicherheitskonfiguration bearbeiten</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Verwenden Sie die Seite "Meldungssicherheitskonfiguration bearbeiten", um Provider f&uuml;r Meldungssicherheit zu aktivieren.</p>
<p>Zum Aktivieren der Meldungssicherheit f&uuml;r in GlassFish Server bereitgestellte Webdienst-End Points muss ein Provider als Standardprovider f&uuml;r die Serverseite angegeben werden. Wenn Sie einen Standardprovider f&uuml;r die Meldungssicherheit aktivieren, m&uuml;ssen ebenfalls Provider f&uuml;r die Clients der in GlassFish Server bereitgestellten Webdienste aktiviert werden. Informationen &uuml;ber die Aktivierung der Provider, die von den Clients verwendet werden, sind in <a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a> enthalten.</p>
<p>Zum Aktivieren der Meldungssicherheit f&uuml;r Webdienstaufrufe von bereitgestellten End Points muss ein standardm&auml;&szlig;iger Clientprovider angegeben werden. Wenn ein Standardclientprovider f&uuml;r GlassFish Server aktiviert wurde, muss sichergestellt werden, dass die von in GlassFish Server bereitgestellten End Points aufgerufenen Dienste f&uuml;r Sicherheit auf Meldungsebene konfiguriert sind.</p>
<p>Die Seite "Neue Meldungssicherheitskonfiguration" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Authentifizierungs-Layer</dt>
<dd>
<p>Die Nachrichtenlayer, in der Authentifizierung durchgef&uuml;hrt wird. Dies ist ein schreibgesch&uuml;tztes Feld. Der Wert ist entweder <code>SOAP</code> (f&uuml;r die Standard-Meldungssicherheitskonfiguration) oder <code>HttpServlet</code>.</p>
</dd>
<dt>Standardprovider</dt>
<dd>
<p>Der serverseitige Standardprovider, falls vorhanden. Der Standardserverprovider, auch Standardprovider genannt, gibt den Serverprovider an, der f&uuml;r Anwendungen aufgerufen wird, f&uuml;r die kein spezifischer Serverprovider festgelegt ist. Zur Auswahl stehen <code>ServerProvider</code>, <code>XWS_ServerProvider</code> oder keine. Standardm&auml;&szlig;ig wird kein Provider ausgew&auml;hlt, so dass GlassFish Server serverseitig keinen Nachrichtensicherheitsprovider aufruft. W&auml;hlen Sie im Allgemeinen <code>ServerProvider</code> als Standardprovider.</p>
</dd>
<dt>Standardclientprovider</dt>
<dd>
<p>Der Standardclientprovider, falls vorhanden. Der Standardclientprovider gibt den Clientprovider an, der f&uuml;r Anwendungen aufgerufen wird, f&uuml;r die kein spezifischer Clientprovider festgelegt ist. Zur Auswahl stehen <code>ClientProvider</code>, <code>XWS_ClientProvider</code> oder keine. Standardm&auml;&szlig;ig ist kein Provider ausgew&auml;hlt, so dass GlassFish Server Client-seitig keinen Meldungssicherheitsprovider aufruft. W&auml;hlen Sie im Allgemeinen f&uuml;r den Standardclientprovider "keine" aus. W&auml;hlen Sie <code>ClientProvider</code>, um einen Standardprovider und eine Nachrichtenschutz-Policy zu aktivieren, die f&uuml;r Webserviceaufrufe von in GlassFish Server bereitgestellten Webservice-End Points angewendet werden.</p>
</dd>
</dl>
<a id="sthref427" name="sthref427"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">So werden GlassFish Server-Funktionalit&auml;ten zur Verwendung durch Nachrichtensicherheitsprovider konfiguriert</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">So wird eine Nachrichtensicherheitskonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">So wird eine Nachrichtensicherheitskonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">So wird eine Nachrichtensicherheitskonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">So wird eine Konfiguration eines Nachrichtensicherheitsprovider erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">So wird eine Konfiguration eines Nachrichtensicherheitsprovider bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">So wird eine Konfiguration eines Nachrichtensicherheitsproviders gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a></p>
</li>
</ul>
<a id="sthref428" name="sthref428"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<p>Verwenden Sie den Befehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a>, um eine Nachrichtensicherheitskonfiguration zu &auml;ndern.</p>
<ul>
<li>
<p>Zum Festlegen des Standardserverproviders:</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>Zum Festlegen des Standardclientproviders:</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
