<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfig"></a><h4>Nachrichtensicherheitskonfigurationen</h4>
<a name="indexterm-229"></a><p>Auf der Seite "Nachrichtensicherheitskonfigurationen" k&#246;nnen Sie die verf&#252;gbaren Konfigurationen f&#252;r Nachrichtensicherheitsanbieter anzeigen
und &#228;ndern. </p>

<p>Um Nachrichtensicherheit zu konfigurieren, ben&#246;tigen Sie ein grundlegendes Verst&#228;ndnis von Sicherheits- und
Webservice-Konzepten. Weitere Informationen finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2435&id=ablrk">Kapitel 3, Administering Message Security in <i>Oracle GlassFish Server 3.1 Security Guide</i></a> und <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=gbbjk">Kapitel 6, Administering Web Applications in <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>.</p>

<p>GlassFish-Server implementiert die Meldungssicherheit mithilfe von Meldungssicherheitsanbietern, die auf SOAP-Verarbeitungsebene integriert sind.
Die Meldungssicherheitsanbieter h&#228;ngen von den Sicherheitsfunktionen von GlassFish-Server ab.</p>

<p>F&#252;r jede Konfiguration werden die folgenden Informationen zur Verf&#252;gung gestellt.</p>

<dl><dt>Authentifizierungs-Layer</dt>
<dd><p>Die Nachrichtenlayer, in der Authentifizierung durchgef&#252;hrt wird. Standardm&#228;&#223;ig wird eine SOAP-Konfiguration bereitgestellt. Es ist dar&#252;ber hinaus m&#246;glich, eine HttpServlet-Konfiguration bereitzustellen.</p>

</dd>
<dt>Standardanbieter</dt>
<dd><p>Der Standard-Serveranbieter f&#252;r diese Konfiguration. Standardm&#228;&#223;ig ist kein Serveranbieter konfiguriert.</p>

</dd>
<dt>Standard-Clientanbieter</dt>
<dd><p>Der Standard-Clientanbieter f&#252;r diese Konfiguration. Standardm&#228;&#223;ig ist kein Standard-Clientanbieter konfiguriert.</p>

</dd>
</dl>
<p>Die Tabelle "Nachrichtensicherheitskonfiguration" enth&#228;lt auch die folgenden Optionen.</p>

<dl><dt>Neu</dt>
<dd><p>Schaltfl&#228;che zum Erstellen einer neuen Konfiguration.</p>

</dd>
<dt>L&#246;schen</dt>
<dd><p>Schaltfl&#228;che zum L&#246;schen einer oder mehrerer ausgew&#228;hlter Konfigurationen.</p>

</dd>
</dl>
<a name="gkoky"></a><h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie GlassFish-Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p>

</li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p>

</li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p>

</li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfignew.html">So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p>

</li>
<li><p><a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a></p>

</li></ul>
<a name="gkong"></a><h5>Verwandte <tt>asadmin</tt>-Befehle</h5>
<p>Keine.</p>



<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
