<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uploaddev"></a><h4>Anwendungen oder Module bereitstellen</h4>
<a name="indexterm-174"></a><a name="indexterm-175"></a><a name="indexterm-176"></a><a name="indexterm-177"></a><a name="indexterm-178"></a><a name="indexterm-179"></a><a name="indexterm-180"></a><a name="indexterm-181"></a><a name="indexterm-182"></a><a name="indexterm-183"></a><a name="indexterm-184"></a><a name="indexterm-185"></a><p>&#220;ber die Seite "Deploy Applications or Modules" (Anwendungen oder Module bereitstellen) k&#246;nnen
Sie eine Anwendung bereitstellen.</p>

<p>Diese Seite enth&#228;lt die folgenden Optionen f&#252;r alle Anwendungen. Zus&#228;tzliche Optionen werden
erst angezeigt, nachdem Sie das Feld Position f&#252;r die Anwendung festgelegt haben.</p>

<dl><dt>Location (Ort)</dt>
<dd><p>Der Speicherort des Archivs f&#252;r die bereitzustellende Anwendung.</p>

<p>Die folgenden Optionen geben an, von wo aus auf das Archiv zugegriffen werden kann und ob das Archiv eine Datei oder ein Verzeichnis ist.</p>

<dl><dt>Gepackte Datei zum Hochladen auf den Server</dt>
<dd><p>Das Archiv ist in einer Datei, die sich auf dem Clientcomputer befindet oder auf die von dort aus zugegriffen werden kann.</p>

<p>Der Clientcomputer ist der Host, auf dem Sie die Administration Console &#252;ber einen Browser anzeigen.</p>

</dd>
<dt>Lokale gepackte Datei oder Verzeichnis, auf die/das von GlassFish-Server aus zugegriffen werden kann;</dt>
<dd><p>Das Archiv ist eine Datei, die sich auf dem Servercomputer befindet, oder eine nicht verpackte Anwendung in einem aufgel&#246;sten Verzeichnis.</p>

<p>Der Serverrechner ist der Host, der den GlassFish-Server Domain Administration Server (DAS) ausf&#252;hrt. </p>

</dd>
</dl>
</dd>
<dt>Typ</dt>
<dd><p>Der Typ der Anwendung. Zur Auswahl stehen:</p>


<ul><li><p>Webanwendung</p>

</li>
<li><p>Unternehmensanwendung</p>

</li>
<li><p>Anwendungs-Client</p>

</li>
<li><p>Connector-Modul</p>

</li>
<li><p>EJB Jar</p>

</li>
<li><p>Andere</p>

</li></ul>
</dd>
<dt>Ziele</dt>
<dd><p>Cluster und eigenst&#228;ndige Instanzen, f&#252;r die die Anwendung oder das Modul bereitgestellt werden soll. Verschieben Sie die ben&#246;tigten Ziele in die Spalte "Ausgew&#228;hlte Ziele", indem Sie die Schaltfl&#228;chen "Hinzuf&#252;gen" und "Alle hinzuf&#252;gen" verwenden. Verschieben Sie nicht ben&#246;tigte Ziele in die Spalte "Verf&#252;gbare Ziele", indem Sie die Schaltfl&#228;chen "Entfernen" und "Alle entfernen" verwenden.</p>

<p>Diese Option wird nur dann angezeigt, wenn in der Dom&#228;ne Cluster oder eigenst&#228;ndige Instanzen erstellt wurden.</p>

</dd>
</dl>
<p>Zus&#228;tzliche Optionen f&#252;r die verschiedenen Anwendungstypen sind in den folgenden Abschnitten beschrieben.</p>


<ul><li><p><a href="#ref-webapp-options">Weitere Optionen f&#252;r eine Web-Anwendung</a></p>

</li>
<li><p><a href="#ref-entapp-options">Weitere Optionen f&#252;r eine Unternehmensanwendung</a></p>

</li>
<li><p><a href="#ref-appclient-options">Weitere Optionen f&#252;r einen Anwendungs-Client</a></p>

</li>
<li><p><a href="#ref-connmodule-options">Zus&#228;tzliche Optionen f&#252;r ein Connector-Modul</a></p>

</li>
<li><p><a href="#ref-ejb-options">Weitere Optionen f&#252;r ein EJB Jar</a></p>

</li></ul>
<a name="ref-webapp-options"></a><h5>Weitere Optionen f&#252;r eine Web-Anwendung</h5>
<p>Falls der Anwendungstyp eine Web-Anwendung ist, werden die folgenden Optionen angezeigt.</p>

<dl><dt>Context Root (Kontext-Root)</dt>
<dd><p>Der Pfad zu der Anwendung. Im URL der Webanwendung folgt die Kontext-Root gleich hinter der Portnummer (<tt>http://<i>host</i>:<i> port</i>/<i>context-root</i>/...</tt>). Die Kontext-Root sollte mit einem Schr&#228;gstrich beginnen, wie z. B. <tt>/hallo</tt>.</p>

</dd>
<dt>Application Name (Anwendungsname)</dt>
<dd><p>Der Name der Anwendung.</p>

<p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche (<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Virtual Servers (Virtuelle Server)</dt>
<dd><p>Die mit dieser Anwendung verbundenen virtuellen Server.</p>

<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die standardm&#228;&#223;ige Serverinstanz <tt>server</tt> vorhanden ist. Wenn Cluster oder andere eigenst&#228;ndige Serverinstanzen vorhanden sind, k&#246;nnen Sie nach der Bereitstellung virtuelle Server ausw&#228;hlen. W&#228;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&#223;end "Virtuelle Server verwalten" f&#252;r das gew&#252;nschte Ziel.</p>

</dd>
<dt>Status</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist die Anwendung aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Verf&#252;gbarkeit</dt>
<dd><p>Wenn dieses Kontrollk&#228;stchen aktiviert ist, wird die Hochverf&#252;gbarkeit f&#252;r Websitzungen und f&#252;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&#246;glicherweise die Passivierung aktiviert. Ist der Wert auf false (Standardwert) gesetzt, werden alle Websitzungsspeichervorg&#228;nge und SFSB-Fixpunktroutinen f&#252;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf true gesetzt, wird die angegebene Anwendung oder das Modul f&#252;r Hochverf&#252;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf true, wenn die Hochverf&#252;gbarkeit auf einer h&#246;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>

<p>Diese Option wird angezeigt, wenn neben der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) Cluster oder eigenst&#228;ndige Serverinstanzen vorhanden sind.</p>

</dd>
<dt>JSPs vorkompilieren</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden JavaServer Pages (JSP)-Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Verifier ausf&#252;hren</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Bereitstellungs-Deskriptoren vor der Bereitstellung verifiziert. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>

</dd>
<dt>Erneute Bereitstellung erzwingen</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Status beibehalten</dt>
<dd><p>Diese Option steuert, ob Websitzungen, SFSB-Instanzen und dauerhaft erstellte EJB-Zeitgeber zwischen erneuten Bereitstellungen erhalten bleiben. </p>

<p>Diese Option ist standardm&#228;&#223;ig deaktiviert. Diese Option wird nur bei der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) unterst&#252;tzt. Bei anderen Zielen wird sie nicht unterst&#252;tzt und ignoriert.</p>

<p>&#196;nderungen, die an einer Anwendung zwischen Bereitstellungen vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. &#196;ndern Sie beispielsweise nicht die Instanzenvariablen in der SFSB-Bean-Klasse.</p>

<p>Bei Webanwendungen ist diese Funktion nur dann anwendbar, wenn in der Datei <tt>glassfish-web-app.xml </tt> das Attribut <tt>Fortdauertyp</tt> des Elements <tt> Sitzungsmanager</tt> <tt>file</tt> lautet.</p>

<p>Bei Stateful-Session-Bean-Instanzen wird der Fortdauertyp ohne hohe Verf&#252;gbarkeit im Server festgelegt (die Option "SFSB-Fortdauertyp") und muss auf <tt>file</tt>, den empfohlenen Standardwert, gesetzt werden.</p>

<p>Kann eine aktive Websitzung, SFSB-Instanz oder ein EJB-Zeitgeber nicht gespeichert oder wiederhergestellt werden, stehen diese <b>nicht</b> zur Verf&#252;gung, wenn die erneute Bereitstellung abgeschlossen ist. Die erneute Bereitstellung wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>

<p>Damit die Daten aktiver Zust&#228;nde erhalten bleiben, werden die Daten von GlassFish-Server serialisiert und gespeichert. Zum Wiederherstellen der Daten entserialisiert das Klassenladeprogramm der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>

</dd>
<dt>F&#252;r einen bestimmten Anwendungsbereich definierte Ressourcen beibehalten</dt>
<dd><p>Wenn diese Option aktiviert ist, werden f&#252;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&#228;hrend der erneuten Bereitstellung wiederhergestellt. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Libraries (Bibliotheken)</dt>
<dd><p>Eine durch Kommas getrennte Liste JAR-Dateien der Bibliothek, die auf dieses Modul oder diese Anwendung zugeschnitten sind. Die Pfade k&#246;nnen absolut oder relativ sein. Ein relativer Pfad ist relativ zu <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Falls der Pfad absolut ist, muss der Pfad f&#252;r den Domain Administration Server (DAS) zug&#228;nglich sein. Dies bedeutet, dass er sich unter <tt></tt><i>domain-dir</i><tt></tt> befinden muss. Die Bibliotheken werden der Anwendung in der Reihenfolge verf&#252;gbar gemacht, in der sie festgelegt sind.</p>

</dd>
<dt>Description (Beschreibung)</dt>
<dd><p>Eine Beschreibung der Anwendung.</p>

</dd>
</dl>
<a name="ref-entapp-options"></a><h5>Weitere Optionen f&#252;r eine Unternehmensanwendung</h5>
<p>Falls der Anwendungstyp Unternehmensanwendung ist, werden die folgenden Optionen angezeigt.</p>

<dl><dt>Application Name (Anwendungsname)</dt>
<dd><p>Der Name der Anwendung.</p>

<p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche (<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Virtual Servers (Virtuelle Server)</dt>
<dd><p>Die mit dieser Anwendung verbundenen virtuellen Server.</p>

<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die standardm&#228;&#223;ige Serverinstanz <tt>server</tt> vorhanden ist. Wenn Cluster oder andere eigenst&#228;ndige Serverinstanzen vorhanden sind, k&#246;nnen Sie nach der Bereitstellung virtuelle Server ausw&#228;hlen. W&#228;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&#223;end "Virtuelle Server verwalten" f&#252;r das gew&#252;nschte Ziel.</p>

</dd>
<dt>Status</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist die Anwendung aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Verf&#252;gbarkeit</dt>
<dd><p>Wenn dieses Kontrollk&#228;stchen aktiviert ist, wird die Hochverf&#252;gbarkeit f&#252;r Websitzungen und f&#252;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&#246;glicherweise die Passivierung aktiviert. Ist der Wert auf false (Standardwert) gesetzt, werden alle Websitzungsspeichervorg&#228;nge und SFSB-Fixpunktroutinen f&#252;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf true gesetzt, wird die angegebene Anwendung oder das Modul f&#252;r Hochverf&#252;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf true, wenn die Hochverf&#252;gbarkeit auf einer h&#246;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>

<p>Diese Option wird angezeigt, wenn neben der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) Cluster oder eigenst&#228;ndige Serverinstanzen vorhanden sind.</p>

</dd>
<dt>Java Web Start</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, ist der Zugriff auf Java Web Start f&#252;r ein Anwendungsclientmodul nicht zul&#228;ssig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>JSPs vorkompilieren</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden JavaServer Pages (JSP)-Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Verifier ausf&#252;hren</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Bereitstellungs-Deskriptoren vor der Bereitstellung verifiziert. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>

</dd>
<dt>Kompatibilit&#228;t</dt>
<dd><p>Wenn diese Option aktiviert ist, werden GlassFish-Server v2 JAR-Sichtbarkeitsanforderungen f&#252;r Anwendungen anstelle der strikteren Java EE 6-Anforderungen verwendet, die in GlassFish-Server v3-Versionen einschlie&#223;lich 3.1 implementiert sind. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Die Java EE 6-Plattformspezifikation enth&#228;lt striktere Anforderungen als Java EE 5, was die Sichtbarkeit bestimmter JAR-Dateien f&#252;r verschiedene Module innerhalb einer EAR-Datei angeht. Insbesondere d&#252;rfen Anwendungsclients keinen Zugriff auf EJB-JAR-Dateien oder andere JAR-Dateien in der EAR-Datei haben, es sei denn, Referenzen verwenden den standardm&#228;&#223;igen Java SE-Mechanismus (beispielsweise Erweiterungen) oder den Java EE-Bibliothekenverzeichnismechanismus. Wenn dieses Kontrollk&#228;stchen aktiviert wird, werden diese Java EE 6-Beschr&#228;nkungen entfernt.</p>

</dd>
<dt>Erneute Bereitstellung erzwingen</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Status beibehalten</dt>
<dd><p>Diese Option steuert, ob Websitzungen, SFSB-Instanzen und dauerhaft erstellte EJB-Zeitgeber zwischen erneuten Bereitstellungen erhalten bleiben. </p>

<p>Diese Option ist standardm&#228;&#223;ig deaktiviert. Diese Option wird nur bei der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) unterst&#252;tzt. Bei anderen Zielen wird sie nicht unterst&#252;tzt und ignoriert.</p>

<p>&#196;nderungen, die an einer Anwendung zwischen Bereitstellungen vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. &#196;ndern Sie beispielsweise nicht die Instanzenvariablen in der SFSB-Bean-Klasse.</p>

<p>Bei Webanwendungen ist diese Funktion nur dann anwendbar, wenn in der Datei <tt>glassfish-web-app.xml </tt> das Attribut <tt>Fortdauertyp</tt> des Elements <tt> Sitzungsmanager</tt> <tt>file</tt> lautet.</p>

<p>Bei Stateful-Session-Bean-Instanzen wird der Fortdauertyp ohne hohe Verf&#252;gbarkeit im Server festgelegt (die Option "SFSB-Fortdauertyp") und muss auf <tt>file</tt>, den empfohlenen Standardwert, gesetzt werden.</p>

<p>Kann eine aktive Websitzung, SFSB-Instanz oder ein EJB-Zeitgeber nicht gespeichert oder wiederhergestellt werden, stehen diese <b>nicht</b> zur Verf&#252;gung, wenn die erneute Bereitstellung abgeschlossen ist. Die erneute Bereitstellung wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>

<p>Damit die Daten aktiver Zust&#228;nde erhalten bleiben, werden die Daten von GlassFish-Server serialisiert und gespeichert. Zum Wiederherstellen der Daten entserialisiert das Klassenladeprogramm der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>

</dd>
<dt>F&#252;r einen bestimmten Anwendungsbereich definierte Ressourcen beibehalten</dt>
<dd><p>Wenn diese Option aktiviert ist, werden f&#252;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&#228;hrend der erneuten Bereitstellung wiederhergestellt. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Libraries (Bibliotheken)</dt>
<dd><p>Eine durch Kommas getrennte Liste der JAR-Dateien der Bibliothek f&#252;r diese Anwendung. Legt einen absoluten oder relativen Pfad fest. Ein relativer Pfad ist relativ zu <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Falls der Pfad absolut ist, muss der Pfad f&#252;r den Domain Administration Server (DAS) zug&#228;nglich sein. Dies bedeutet, dass er sich unter <tt></tt><i>domain-dir</i><tt></tt> befinden muss. Die Bibliotheken werden der Anwendung in der Reihenfolge verf&#252;gbar gemacht, in der sie festgelegt sind.</p>

</dd>
<dt>Description (Beschreibung)</dt>
<dd><p>Eine Beschreibung der Anwendung.</p>

</dd>
</dl>
<a name="ref-appclient-options"></a><h5>Weitere Optionen f&#252;r einen Anwendungs-Client</h5>
<p>Wenn der Anwendungstyp ein Anwendungs-Client ist, werden die folgenden Optionen angezeigt.</p>

<dl><dt>Application Name (Anwendungsname)</dt>
<dd><p>Der Name der Anwendung.</p>

<p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche (<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Java Web Start</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, ist der Zugriff auf Java Web Start f&#252;r ein Anwendungsclientmodul nicht zul&#228;ssig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Verifier ausf&#252;hren</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Bereitstellungs-Deskriptoren vor der Bereitstellung verifiziert. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>

</dd>
<dt>Erneute Bereitstellung erzwingen</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Description (Beschreibung)</dt>
<dd><p>Eine Beschreibung der Anwendung.</p>

</dd>
</dl>
<a name="ref-connmodule-options"></a><h5>Zus&#228;tzliche Optionen f&#252;r ein Connector-Modul</h5>
<p>Wenn der Anwendungstyp ein Connector-Modul ist, werden die folgenden Optionen angezeigt.</p>

<dl><dt>Application Name (Anwendungsname)</dt>
<dd><p>Der Name der Anwendung.</p>

<p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche (<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Status</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist die Anwendung aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Verifier ausf&#252;hren</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Bereitstellungs-Deskriptoren vor der Bereitstellung verifiziert. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>

</dd>
<dt>Erneute Bereitstellung erzwingen</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>F&#252;r einen bestimmten Anwendungsbereich definierte Ressourcen beibehalten</dt>
<dd><p>Wenn diese Option aktiviert ist, werden f&#252;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&#228;hrend der erneuten Bereitstellung wiederhergestellt. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Beschreibung</dt>
<dd><p>Eine Beschreibung der Anwendung.</p>

</dd>
</dl>
<a name="ref-ejb-options"></a><h5>Weitere Optionen f&#252;r ein EJB Jar</h5>
<p>Wenn der Anwendungstyp EJB Jar ist, werden die folgenden Optionen angezeigt.</p>

<dl><dt>Application Name (Anwendungsname)</dt>
<dd><p>Der Name der Anwendung.</p>

<p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche (<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Status</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist die Anwendung aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Verf&#252;gbarkeit</dt>
<dd><p>Wenn dieses Kontrollk&#228;stchen aktiviert ist, wird die Hochverf&#252;gbarkeit f&#252;r Websitzungen und f&#252;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&#246;glicherweise die Passivierung aktiviert. Ist der Wert auf false (Standardwert) gesetzt, werden alle Websitzungsspeichervorg&#228;nge und SFSB-Fixpunktroutinen f&#252;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf true gesetzt, wird die angegebene Anwendung oder das Modul f&#252;r Hochverf&#252;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf true, wenn die Hochverf&#252;gbarkeit auf einer h&#246;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>

<p>Diese Option wird angezeigt, wenn neben der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) Cluster oder eigenst&#228;ndige Serverinstanzen vorhanden sind.</p>

</dd>
<dt>Verifier ausf&#252;hren</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Bereitstellungs-Deskriptoren vor der Bereitstellung verifiziert. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>

</dd>
<dt>Kompatibilit&#228;t</dt>
<dd><p>Wenn diese Option aktiviert ist, werden GlassFish-Server v2 JAR-Sichtbarkeitsanforderungen f&#252;r Anwendungen anstelle der strikteren Java EE 6-Anforderungen verwendet, die in GlassFish-Server v3-Versionen einschlie&#223;lich 3.1 implementiert sind. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Die Java EE 6-Plattformspezifikation enth&#228;lt striktere Anforderungen als Java EE 5, was die Sichtbarkeit bestimmter JAR-Dateien f&#252;r verschiedene Module innerhalb einer EAR-Datei angeht. Insbesondere d&#252;rfen Anwendungsclients keinen Zugriff auf EJB-JAR-Dateien oder andere JAR-Dateien in der EAR-Datei haben, es sei denn, Referenzen verwenden den standardm&#228;&#223;igen Java SE-Mechanismus (beispielsweise Erweiterungen) oder den Java EE-Bibliothekenverzeichnismechanismus. Wenn dieses Kontrollk&#228;stchen aktiviert wird, werden diese Java EE 6-Beschr&#228;nkungen entfernt.</p>

</dd>
<dt>Erneute Bereitstellung erzwingen</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Status beibehalten</dt>
<dd><p>Diese Option steuert, ob Websitzungen, SFSB-Instanzen und dauerhaft erstellte EJB-Zeitgeber zwischen erneuten Bereitstellungen erhalten bleiben. </p>

<p>Diese Option ist standardm&#228;&#223;ig deaktiviert. Diese Option wird nur bei der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) unterst&#252;tzt. Bei anderen Zielen wird sie nicht unterst&#252;tzt und ignoriert.</p>

<p>&#196;nderungen, die an einer Anwendung zwischen Bereitstellungen vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. &#196;ndern Sie beispielsweise nicht die Instanzenvariablen in der SFSB-Bean-Klasse.</p>

<p>Bei Webanwendungen ist diese Funktion nur dann anwendbar, wenn in der Datei <tt>glassfish-web-app.xml </tt> das Attribut <tt>Fortdauertyp</tt> des Elements <tt> Sitzungsmanager</tt> <tt>file</tt> lautet.</p>

<p>Bei Stateful-Session-Bean-Instanzen wird der Fortdauertyp ohne hohe Verf&#252;gbarkeit im Server festgelegt (die Option "SFSB-Fortdauertyp") und muss auf <tt>file</tt>, den empfohlenen Standardwert, gesetzt werden.</p>

<p>Kann eine aktive Websitzung, SFSB-Instanz oder ein EJB-Zeitgeber nicht gespeichert oder wiederhergestellt werden, stehen diese <b>nicht</b> zur Verf&#252;gung, wenn die erneute Bereitstellung abgeschlossen ist. Die erneute Bereitstellung wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>

<p>Damit die Daten aktiver Zust&#228;nde erhalten bleiben, werden die Daten von GlassFish-Server serialisiert und gespeichert. Zum Wiederherstellen der Daten entserialisiert das Klassenladeprogramm der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>

</dd>
<dt>F&#252;r einen bestimmten Anwendungsbereich definierte Ressourcen beibehalten</dt>
<dd><p>Wenn diese Option aktiviert ist, werden f&#252;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&#228;hrend der erneuten Bereitstellung wiederhergestellt. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Libraries (Bibliotheken)</dt>
<dd><p>Eine durch Kommas getrennte Liste der JAR-Dateien in der Bibliothek, die auf dieses Modul oder diese Anwendung zugeschnitten sind. Legt einen absoluten oder relativen Pfad fest. Ein relativer Pfad ist relativ zu <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Falls der Pfad absolut ist, muss der Pfad f&#252;r den Domain Administration Server (DAS) zug&#228;nglich sein. Dies bedeutet, dass er sich unter <tt></tt><i>domain-dir</i><tt></tt> befinden muss. Die Bibliotheken werden der Anwendung in der Reihenfolge verf&#252;gbar gemacht, in der sie festgelegt sind.</p>

</dd>
<dt>Description (Beschreibung)</dt>
<dd><p>Eine Beschreibung der Anwendung.</p>

</dd>
</dl>
<h5>Weitere Optionen f&#252;r Anwendungen vom Type "Andere"</h5>
<p>Wenn der Anwendungstyp "Andere" ist, werden die folgenden Optionen angezeigt.</p>

<dl><dt>Application Name (Anwendungsname)</dt>
<dd><p>Der Name der Anwendung.</p>

<p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche (<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p>

</dd>
<dt>Virtual Servers (Virtuelle Server)</dt>
<dd><p>Die mit dieser Anwendung verbundenen virtuellen Server.</p>

<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die standardm&#228;&#223;ige Serverinstanz <tt>server</tt> vorhanden ist. Wenn Cluster oder andere eigenst&#228;ndige Serverinstanzen vorhanden sind, k&#246;nnen Sie nach der Bereitstellung virtuelle Server ausw&#228;hlen. W&#228;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&#223;end "Virtuelle Server verwalten" f&#252;r das gew&#252;nschte Ziel.</p>

</dd>
<dt>Status</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist die Anwendung aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Verf&#252;gbarkeit</dt>
<dd><p>Wenn dieses Kontrollk&#228;stchen aktiviert ist, wird die Hochverf&#252;gbarkeit f&#252;r Websitzungen und f&#252;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&#246;glicherweise die Passivierung aktiviert. Ist der Wert auf false (Standardwert) gesetzt, werden alle Websitzungsspeichervorg&#228;nge und SFSB-Fixpunktroutinen f&#252;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf true gesetzt, wird die angegebene Anwendung oder das Modul f&#252;r Hochverf&#252;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf true, wenn die Hochverf&#252;gbarkeit auf einer h&#246;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>

<p>Diese Option wird angezeigt, wenn neben der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) Cluster oder eigenst&#228;ndige Serverinstanzen vorhanden sind.</p>

</dd>
<dt>OSGi-Typ</dt>
<dd><p>Wenn diese Option aktiviert ist, wird ein OSGi/Java-EE-Hybridmodul angegeben. Diese Option wird nur dann angezeigt, wenn der gew&#228;hlte Typ "Andere" ist.</p>

</dd>
<dt>JSPs vorkompilieren</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden JavaServer Pages (JSP)-Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Verifier ausf&#252;hren</dt>
<dd><p>Wenn diese Option aktiviert ist, werden Bereitstellungs-Deskriptoren vor der Bereitstellung verifiziert. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

<p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>

</dd>
<dt>Erneute Bereitstellung erzwingen</dt>
<dd><p>Ist diese Option ausgew&#228;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p>

</dd>
<dt>Status beibehalten</dt>
<dd><p>Diese Option steuert, ob Websitzungen, SFSB-Instanzen und dauerhaft erstellte EJB-Zeitgeber zwischen erneuten Bereitstellungen erhalten bleiben. </p>

<p>Diese Option ist standardm&#228;&#223;ig deaktiviert. Diese Option wird nur bei der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) unterst&#252;tzt. Bei anderen Zielen wird sie nicht unterst&#252;tzt und ignoriert.</p>

<p>&#196;nderungen, die an einer Anwendung zwischen Bereitstellungen vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. &#196;ndern Sie beispielsweise nicht die Instanzenvariablen in der SFSB-Bean-Klasse.</p>

<p>Bei Webanwendungen ist diese Funktion nur dann anwendbar, wenn in der Datei <tt>glassfish-web-app.xml </tt> das Attribut <tt>Fortdauertyp</tt> des Elements <tt> Sitzungsmanager</tt> <tt>file</tt> lautet.</p>

<p>Bei Stateful-Session-Bean-Instanzen wird der Fortdauertyp ohne hohe Verf&#252;gbarkeit im Server festgelegt (die Option "SFSB-Fortdauertyp") und muss auf <tt>file</tt>, den empfohlenen Standardwert, gesetzt werden.</p>

<p>Kann eine aktive Websitzung, SFSB-Instanz oder ein EJB-Zeitgeber nicht gespeichert oder wiederhergestellt werden, stehen diese <b>nicht</b> zur Verf&#252;gung, wenn die erneute Bereitstellung abgeschlossen ist. Die erneute Bereitstellung wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>

<p>Damit die Daten aktiver Zust&#228;nde erhalten bleiben, werden die Daten von GlassFish-Server serialisiert und gespeichert. Zum Wiederherstellen der Daten entserialisiert das Klassenladeprogramm der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>

</dd>
<dt>Libraries (Bibliotheken)</dt>
<dd><p>Eine durch Kommas getrennte Liste der JAR-Dateien in der Bibliothek, die auf dieses Modul oder diese Anwendung zugeschnitten sind. Legt einen absoluten oder relativen Pfad fest. Ein relativer Pfad ist relativ zu <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Falls der Pfad absolut ist, muss der Pfad f&#252;r den Domain Administration Server (DAS) zug&#228;nglich sein. Dies bedeutet, dass er sich unter <tt></tt><i>domain-dir</i><tt></tt> befinden muss. Die Bibliotheken werden der Anwendung in der Reihenfolge verf&#252;gbar gemacht, in der sie festgelegt sind.</p>

</dd>
<dt>Description (Beschreibung)</dt>
<dd><p>Eine Beschreibung der Anwendung.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-applistdeployed.html">So zeigen Sie eine Liste eingesetzter Anwendungen an</a></p>

</li>
<li><p><a href="task-appdeployweb.html">So stellen Sie eine Webanwendung bereit</a></p>

</li>
<li><p><a href="task-deployentapp.html">So stellen Sie eine Unternehmensanwendung bereit</a></p>

</li>
<li><p><a href="task-appdeployclient.html">So stellen Sie einen Anwendungs-Client bereit</a></p>

</li>
<li><p><a href="task-appdeployconn.html">So stellen Sie ein Verbindungsmodul bereit</a></p>

</li>
<li><p><a href="task-appdeployejb.html">So stellen Sie ein EJB Jar bereit</a></p>

</li>
<li><p><a href="task-appedit.html">So bearbeiten Sie eine bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-appviewdesc.html">So zeigen Sie die Beschreibung einer Anwendung an</a></p>

</li>
<li><p><a href="task-endpoint.html">So zeigen Sie Endpunkt-Informationen f&#252;r einen Webdienst an</a></p>

</li>
<li><p><a href="task-applaunch.html">So starten Sie eine Anwendung</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">So starten Sie einen Anwendungs-Client</a></p>

</li>
<li><p><a href="task-appredeploy.html">Eine bereitgestellte Anwendung erneut bereitstellen</a></p>

</li>
<li><p><a href="task-apprestart.html">So laden Sie eine bereitgestellte Anwendung erneut</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=deploy-1"><tt>deploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=redeploy-1"><tt>redeploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-applications-1"><tt>list-applications</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
