<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Dateibenutzer</h4>
<a name="indexterm-215"></a><p>Auf der Seite "Dateibenutzer" k&#246;nnen Sie die Benutzer des <tt>file</tt>-Bereichs verwalten. Benutzer und
Gruppen im <tt>file</tt>-Bereich sind in der Schl&#252;sseldatei aufgef&#252;hrt, deren Speicherort durch die
Eigenschaft <tt>file</tt> angegeben wird.</p>

<p>Ein Benutzer im Bereich <tt>file</tt> kann zu einer <b>Java-Gruppe</b> geh&#246;ren, einer Benutzerkategorie,
die durch gemeinsame Merkmale klassifiziert ist. So k&#246;nnen Kunden einer eCommerce-Anwendung z.
B. zur Gruppe <tt>CUSTOMER</tt> geh&#246;ren, die Gro&#223;kunden w&#252;rden jedoch der Gruppe <tt>PREFERRED</tt>
angeh&#246;ren. Das Kategorisieren von Benutzern in Gruppen vereinfacht die Zugangssteuerung bei einer
gro&#223;en Benutzeranzahl.</p>

<p>Nach der Installation von GlassFish-Server ist der w&#228;hrend der Installation eingegebene Administrator
zun&#228;chst der einzige Benutzer. Dieser Benutzer ist standardm&#228;&#223;ig Mitglied der Gruppe <tt>asadmin</tt>
im Bereich <tt>admin-realm</tt> und damit berechtigt, &#196;nderungen an GlassFish-Server vorzunehmen. Benutzer, die
dieser Gruppe zugewiesen sind, verf&#252;gen &#252;ber Administratorrechte und k&#246;nnen damit auf das
<tt>asadmin</tt>-Tool und die Administration Console zugreifen.</p>

<p>Die Seite Dateibenutzer enth&#228;lt eine Liste mit Benutzern f&#252;r den ausgew&#228;hlten Bereich.
F&#252;r jeden Benutzer werden die folgenden Informationen zur Verf&#252;gung gestellt:</p>

<dl><dt>Benutzer-ID</dt>
<dd><p>Der Name des Benutzers.</p>

</dd>
<dt>Gruppenliste</dt>
<dd><p>Die Gruppen, denen der Benutzer angeh&#246;rt.</p>

</dd>
</dl>
<p>Die Tabelle "Dateibenutzer" enth&#228;lt dar&#252;ber hinaus die folgenden Optionen.</p>

<dl><dt>Neu</dt>
<dd><p>Schaltfl&#228;che zum Erstellen eines neuen Benutzers.</p>

</dd>
<dt>L&#246;schen</dt>
<dd><p>Schaltfl&#228;che zum L&#246;schen eines oder mehrerer ausgew&#228;hlter Benutzer.</p>

</dd>
</dl>
<a name="gkool"></a><h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-fileuserscreate.html">So f&#252;gen Sie einen Benutzer f&#252;r den Dateibereich hinzu</a></p>

</li>
<li><p><a href="task-fileusersedit.html">So bearbeiten Sie Informationen zu Dateibereichsbenutzern</a></p>

</li>
<li><p><a href="task-fileusersdelete.html">So l&#246;schen Sie einen Benutzer aus dem Dateibereich</a></p>

</li></ul>
<a name="gkonn"></a><h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-file-users-1"><tt>list-file-users</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-file-user-1"><tt>create-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-file-user-1"><tt>update-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-file-user-1"><tt>delete-file-user</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
