<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmpathsettings"></a><h4>JVM-Pfadeinstellungen</h4>
<a name="indexterm-192"></a><p>Konfigurieren Sie auf der Seite "JVM-Pfadeinstellungen" den Pfad f&#252;r die native Bibliothek. Der
Pfad zur nativen Bibliothek ist eine Verkettung folgender Pfade:</p>


<ul><li><p>Das Pr&#228;fix f&#252;r den Pfad der nativen Bibliothek</p>

</li>
<li><p>Der Serverpfad f&#252;r die nativen Bibliotheken (d. h. <tt></tt><i>as-install</i><tt>/lib</tt>)</p>

</li>
<li><p>Die 64-Bit-Verzeichnisse der nativen Bibliotheken (falls zutreffend)</p>

</li>
<li><p>Der Wert der Variablen <tt>java.library.path</tt> f&#252;r die JVM, die zum Starten von GlassFish-Server verwendet wird(je nach Betriebssystem verschieden)</p>

</li>
<li><p>Alle Pfade, die auf der Seite <a href="ref-serverinstjvmprofiler.html">JVM-Profiler-Einstellungen</a> angegeben sind, wenn der Profiler aktiviert ist</p>

</li>
<li><p>Das Suffix f&#252;r den Pfad der nativen Bibliothek</p>

</li></ul>
<p>Andere Einstellungen werden f&#252;r Domains, die von einer &#228;lteren Version von GlassFish-Server
aktualisiert wurden, als schreibgesch&#252;tzte Werte angezeigt. Sie werden in der Version v3
nicht unterst&#252;tzt.</p>

<p>Die Seite "JVM-Pfadeinstellungen" umfasst die folgenden Optionen.</p>

<dl><dt>Name der Konfiguration</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Environment Classpath (Umgebungsklassenpfad)</dt>
<dd><p>Wenn Sie das Kontrollk&#228;stchen Ignore (Ignorieren) aktivieren, wird die Umgebungsvariable <tt>CLASSPATH</tt> ignoriert. Die Umgebungsvariable <tt>CLASSPATH</tt> ist f&#252;r grundlegende Lernprogramme in der Programmierung geeignet, wird f&#252;r Unternehmensumgebungen jedoch nicht empfohlen. Dies ist ein schreibgesch&#252;tztes Feld.</p>

</dd>
<dt>System Classpath (Systemklassenpfad)</dt>
<dd><p>Der Pfad zu den Klassen auf Ihrem Computer. Dies ist ein schreibgesch&#252;tztes Feld.</p>

</dd>
<dt>Classpath Prefix (Klassenpfadpr&#228;fix)</dt>
<dd><p>Vollst&#228;ndige Pfade zu den JAR-Dateien, die dem Klassenpfad des Servers - jeweils einer pro Zeile - vorangestellt werden m&#252;ssen. Dies ist ein schreibgesch&#252;tztes Feld.</p>

</dd>
<dt>Classpath Suffix (Klassenpfadsuffix)</dt>
<dd><p>Vollst&#228;ndige Pfade zu den JAR-Dateien, die an den Klassenpfad - jeweils einer pro Zeile - angeh&#228;ngt werden m&#252;ssen. Dies ist ein schreibgesch&#252;tztes Feld.</p>

</dd>
<dt>Native Library Path Prefix (Pr&#228;fix f&#252;r Pfad zur nativen Bibliothek)</dt>
<dd><p>Vollst&#228;ndige Pfade zu den JAR-Dateien, die dem Pfad zur nativen Bibliothek - jeweils einer pro Zeile - vorangestellt werden m&#252;ssen.</p>

</dd>
<dt>Native Library Path Suffix (Suffix f&#252;r Pfad zur nativen Bibliothek)</dt>
<dd><p>Vollst&#228;ndige Pfade zu den JAR-Dateien, die an den Pfad zur nativen Bibliothek - jeweils einer pro Zeile - angeh&#228;ngt werden m&#252;ssen.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-jvmsettings.html">So konfigurieren Sie die allgemeinen JVM-Einstellungen</a></p>

</li>
<li><p><a href="task-jvmpathsettings.html">So konfigurieren Sie die JVM-Pfadeinstellungen</a></p>

</li>
<li><p><a href="task-jvmoptions.html">So konfigurieren Sie die JVM-Optionen</a></p>

</li>
<li><p><a href="task-securitymanagerdisable.html">So deaktivieren Sie den Sicherheitsmanager</a></p>

</li>
<li><p><a href="task-jvmprofilersettings.html">So konfigurieren Sie die JVM-Profilereinstellungen </a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jvm-options-1"><tt>create-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jvm-options-1"><tt>delete-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jvm-options-1"><tt>list-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-profiler-1"><tt>create-profiler</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-profiler-1"><tt>delete-profiler</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
