<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-eelogging"></a><h4>So konfigurieren Sie allgemeine Protokollierungseinstellungen</h4><a name="indexterm-67"></a><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Knoten "Konfigurationen".</b></li>
<li><b>Klicken Sie unter dem Knoten "Konfigurationen" auf die Serverinstanz oder die Cluster-Konfiguration,
f&#252;r die Sie Einstellungen der Protokollfunktion konfigurieren m&#246;chten.</b><p>Die Seite "Konfiguration" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Konfiguration" auf "Einstellungen Protokollfunktion".</b><p>Die Seite "Einstellungen Protokollfunktion" f&#252;r das ausgew&#228;hlte Konfigurationsziel wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "In Systemprotokoll schreiben aktiviert", um den Protokolloutput zus&#228;tzlich
zum Serverprotokoll an die <tt>syslog</tt>-Facility zu senden.</b><p>Diese Funktion ist ausschlie&#223;lich unter den Betriebssystemen Solaris und Linux verf&#252;gbar. Diese
Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Geben Sie im Feld "Protokolldatei" einen alternativen Namen oder Ort f&#252;r die
Serverprotokolldatei ein.</b><p>Der Standardspeicherort ist <tt>${com.sun.aas.instanceRoot}/logs/server.log </tt>.</p></li>
<li><b>Geben Sie im Feld "Protokoll-Handler" den absoluten Klassennamen eines benutzerdefinierten Protokoll-Handlers ein.</b><p>Ein benutzerdefinierter Protokoll-Handler erm&#246;glicht es Ihnen, Protokolle an einen Empf&#228;nger zu senden,
der von <tt>server.log </tt> oder <tt>syslog</tt> verschieden ist. Der benutzerdefinierte Handler muss die
Klasse <tt>java.util.logging.ConsoleHandler</tt> erweitern (eine JSR 047-kompatible API). Platzieren Sie die Handler-Klasse im
Klassenpfad von GlassFish-Server, damit der Handler beim Serversetup installiert wird.</p></li>
<li><b>Geben Sie im Feld "Dateirotationsgrenzwert" die Gr&#246;&#223;e in Bytes ein, die die
Serverprotokolldatei erreichen muss, bevor sie rotiert wird.</b><p>Wenn das Serverprotokoll die in Byte angegebene Gr&#246;&#223;e erreicht, wird eine neue,
leere Datei mit Namen <tt>server.log</tt> erstellt. Die alte Datei wird in <tt>server.log_</tt><i>Datum</i>
umbenannt, wobei <i> date</i> das Datum und die Uhrzeit der Rotation angibt. Der
Standardwert betr&#228;gt 2 MB. Der Mindestwert f&#252;r diese Einstellung betr&#228;gt 500 KB;
wenn Sie einen niedrigeren Wert einstellen, findet die Dateirotation statt, wenn die
Protokolldatei eine Gr&#246;&#223;e von 500 KB erreicht. Zur Deaktivierung der Protokolldateirotation setzen
Sie den Wert auf 0.</p></li>
<li><b>Geben Sie im Feld "Dateirotations-Zeitlimit" die Anzahl der Minuten ein, nach denen
das Serverprotokoll rotiert werden muss.</b><p>Der Standardwert lautet 0, d. h.: Die Dateirotation wird auf Grundlage der
im Feld "Begrenzung f&#252;r Dateirotation" angegebenen Dateigr&#246;&#223;e durchgef&#252;hrt.</p>
<hr><p><b>Hinweis - </b>Wenn Sie eine oder mehrere Minuten festlegen, hat das Zeitlimit Vorrang vor
dem Gr&#246;&#223;enlimit, das im Feld Dateirotationslimit festgelegt wurde.</p>


<hr>
</li>
<li><b>Geben Sie im Feld "Leerungsh&#228;ufigkeit" die maximale Anzahl von Meldungen ein, die
gleichzeitig aus der Warteschlange in das Serverprotokoll geschrieben werden k&#246;nnen.</b><p>Der Standardwert betr&#228;gt 1. </p></li>
<li><b>Klicken Sie auf "Speichern".</b>
<hr><p><b>Hinweis - </b>Je nach der Konfiguration, f&#252;r die die Protokollierung aktiviert wurde, kann einer
Serverneustart erforderlich sein.</p>

<p>Auch kann ein Serverneustart erforderlich sein, wenn der standardm&#228;&#223;ige Name der Protokolldatei
ge&#228;ndert wurde. Die Meldung <tt>Restart required</tt> (Neustart erforderlich) wird in der oberen rechten
Ecke der Administration Console angezeigt, wenn der Server neu gestartet werden muss.</p>


<hr>
</li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-eelogginglevels.html">So konfigurieren Sie Protokollebenen</a></p>

</li>
<li><p><a href="task-logging-max-logfiles.html">So &#228;ndern Sie die maximale Anzahl der rotierenden Protokolldateien</a></p>

</li>
<li><p><a href="task-logviewer.html">So zeigen Sie Protokolldateien f&#252;r den DAS an</a></p>

</li>
<li><p><a href="task-logging-collectlogfiles.html">So erstellen Sie ein ZIP-Archiv f&#252;r alle Protokolldateien</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
