<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployclient"></a><h3>So stellen Sie einen Anwendungs-Client bereit</h3><a name="indexterm-35"></a><a name="indexterm-36"></a><a name="indexterm-37"></a><ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Anwendungsknoten.</b><p>Die Seite "Anwendungen" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie in der Tabelle "Bereitgestellte Anwendungen" auf die Schaltfl&#228;che "Bereitstellen".</b><p>Die Seite "Anwendungen oder Module bereitstellen" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie den Speicherort der bereitzustellenden Anwendung an.</b><ul>
<li><b>Wenn es sich bei der Anwendung um eine Archivdatei handelt, die auf
dem Clientcomputer gespeichert oder &#252;ber diesen zug&#228;nglich ist, w&#228;hlen Sie die Option
"Gepackte Datei zum Hochladen auf den Server" aus.</b><p>Der Clientcomputer ist der Host, auf dem Sie die Administration Console &#252;ber
einen Browser anzeigen.</p><p>Klicken Sie auf "Durchsuchen", um nach der Datei zu suchen, oder geben
Sie den vollst&#228;ndigen Pfad zu der Datei ein.</p></li>
<li><b>Wenn es sich bei der Anwendung um eine Archivdatei handelt, die auf
dem Servercomputer gespeichert ist, oder um eine nicht gepackte Anwendung aus einem
aufgel&#246;sten Verzeichnis, w&#228;hlen Sie die Option "Lokale gepackte Datei oder Verzeichnis, auf
die/das von GlassFish-Server aus zugegriffen werden kann".</b><p>Der Serverrechner ist der Host, der den Domain Administration Server (DAS) ausf&#252;hrt.
</p><p>Klicken auf "Dateien durchsuchen", um zu einer Datei zu gelangen, oder auf
"Ordner durchsuchen", um zu einem Verzeichnis zu gelangen. Alternativ k&#246;nnen Sie auch
den Namen des vollst&#228;ndigen Pfads zur Datei oder zum Verzeichnis eingeben. Die
Bereitstellung aus einem erweiterten Verzeichnis ist f&#252;r erfahrene Entwickler vorgesehen und wird
f&#252;r Produktionsumgebungen nicht empfohlen.</p></li></ul></li>
<li><b>W&#228;hlen Sie "Anwendungs-Client" aus der Dropdown-Liste "Typ".</b><p>Wenn Sie entweder eine gepackte Datei angegeben haben, die auf den Server
hochgeladen werden soll, oder eine lokale gepackte Datei, die vom GlassFish-Server aus
zug&#228;nglich ist, wird der Anwendungstyp automatisch erkannt. Wenn Sie ein Verzeichnis festgelegt
haben, auf das der Zugriff von GlassFish-Server aus m&#246;glich ist, m&#252;ssen Sie
den Typ manuell festlegen.</p></li>
<li><b>Im Feld "Anwendungsname" k&#246;nnen Sie den Standardnamen (der Verzeichnisname oder das Pr&#228;fix
des Dateinamens) beibehalten oder einen anderen Namen eingeben.  </b><p>Der Standardname wird angezeigt, wenn Sie eine Datei f&#252;r den Upload ausw&#228;hlen.
Der Anwendungsname muss eindeutig sein.</p><p>Der Name kann eine optionale Versionskennung enthalten, die dem Namen folgt und
von diesem durch einen Doppelpunkt (<tt>:</tt>) getrennt ist. Die Versionskennung muss mit
einem Buchstaben oder einer Zahl beginnen. Sie kann alphanumerische Zeichen sowie Unterstriche
(<tt>_</tt>), Bindestriche (<tt>-</tt>) und Punkte (<tt>.</tt>) enthalten. Weitere Informationen zu Modul- und
Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions in <i>Oracle GlassFish Server 3.1 Application Deployment Guide </i></a>.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen Java Web Start, um den Zugang zu Java
Web Start f&#252;r ein Anwendungs-Client-Modul zu aktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Verifier ausf&#252;hren", um die Bereitstellungs-Deskriptoren vor der Bereitstellung
zu verifizieren.</b><p>Wenn die &#220;berpr&#252;fung bei Auswahl dieser Option fehlschl&#228;gt, findet keine Bereitstellung statt.
Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Bereitstellungs-Deskriptoren. Die &#220;berpr&#252;fung von gro&#223;en
Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p><p>Verifier-Pakete m&#252;ssen mithilfe des Aktualisierungstools installiert werden. Anderenfalls wird eine Warnung protokolliert
und diese Option wird ignoriert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen Erneute Bereitstellung erzwingen, um die erneute Bereitstellung zu
erzwingen, wenn die Anwendung bereits bereitgestellt ist.</b><p>Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung
bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Geben Sie im Feld "Beschreibung" eine Beschreibung dieser Anwendung ein.</b></li>
<li><b>Um Zielserverinstanzen und Cluster hinzuzuf&#252;gen, auf denen das Modul oder die Anwendung
bereitgestellt werden soll, w&#228;hlen Sie Zielserverinstanzen oder Cluster aus der Liste "Verf&#252;gbare
Ziele" aus und verwenden die Schaltfl&#228;che "Hinzuf&#252;gen", um sie in die Liste
"Ausgew&#228;hlte Ziele" zu verschieben.</b><p>Die Option "Ziel" wird angezeigt, wenn neben der standardm&#228;&#223;igen Serverinstanz (<tt>server</tt>) Cluster
oder eigenst&#228;ndige Serverinstanzen vorhanden sind. Das Modul oder die Anwendung wird standardm&#228;&#223;ig
f&#252;r die standardm&#228;&#223;ige Serverinstanz <tt>server</tt> bereitgestellt. Verwenden Sie die Schaltfl&#228;che "Alle hinzuf&#252;gen",
um die Bereitstellung f&#252;r alle Ziele durchzuf&#252;hren. Verwenden Sie die Schaltfl&#228;chen "Entfernen"
und "Alle entfernen", um Ziele aus der Liste "Ausgew&#228;hlte Ziele" zu entfernen.</p></li>
<li><b>Klicken Sie auf "OK".</b></li></ol><p></b>Siehe auch</b></p>
<ul><li><p><a href="task-applistdeployed.html">So zeigen Sie eine Liste eingesetzter Anwendungen an</a></p>

</li>
<li><p><a href="task-appdeployweb.html">So stellen Sie eine Webanwendung bereit</a></p>

</li>
<li><p><a href="task-deployentapp.html">So stellen Sie eine Unternehmensanwendung bereit</a></p>

</li>
<li><p><a href="task-appdeployconn.html">So stellen Sie ein Verbindungsmodul bereit</a></p>

</li>
<li><p><a href="task-appdeployejb.html">So stellen Sie ein EJB Jar bereit</a></p>

</li>
<li><p><a href="task-appedit.html">So bearbeiten Sie eine bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-appviewdesc.html">So zeigen Sie die Beschreibung einer Anwendung an</a></p>

</li>
<li><p><a href="task-endpoint.html">So zeigen Sie Endpunkt-Informationen f&#252;r einen Webdienst an</a></p>

</li>
<li><p><a href="task-applaunch.html">So starten Sie eine Anwendung</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">So starten Sie einen Anwendungs-Client</a></p>

</li>
<li><p><a href="task-appredeploy.html">Eine bereitgestellte Anwendung erneut bereitstellen</a></p>

</li>
<li><p><a href="task-apprestart.html">So laden Sie eine bereitgestellte Anwendung erneut</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
