<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-confmonitor"></a><h4>So konfigurieren Sie den &#220;berwachungsdienst</h4><a name="indexterm-119"></a><ol>
<li><b>Erweitern Sie unter dem Knoten "Konfigurationen" die Serverinstanz oder die Cluster-Konfiguration, f&#252;r
die Sie die &#220;berwachung konfigurieren m&#246;chten.</b></li>
<li><b>Erweitern Sie den Knoten "&#220;berwachung".</b><p>Die Seite "&#220;berwachungsdienst" wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "&#220;berwachungsdienst", um die &#220;berwachung f&#252;r GlassFish-Server zu aktivieren,
oder deaktivieren Sie das Kontrollk&#228;stchen, um die &#220;berwachung zu deaktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "&#220;berwachungs-MBeans", um alle f&#252;r die &#220;berwachung ben&#246;tigten MBeans
bereitzustellen; deaktivieren Sie das Kontrollk&#228;stchen, wenn die MBeans nicht bereitgestellt werden sollen.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert.</p><p>Wenn das Kontrollk&#228;stchen nicht aktiviert ist, k&#246;nnen Sie keine &#220;berwachungsdaten in der
Administration Console anzeigen, auch dann nicht, wenn das Kontrollk&#228;stchen "&#220;berwachungsdienst" aktiviert ist. 
Sie m&#252;ssen die &#220;berwachungsdaten stattdessen &#252;ber die Befehlszeile aufrufen. Wenn Sie die
Auswahl des Kontrollk&#228;stchens aufheben, wird in GlassFish-Server weniger Speicher belegt.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;schen "DTrace", um die Verwendung der Solaris DTrace-Funktion zu
erm&#246;glichen.</b><p>Zur Verwendung der Solaris DTrace-Funktion ist au&#223;erdem Oracle Enterprise Manager DTrace-&#220;berwachung erforderlich. Diese
Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>F&#252;hren Sie in der Tabelle eine der folgenden Aktionen durch.</b><ul>
<li><b>W&#228;hlen Sie in der Spalte "&#220;berwachungsebene" LOW oder HIGH aus der Dropdown-Liste
f&#252;r mindestens eine Komponente in der Spalte Komponente aus, um die &#220;berwachung
f&#252;r diese Komponenten zu aktivieren.</b></li>
<li><b>Aktivieren Sie die Kontrollk&#228;stchen neben mindestens einer Komponente, w&#228;hlen Sie anschlie&#223;end LOW
oder HIGH aus der Dropdown-Liste oben in der Tabelle aus und klicken
Sie auf die Schaltfl&#228;che "Ebene &#228;ndern", um die &#220;berwachungsebene f&#252;r alle diese
Komponenten auf diesen Wert einzustellen.</b></li></ul><p>In dieser Version besteht kein Unterschied zwischen den &#220;berwachungsebenen der Optionen "NIEDRIG"
und "HOCH". Um die &#220;berwachung f&#252;r mindestens eine Komponente zu deaktivieren, w&#228;hlen
Sie OFF aus. Der Standardwert ist "AUS".</p><p>Sie m&#252;ssen eine Anwendung, eine Komponente oder einen Dienst bereitstellen, bevor Sie
die &#220;berwachung hierf&#252;r konfigurieren k&#246;nnen.</p></li>
<li><b>Klicken Sie auf "Speichern".</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-appmonitoringdata.html">So zeigen Sie &#220;berwachungsdaten der Anwendung an</a></p>

</li>
<li><p><a href="task-servermonitoringdata.html">So zeigen Sie die Server-&#220;berwachungsdaten an</a></p>

</li>
<li><p><a href="task-resourcemonitoringdata.html">So zeigen Sie Ressourcen-&#220;berwachungsdaten an</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
