<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jndiexternalresourcecreate"></a><h3>Cr&#233;ation d&#8217;une ressource JNDI externe</h3><a name="indexterm-14"></a><a name="indexterm-15"></a><a name="indexterm-16"></a><p>Une ressource JNDI externe acc&#232;de &#224; un r&#233;f&#233;rentiel JNDI externe, tel un
serveur LDAP.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le n&#339;ud Ressources, d&#233;veloppez le n&#339;ud JNDI.</b></li>
<li><b>Sous le n&#339;ud JNDI, s&#233;lectionnez Ressources externes.</b><p>La page Ressources externes s&#8217;affiche.</p></li>
<li><b>Cliquez sur le bouton Nouveau de la page Ressources externes.</b><p>La page Nouvelle ressource externe s&#8217;affiche.</p></li>
<li><b>Dans le champ Nom JNDI, entrez un nom unique.</b><p>Il sera enregistr&#233; dans le service de nommage JNDI. Le nom JNDI
organise et recherche des composants dans un environnement informatique distribu&#233; de la
m&#234;me mani&#232;re que des catalogues sur fiches organisent et repr&#233;sentent des emplacements
de livres dans une biblioth&#232;que. Par cons&#233;quent, le nom JNDI devient une
m&#233;thode importante d&#8217;acc&#232;s &#224; la ressource</p></li>
<li><b>Dans le champ Type de ressource, effectuez l&#8217;une des op&#233;rations suivantes.</b><ul>
<li><b>S&#233;lectionnez une d&#233;finition de type dans la liste d&#233;roulante.</b></li>
<li><b>S&#233;lectionnez le deuxi&#232;me bouton radio et entrez une d&#233;finition compl&#232;te de type au
format suivant&#160;: <tt><i>xxx</i>.<i>xxx</i></tt>. </b></li></ul></li>
<li><b>Dans le champ Classe de fabrique, entrez un nom de r&#233;f&#233;rentiel externe
de classe de fabrique JNDI pour la ressource externe &#224; cr&#233;er.</b><p>La classe de fabrique est un nom sp&#233;cifi&#233; par l&#8217;utilisateur pour la
classe de fabrique, tel que <tt>com.sun.jndi.ldap</tt>. Cette classe impl&#233;mente l&#8217;interface <tt>javax.naming.spi.InitialContextFactory</tt>.</p></li>
<li><b>Dans le champ Recherche JNDI, entrez la valeur JNDI &#224; rechercher dans
le r&#233;f&#233;rentiel externe.</b><p>Par exemple, si vous cr&#233;ez une ressource externe pour vous connecter &#224;
un r&#233;f&#233;rentiel externe, pour tester une classe bean, la recherche JNDI peut
prendre la forme suivante : <tt>cn=<i>testbean</i></tt>.</p></li>
<li><b>Dans le champ Description, entrez une br&#232;ve description de la ressource.</b><p>Cette description doit se pr&#233;senter sous la forme d&#8217;une cha&#238;ne pouvant inclure
un maximum de 250 caract&#232;res.</p></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer la ressource.</b><p>Par d&#233;faut, la ressource est activ&#233;e, ce qui signifie qu&#8217;elle est disponible
d&#232;s sa cr&#233;ation.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s de la ressource
externe.</b><p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les ressources externes.</p><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-jndicustomresourcenew.html">Cr&#233;ation d'une ressource personnalis&#233;e</a></p>

</li>
<li><p><a href="task-jndicustomresourceedit.html">Modification d'une ressource JNDI personnalis&#233;e</a></p>

</li>
<li><p><a href="task-jndicustomresourcedelete.html">Suppression d'une ressource JNDI personnalis&#233;e</a></p>

</li>
<li><p><a href="task-jndiexternalresourceedit.html">Modification d'une ressource JNDI externe</a></p>

</li>
<li><p><a href="task-jndiexternalresourcedelete.html">Suppression une ressource JNDI externe</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
