<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-javamailsessionsedit"></a><h3>Modification d&#8217;une session JavaMail</h3><a name="indexterm-2"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le n&#339;ud Ressources, s&#233;lectionnez Sessions JavaMail.</b><p>La page Sessions JavaMail s&#8217;affiche.</p></li>
<li><b>Sur la page Sessions JavaMail, cliquez sur le nom de session &#224;
modifier.</b><p>La page Modification d&#8217;une session JavaMail s&#8217;affiche.</p></li>
<li><b>Dans le champ H&#244;te de messagerie, sp&#233;cifiez le nom d&#8217;h&#244;te du serveur
de messagerie par d&#233;faut.</b><p>Les m&#233;thodes de connexion des objets Stockage et Transport utilisent cette valeur
si aucune propri&#233;t&#233; d&#8217;h&#244;te sp&#233;cifique &#224; un protocole n&#8217;est fournie. Le nom
doit refl&#233;ter un nom d&#8217;h&#244;te r&#233;el.</p></li>
<li><b>Dans le champ Utilisateur par d&#233;faut, entrez un autre nom d&#8217;utilisateur &#224;
fournir lors de la connexion &#224; un serveur de messagerie.</b><p>Les m&#233;thodes de connexion des objets Stockage et Transport utilisent cette valeur
si aucune propri&#233;t&#233; de nom d&#8217;utilisateur sp&#233;cifique &#224; un protocole n&#8217;est fournie.
Le nom d&#8217;utilisateur ne peut contenir que des caract&#232;res alphanum&#233;riques, des traits
de soulignement, des tirets ou des points.</p></li>
<li><b>Dans le champ Adresse de l'exp&#233;diteur par d&#233;faut, entrez l'adresse e-mail de
l'utilisateur par d&#233;faut.</b><p>Le format est <i>nom d&#8217;utilisateur</i><tt>@</tt><i>h&#244;te</i>.<i>domaine</i>.</p></li>
<li><b>Dans le champ Description, modifiez la description de la session de messagerie.</b></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer la session de messagerie.</b><p>La valeur par d&#233;faut est Activ&#233;e.</p></li>
<li><b>Dans le champ Protocole de stockage, indiquez la m&#233;thode de communication des
objets de stockage &#224; utiliser.</b><p>Par d&#233;faut, le protocole de stockage est <tt>imap</tt>.</p></li>
<li><b>Dans le champ Classe de protocole de stockage, sp&#233;cifiez la classe de
la m&#233;thode de communication de stockage impl&#233;mentant le protocole de stockage requis.</b><p>Par d&#233;faut, la classe de protocole de stockage est <tt>com.sun.mail.imap.IMAPStore</tt>.</p></li>
<li><b>Dans le champ Protocole de transport, sp&#233;cifiez la m&#233;thode de communication de
transport.</b><p>Par d&#233;faut, le protocole de transport est <tt>smtp</tt>.</p></li>
<li><b>Dans le champ Classe de protocole de transport, sp&#233;cifiez la m&#233;thode de
communication de la classe de transport.</b><p>Par d&#233;faut, la classe de protocole de transport est <tt>com.sun.mail.smtp.SMTPTransport </tt>.</p></li>
<li><b>Cochez la case D&#233;boguer pour activer une sortie de d&#233;bogage suppl&#233;mentaire, notamment
un suivi de protocole, pour cette session de messagerie.</b><p>Si le niveau de journal JavaMail est d&#233;fini sur <tt>FIN</tt> ou plus
fin, la sortie de d&#233;bogage est cr&#233;&#233;e et incluse dans le fichier
journal du syst&#232;me. Pour plus d&#8217;informations sur la configuration du niveau de
journal, reportez-vous &#224; la section <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3029&id=task-eelogginglevels">Configurer les niveaux de journal</a>.</p></li>
<li>(Facultatif) <b>Dans le tableau Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s requises par les
applications, notamment une propri&#233;t&#233; d&#8217;h&#244;te ou de nom d&#8217;utilisateur sp&#233;cifique &#224; un
protocole.</b><p>Pour une liste des propri&#233;t&#233;s disponibles, consultez <a href="http://java.sun.com/products/javamail/javadocs/index.html">la documentation de l&#8217;API JavaMail</a>. Les propri&#233;t&#233;s suppl&#233;mentaires doivent
commencer par <tt>mail-</tt> et  des traits d&#8217;union doivent &#234;tre utilis&#233;s comme s&#233;parateurs
&#224; la place de points. Par exemple, <tt>mail-debug</tt> est correct mais <tt>mail.debug</tt>
ne l&#8217;est pas. L&#8217;arri&#232;re-plan de GlassFish Server convertit les traits d&#8217;union en
points attendus par l&#8217;API JavaMail. </p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-javamailsessioncreate.html">Pour cr&#233;er une session JavaMail</a></p>

</li>
<li><p><a href="task-javamailsessionsdelete.html">Suppression d'une session JavaMail</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
