<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmshostedit"></a><h4>Editar host do JMS</h4>
<a name="indexterm-48"></a><p>Utilize a p&#225;gina Editar host do JMS para modificar as configura&#231;&#245;es de
um host do JMS.</p>

<p>A p&#225;gina Editar host do JMS cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Carregar padr&#227;o</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome da configura&#231;&#227;o</dt>
<dd><p>Nome da configura&#231;&#227;o ao qual as configura&#231;&#245;es desta p&#225;gina ser&#227;o enviadas. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Nome</dt>
<dd><p>O nome do host. O campo Nome &#233; de somente leitura. Voc&#234; pode especificar somente o campo Nome ao criar um novo host do JMS.</p>

</dd>
<dt>Host</dt>
<dd><p>O nome ou o endere&#231;o do Protocolo Internet (IP) do sistema em que o host do JMS executar&#225; (<tt>localhost</tt> ou o nome do sistema local ou remoto).</p>

</dd>
<dt>Porta</dt>
<dd><p>O n&#250;mero da porta do servi&#231;o JMS. Altere esse campo somente se o servi&#231;o JMS a ser utilizado estiver sendo executado em uma porta n&#227;o padr&#227;o. A porta padr&#227;o &#233; 7676.</p>

</dd>
<dt>Nome de usu&#225;rio e senha Admin</dt>
<dd><p>O nome de usu&#225;rio e a senha do broker da Fila de mensagens. S&#227;o diferentes do nome de usu&#225;rio e da senha do Servidor GlassFish. Edite esses campos somente se os valores do broker da Fila de mensagens foram alterados com o comando <tt><i>as-install-parent</i>/mq/bin/imqusermgr</tt>. Os valores padr&#227;o s&#227;o <tt>admin</tt> e <tt>admin</tt>.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jmsservice.html">Para configurar o servi&#231;o JMS</a></p>

</li>
<li><p><a href="task-jmshostnew.html">Para criar um host do JMS</a></p>

</li>
<li><p><a href="task-jmshostedit.html">Para editar um host do JMS</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">Para excluir um host do JMS</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jms-host-1"><tt>create-jms-host</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jms-hosts-1"><tt>list-jms-hosts</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jms-host-1"><tt>delete-jms-host</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=jms-ping-1"><tt>jms-ping</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
