<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsphysicaldestnew"></a><h4>Novo destino f&#237;sico do JMS</h4>
<a name="indexterm-51"></a><a name="indexterm-52"></a><p>Utilize a p&#225;gina Novo destino f&#237;sico do JMS para criar um novo
destino f&#237;sico do JMS.</p>

<p>Normalmente n&#227;o &#233; preciso criar destinos f&#237;sicos, porque voc&#234; especifica um nome
de destino f&#237;sico quando cria um recurso de destino do JMS e
o Servidor GlassFish cria o destino f&#237;sico automaticamente quando &#233; necess&#225;rio.</p>

<p>A p&#225;gina Novo destino f&#237;sico do JMS cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Nome</dt>
<dd><p>O nome do destino f&#237;sico.</p>

</dd>
<dt>Tipo</dt>
<dd><p>O tipo do destino f&#237;sico. As escolhas dispon&#237;veis s&#227;o <tt>javax.jms.Topic</tt> e <tt>javax.jms.Queue</tt>.</p>

</dd>
<dt>N&#250;mero m&#225;ximo de mensagens n&#227;o consumidas</dt>
<dd><p>O n&#250;mero m&#225;ximo de mensagens n&#227;o consumidas permitido para o destino. Um valor de &#8211;1 indica que n&#227;o h&#225; limite para o n&#250;mero de mensagens n&#227;o consumidas. O valor padr&#227;o &#233; -1.</p>

</dd>
<dt>Tamanho m&#225;ximo de mensagem</dt>
<dd><p>O tamanho m&#225;ximo, em bytes, de uma &#250;nica mensagem. Um valor de &#8211;1 denota um tamanho de mensagem sem limite. O valor padr&#227;o &#233; -1.</p>

</dd>
<dt>Total m&#225;ximo de mem&#243;ria</dt>
<dd><p>O total m&#225;ximo de mem&#243;ria, em bytes, para mensagens n&#227;o consumidas. Um valor de &#8211;1 indica que n&#227;o h&#225; limite para o tamanho de mem&#243;ria para mensagens n&#227;o consumidas. O valor padr&#227;o &#233; -1.</p>

</dd>
<dt>Comportamento do limite limiar</dt>
<dd><p>O comportamento que o broker deve seguir quando o limiar do limite de mem&#243;ria &#233; atingido. As op&#231;&#245;es dispon&#237;veis s&#227;o:</p>

<dl><dt><tt>Rejeitar mensagens mais recentes </tt></dt>
<dd><p>Rejeita as mensagens mais recentes e notifica o cliente de produ&#231;&#227;o com uma exce&#231;&#227;o somente se a mensagem &#233; persistente. Esse &#233; o valor padr&#227;o.</p>

</dd>
<dt><tt>Diminuir a taxa de produtores</tt></dt>
<dd><p>Diminui a taxa com que produtores de mensagem enviam mensagens.</p>

</dd>
<dt><tt>Rejeitar mais antiga</tt></dt>
<dd><p>Descarta as mensagens mais antigas.</p>

</dd>
<dt><tt>Rejeitar mensagens de prioridade mais baixa</tt></dt>
<dd><p>Descarta as mensagens com a prioridade mais baixa.</p>

</dd>
</dl>
<p>Se o valor for <tt>Rejeitar mais antiga</tt> ou <tt>Rejeitar mensagens de prioridade mais baixa</tt>, e Utilizar a Fila de mensagens inativas estiver definido como verdadeiro, mensagens em excesso s&#227;o movidas para a Fila de mensagens inativas.</p>

</dd>
<dt>N&#250;mero m&#225;ximo de produtores</dt>
<dd><p>O n&#250;mero m&#225;ximo de produtores de mensagens que pode ser associado a este destino f&#237;sico. Quando esse limite &#233; atingido, nenhum novo produtor pode ser criado. Um valor de &#8211;1 denota um n&#250;mero ilimitado de produtores. O valor padr&#227;o &#233; 100.</p>

</dd>
<dt>Contagem de mensagens m&#225;x. da entrega em lotes</dt>
<dd><p>O n&#250;mero m&#225;ximo de mensagens que podem ser entregues para consumidores em um &#250;nico lote. Um valor de &#8211;1 denota um n&#250;mero ilimitado de mensagens. O valor padr&#227;o &#233; 1000.</p>

</dd>
<dt>Utilizar a Fila de mensagens inativas</dt>
<dd><p>Se o valor for definido como Verdadeiro, mensagens inativas s&#227;o colocadas na fila de mensagens inativas. Se o valor for definido como Falso, mensagens inativas s&#227;o descartadas. Por padr&#227;o, essa op&#231;&#227;o &#233; definida como Verdadeiro.</p>

</dd>
<dt>Validar esquema XML</dt>
<dd><p>Se o valor for definido como Verdadeiro, o tempo de execu&#231;&#227;o do cliente da Fila de mensagens tentar&#225; validar uma mensagem XML contra as Defini&#231;&#245;es de esquema XML especificadas (ou contra o DTD, se nenhuma XSD estiver especificado) antes de envi&#225;-la para o broker. Se o esquema especificado n&#227;o pode ser localizado ou a mensagem n&#227;o pode ser validada, a mensagem n&#227;o &#233; enviada e uma exce&#231;&#227;o &#233; lan&#231;ada. Por padr&#227;o, essa op&#231;&#227;o &#233; definida como Falso.</p>

</dd>
<dt>Lista de URIs de esquema XML</dt>
<dd><p>Uma lista separada por v&#237;rgulas de sequ&#234;ncias de URI de defini&#231;&#227;o de esquema XML (XSD) URI. Se a valida&#231;&#227;o de esquema XML estiver ativada, as URIs apontam para o local de uma ou mais XSDs a serem usadas para a valida&#231;&#227;o do esquema XML.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jmsservice.html">Para configurar o servi&#231;o JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestnew.html">Para criar um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestedit.html">Para editar um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestdelete.html">Para excluir um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsflushmessages.html">Para remover mensagens de um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldeststats.html">Para visualizar estat&#237;sticas de um destino f&#237;sico do JMS</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jmsdest-1"><tt>create-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jmsdest-1"><tt>list-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jmsdest-1"><tt>delete-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=flush-jmsdest-1"><tt>flush-jmsdest</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=jms-ping-1"><tt>jms-ping</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
