<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a><a id="GHJMS00009" name="GHJMS00009"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>Disponibilidade do JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina de Disponibilidade do JMS para configurar defini&ccedil;&otilde;es de disponibilidade para o Java Message Service (JMS).</p>
<p>A p&aacute;gina de Disponibilidade do JMS cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar com os valores default as defini&ccedil;&otilde;es que apresentam valores default. As defini&ccedil;&otilde;es que n&atilde;o apresentam valores default n&atilde;o s&atilde;o alteradas.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Servi&ccedil;o de Disponibilidade</dt>
<dd>
<p>O tipo de cluster do Message Queue usado para oferecer servi&ccedil;os JMS a um cluster do GlassFish. Se a caixa de sele&ccedil;&atilde;o Ativado for marcada, um cluster Message Queue ser&aacute; utilizado. Caso contr&aacute;rio, um cluster Message Queue ser&aacute; utilizado.</p>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado for marcada, as op&ccedil;&otilde;es Tipo de Armazenamento de Configura&ccedil;&otilde;es e Tipo de Armazenamento de Mensagens ser&atilde;o ignoradas.</p>
</dd>
<dt>Tipo de Armazenamento de Configura&ccedil;&otilde;es</dt>
<dd>
<p>O tipo de armazenamento de dados para dados de configura&ccedil;&atilde;o em um cluster Message Queue convencional. O valor <code>masterbroker</code> especifica o uso de um broker master para armazenar e gerenciar os dados da configura&ccedil;&atilde;o. O valor <code>shareddb</code> especifica o uso de um banco de dados compartilhado para armazenar os dados de configura&ccedil;&atilde;o.</p>
<p>Essa op&ccedil;&atilde;o ser&aacute; ignorada se o Servi&ccedil;o de Disponibilidade for desativado.</p>
</dd>
<dt>Tipo de Armazenamento de Mensagens</dt>
<dd>
<p>O tipo de armazenador de dados para os dados de mensagens em um cluster convencional. O valor <code>file</code> especifica um armazenador de arquivos. O valor <code>jdbc</code> especifica um armazenador JDBC.</p>
<p>Essa op&ccedil;&atilde;o ser&aacute; ignorada se o Servi&ccedil;o de Disponibilidade for desativado.</p>
</dd>
<dt>Fornecedor do Banco de Dados</dt>
<dt>Nome de Usu&aacute;rio do Banco de Dados</dt>
<dt>Senha do Banco de Dados</dt>
<dt>URL de Acesso do Banco de Dados</dt>
<dd>
<p>O fornecedor do banco de dados, o usu&aacute;rio, a senha e o url de acesso do banco de dados JDBC para usar em uma dessas situa&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Quando o Servi&ccedil;o de Disponibilidade &eacute; ativado.</p>
</li>
<li>
<p>Quando o Tipo de Armazenamento de Configura&ccedil;&otilde;es &eacute; definido para <code>shareddb</code></p>
</li>
<li>
<p>Quando o Tipo de Armazenamento de Mensagens &eacute; definido para <code>jdbc</code></p>
</li>
</ul>
<p>Para obter informa&ccedil;&otilde;es sobre fornecedores e os formatos dos urls de acesso para cada fornecedor, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244"><i>Persist&ecirc;ncia baseada em JDBC</i> no <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para disponibilidade do JMS.</p>
<p>GlassFish Server n&atilde;o predefine nenhuma propriedade de disponibilidade de JMS adicional.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-jmsservice.html">Para Configurar o Servi&ccedil;o do JMS</a></p>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
