<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsservice-additional-props"></a><h4>Propriedades espec&#237;ficas do servi&#231;o JMS</h4>
<a name="indexterm-44"></a><a name="indexterm-45"></a><p>As propriedades de configura&#231;&#227;o do broker da Fila de mensagens do Oracle
a seguir est&#227;o dispon&#237;veis para o servi&#231;o JMS.</p>

<dl><dt><tt>instance-name</tt></dt>
<dd><p>Especifica o nome da inst&#226;ncia do broker da Fila de mensagens. O padr&#227;o &#233; <tt>imqbroker</tt>.</p>

</dd>
<dt><tt>instance-name-suffix</tt></dt>
<dd><p>Especifica um sufixo a ser adicionado ao nome completo da inst&#226;ncia do broker da Fila de mensagens. O sufixo &#233; separado do nome da inst&#226;ncia por um caractere de sublinhado (<tt>_</tt>). Por exemplo, se a inst&#226;ncia do nome for <tt>imqbroker</tt>, colocar o sufixo <tt>xyz</tt> altera o nome da inst&#226;ncia para <tt>imqbroker_xyz</tt>.</p>

</dd>
<dt><tt>append-version</tt></dt>
<dd><p>Se <tt>verdadeiro</tt>, adiciona os n&#250;meros de vers&#227;o maiores e menores, precedidos de caracteres de sublinhado (<tt>_</tt>), ao nome completo da inst&#226;ncia do broker da Fila de mensagens. Por exemplo, se o nome da inst&#226;ncia for <tt>imqbroker</tt>, a adi&#231;&#227;o dos n&#250;meros de vers&#227;o altera o nome da inst&#226;ncia para <tt>imqbroker_8_0</tt>. O padr&#227;o &#233; <tt>falso</tt>.</p>

</dd>
<dt><tt>user-name</tt></dt>
<dd><p>O nome de usu&#225;rio para a cria&#231;&#227;o da conex&#227;o JMS. Necess&#225;rio somente se nome de usu&#225;rio/senha de <tt>guest</tt>/<tt>guest</tt> n&#227;o estiver dispon&#237;vel no broker. O valor padr&#227;o &#233; <tt>guest</tt>.</p>

</dd>
<dt><tt>password</tt></dt>
<dd><p>A senha para a cria&#231;&#227;o da conex&#227;o JMS. Necess&#225;rio somente se nome de usu&#225;rio/senha de<tt>guest</tt>/<tt>guest</tt> n&#227;o estiver dispon&#237;vel no broker. O valor padr&#227;o &#233; <tt>guest</tt>.</p>

</dd>
</dl>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
