<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsdestinationedit"></a><h4>Editar recurso de destino JMS</h4>
<a name="indexterm-41"></a><a name="indexterm-42"></a><p>Utilize a p&#225;gina Editar recurso de destino JMS para modificar as configura&#231;&#245;es
de um recurso de destino JMS.</p>

<p>A p&#225;gina Editar recurso de destino JMS cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome JNDI</dt>
<dd><p>Um nome exclusivo que identifica o recurso de destino. O nome JNDI &#233; um campo de somente leitura. Voc&#234; pode especificar o nome JNDI somente quando cria um novo recurso de destino JMS.</p>

</dd>
<dt>Nome de destino f&#237;sico</dt>
<dd><p>O nome do destino f&#237;sico associado a esse recurso.</p>

<p>O Servidor GlassFish cria um destino f&#237;sico automaticamente quando necess&#225;rio e o exclui quando voc&#234; exclui o recurso de destino.</p>

</dd>
<dt>Tipo de recurso</dt>
<dd><p>O tipo do recurso de destino. As escolhas dispon&#237;veis s&#227;o <tt>javax.jms.Topic</tt> e <tt>javax.jms.Queue</tt>.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do recurso de destino.</p>

</dd>
<dt>Status</dt>
<dd><p>O status do recurso de destino. O recurso de destino pode ser ativado ou desativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais para o recurso de destino. O Servidor GlassFish n&#227;o define quaisquer propriedades adicionais para recursos de destino JMS.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jmsdestinationnew.html">Para criar um recurso de destino do JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationedit.html">Para editar um recurso de destino do JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationdelete.html">Para excluir um recurso de destino do JMS</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jms-resource-1"><tt>create-jms-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jms-resources-1"><tt>list-jms-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jms-resource-1"><tt>delete-jms-resource</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
