<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmshostedit"></a><h4>Para editar um host do JMS</h4><a name="indexterm-15"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>No n&#243; Configura&#231;&#227;o, expanda o n&#243; do Java Message Service.</b></li>
<li><b>No n&#243; do Java Message Service, selecione o n&#243; Hosts do JMS.</b><p>A p&#225;gina Hosts do JMS &#233; aberta.</p></li>
<li><b>Na p&#225;gina Hosts do JMS, selecione o host que est&#225; sendo editado.</b><p>A p&#225;gina Editar host do JMS &#233; aberta.</p></li>
<li><b>No campo Host, digite o nome ou o endere&#231;o do Protocolo Internet
(IP) do sistema em que o host do JMS ser&#225; executado (<tt>localhost</tt>
ou o nome do sistema local ou remoto).</b></li>
<li><b>No campo Porta, digite o n&#250;mero da porta do servi&#231;o JMS.</b><p>Altere esse campo somente se o servi&#231;o JMS a ser utilizado estiver
sendo executado em uma porta n&#227;o padr&#227;o. A porta padr&#227;o &#233; 7676.</p></li>
<li><b>Nos campos Nome de usu&#225;rio e Senha Admin, digite o nome de
usu&#225;rio e a senha do broker da Fila de mensagens.</b><p>S&#227;o diferentes do nome de usu&#225;rio e da senha do Servidor GlassFish.
Edite esses campos somente se os valores do broker da Fila de
mensagens foram alterados com o comando <tt><i>as-install-parent</i>/mq/bin/imqusermgr</tt>. Os valores padr&#227;o s&#227;o <tt>admin</tt>
e <tt>admin</tt>.</p></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jmsservice.html">Para configurar o servi&#231;o JMS</a></p>

</li>
<li><p><a href="task-jmshostnew.html">Para criar um host do JMS</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">Para excluir um host do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestnew.html">Para criar um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestedit.html">Para editar um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldestdelete.html">Para excluir um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsflushmessages.html">Para remover mensagens de um destino f&#237;sico do JMS</a></p>

</li>
<li><p><a href="task-jmsphysicaldeststats.html">Para visualizar estat&#237;sticas de um destino f&#237;sico do JMS</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
