<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmsdestinationedit"></a><h4>Para editar um recurso de destino do JMS</h4><a name="indexterm-9"></a><a name="indexterm-10"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>No n&#243; Recursos, expanda o n&#243; Recursos do JMS.</b></li>
<li><b>No n&#243; Recursos do JMS, selecione o n&#243; Recursos de destino do
JMS.</b><p>A p&#225;gina Recursos de destino do JMS &#233; aberta.</p></li>
<li><b>Na p&#225;gina Recursos de destino do JMS, clique no nome do recurso
de destino que est&#225; sendo editado.</b><p>A p&#225;gina p&#225;gina Editar recursos de destino do JMS &#233; aberta.</p></li>
<li><b>No campo Nome do destino f&#237;sico, digite o nome do destino f&#237;sico
associado a esse recurso.</b><p>O Servidor GlassFish cria um destino f&#237;sico automaticamente quando necess&#225;rio e o
exclui quando voc&#234; exclui o recurso de destino.</p></li>
<li><b>Na lista suspensa Tipo de recurso, selecione <tt>javax.jms.Topic</tt> ou <tt>javax.jms.Queue</tt>.</b></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o do recurso de destino.</b></li>
<li><b>Marque a caixa de sele&#231;&#227;o Status ativo para ativar o recurso no
tempo de execu&#231;&#227;o.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique propriedades adicionais do servidor de destino. </b><p>O Servidor GlassFish n&#227;o define propriedades adicionais para recursos de destino do
JMS.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jmsconnectionnew.html">Para criar um recurso de f&#225;brica de conex&#245;es do JMS</a></p>

</li>
<li><p><a href="task-jmsconnectionedit.html">Para editar um recurso de f&#225;brica de conex&#245;es do JMS</a></p>

</li>
<li><p><a href="task-jmsconnectiondelete.html">Para excluir um recurso de f&#225;brica de conex&#245;es do JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationnew.html">Para criar um recurso de destino do JMS</a></p>

</li>
<li><p><a href="task-jmsdestinationdelete.html">Para excluir um recurso de destino do JMS</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
