<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationedit" name="task-jmsdestinationedit"></a><a id="GHJMS00024" name="GHJMS00024"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Para Editar um Recurso de Destina&ccedil;&atilde;o do JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; Recursos JMS.</p>
</li>
<li>
<p>No n&oacute; Recursos JMS, selecione o n&oacute; Recursos de destino JMS.</p>
<p>A p&aacute;gina Recursos de destino JMS &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos de destino JMS, clique no nome do recurso de destino que est&aacute; sendo editado.</p>
<p>A p&aacute;gina p&aacute;gina Editar recursos de destino JMS &eacute; aberta.</p>
</li>
<li>
<p>No campo Nome do destino f&iacute;sico, digite o nome do destino f&iacute;sico associado a esse recurso.</p>
<p>O GlassFish Server cria um destino f&iacute;sico automaticamente quando necess&aacute;rio e o deleta quando voc&ecirc; deleta o recurso de destino.</p>
</li>
<li>
<p>Na lista drop-down Tipo de recurso, selecione <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do recurso de destino.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status ativo para ativar o recurso durante o runtime.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades adicionais, especifique propriedades adicionais do servidor de destino.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para recursos de destino do JMS.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar propriedade. Na linha em branco que &eacute; exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
<li>
<p>Optionally, click the Targets tab to go to the JMS Destination Resource Targets page. On this page, do the following:</p>
<ol type="a">
<li>
<p>Click Manage Targets to open the Manage Resource Targets page.</p>
<p>On this page, move targets between the Available column and the Selected column. Make sure to place in the Selected column the target or targets to which applications that use the resource will be deployed. The available targets include the available clusters and server instances, as well as the default server instance, <code>server</code>. Click OK to save the changes.</p>
</li>
<li>
<p>Select the checkbox for a target, then click Enable or Disable to enable or disable the resource for that target.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para Criar um Recurso da F&aacute;brica de Conex&otilde;es JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para Editar um Recurso da F&aacute;brica de Conex&otilde;es JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para Deletar um Recurso da F&aacute;brica de Conex&otilde;es JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Para Criar um Recurso de Destina&ccedil;&atilde;o do JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para Deletar um Recurso de Destina&ccedil;&atilde;o de JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
