<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationnew" name="task-jmsdestinationnew"></a><a id="GHJMS00023" name="GHJMS00023"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Para Criar um Recurso de Destina&ccedil;&atilde;o do JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Quando voc&ecirc; cria um recurso de destino JMS, o GlassFish Server cria um recurso de objeto de admin para o recurso de destino. Voc&ecirc; pode visualizar esse recurso no n&oacute; Conectores.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; Recursos JMS.</p>
</li>
<li>
<p>No n&oacute; Recursos JMS, selecione o n&oacute; Recursos de destino JMS.</p>
<p>A p&aacute;gina Recursos de destino JMS &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos de destino JMS, clique em Novo.</p>
<p>A p&aacute;gina Novos recursos de destino JMS &eacute; aberta.</p>
</li>
<li>
<p>No campo Nome JNDI, digite o nome JNDI do recurso.</p>
<p>Recomenda-se usar o prefixo de subcontexto de nomea&ccedil;&atilde;o <code>jms/</code> para recursos do JMS. Por exemplo: <code>jms/Queue</code>.</p>
</li>
<li>
<p>No campo Nome do destino f&iacute;sico, digite o nome do destino f&iacute;sico associado a este recurso.</p>
<p>O GlassFish Server cria um destino f&iacute;sico automaticamente quando necess&aacute;rio e o deleta quando voc&ecirc; deleta o recurso de destino.</p>
</li>
<li>
<p>Na lista drop-down Tipo de recurso, selecione <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do recurso de destino.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status ativo para ativar o recurso durante o runtime.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades adicionais, especifique propriedades adicionais do servidor de destino.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para recursos de destino do JMS.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar propriedade. Na linha em branco que &eacute; exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>In the Targets area, do the following:</p>
<ol type="a">
<li>
<p>From the Available column, select the target or targets to which applications that use the resource will be deployed.</p>
<p>The available targets include the available clusters and server instances, as well as the default server instance, <code>server</code>.</p>
</li>
<li>
<p>Click Add to move the target to the Selected column.</p>
</li>
</ol>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para Criar um Recurso da F&aacute;brica de Conex&otilde;es JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para Editar um Recurso da F&aacute;brica de Conex&otilde;es JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para Deletar um Recurso da F&aacute;brica de Conex&otilde;es JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para Editar um Recurso de Destina&ccedil;&atilde;o do JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para Deletar um Recurso de Destina&ccedil;&atilde;o de JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
