<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndicustomresourceedit" name="task-jndicustomresourceedit"></a><a id="GHJML00016" name="GHJML00016"></a></p>

<h4><a id="sthref13" name="sthref13"></a><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Modificare una risorsa JNDI personalizzata</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Nell'albero di navigazione espandere il nodo Risorse.</p>
</li>
<li>
<p>Nel nodo Risorse, espandere il nodo JNDI.</p>
</li>
<li>
<p>Nel nodo JNDI, selezionare Risorse personalizzate.</p>
<p>Viene visualizzata la pagina Risorse personalizzate.</p>
</li>
<li>
<p>Nella pagina Risorse personalizzate, fare clic sul nome della risorsa che verr&agrave; modificata.</p>
<p>Viene aperta la pagina Modifica risorsa personalizzata.</p>

<hr>
<p><b>Nota:</b></p>
Il campo Nome JNDI &egrave; di sola lettura. &Egrave; possibile specificare il nome JNDI solo quando si crea una nuova risorsa personalizzata.
<hr>

</li>
<li>
<p>Per modificare il valore relativo a Tipo di risorsa, procedere in uno dei seguenti modi.</p>
<ul>
<li>
<p>Dall'elenco a discesa, selezionare una definizione di tipo.</p>
</li>
<li>
<p>Selezionare il secondo pulsante di scelta e digitare una definizione di tipo completamente qualificata, nel formato . <code>xxx</code>.</p>
</li>
</ul>
</li>
<li>
<p>Nel campo Classe factory, digitare un nome di classe di factory per la risorsa personalizzata.</p>
<p>Classe factory &egrave; il nome specificato dall'utente per la classe di factory. Questa classe implementa l'interfaccia <code>javax.naming.spi.ObjectFactory</code>.</p>
</li>
<li>
<p>Nel campo Descrizione, digitare una breve descrizione della risorsa.</p>
<p>La descrizione &egrave; un valore stringa e non pu&ograve; superare i 250 caratteri di lunghezza.</p>
</li>
<li>
<p>Selezionare la casella di controllo Stato abilitato per abilitare la risorsa.</p>
<p>Per impostazione predefinita la risorsa &egrave; abilitata, ossia disponibile dal momento in cui viene creata.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive per la risorsa personalizzata.</p>
<p>In GlassFish Server non &egrave; definita alcuna propriet&agrave; aggiuntiva per le risorse personalizzate.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome relativo alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-jndicustomresourcenew.html">Creare una risorsa JNDI personalizzata</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">Eliminare una risorsa JNDI personalizzata</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcecreate.html">Creare una risorsa JNDI esterna</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourceedit.html">Modificare una risorsa JNDI esterna</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">Eliminare una risorsa JNDI esterna</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
