<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a><a id="GHJMS00009" name="GHJMS00009"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>JMS&#12398;&#21487;&#29992;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS(Java Message Service)&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;JMS&#12398;&#21487;&#29992;&#24615;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMS&#12398;&#21487;&#29992;&#24615;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12434;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#25345;&#12388;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12377;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#25345;&#12383;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;</dt>
<dd>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12434;GlassFish&#12463;&#12521;&#12473;&#12479;&#12395;&#25552;&#20379;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12377;&#12427;Message Queue&#12463;&#12521;&#12473;&#12479;&#12398;&#12479;&#12452;&#12503;&#12290;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25313;&#24373;&#12373;&#12428;&#12383;Message Queue&#12463;&#12521;&#12473;&#12479;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12289;&#24467;&#26469;&#12398;Message Queue&#12463;&#12521;&#12473;&#12479;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12300;&#27083;&#25104;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#24467;&#26469;&#12398;Message Queue&#12463;&#12521;&#12473;&#12479;&#12391;&#20351;&#29992;&#12377;&#12427;&#27083;&#25104;&#12487;&#12540;&#12479;&#29992;&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12398;&#12479;&#12452;&#12503;&#12290;&#20516;<code>masterbroker</code>&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#27083;&#25104;&#12487;&#12540;&#12479;&#12398;&#26684;&#32013;&#12392;&#31649;&#29702;&#12395;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#20516;<code>shareddb</code>&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#27083;&#25104;&#12487;&#12540;&#12479;&#12398;&#26684;&#32013;&#12395;&#20849;&#26377;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#24467;&#26469;&#12398;&#12463;&#12521;&#12473;&#12479;&#12391;&#20351;&#29992;&#12377;&#12427;&#12289;&#12502;&#12525;&#12540;&#12459;&#20869;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12487;&#12540;&#12479;&#29992;&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12398;&#12479;&#12452;&#12503;&#12290;&#20516;<code>file</code>&#12399;&#12501;&#12449;&#12452;&#12523;&#12539;&#12473;&#12488;&#12450;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#20516;<code>jdbc</code>&#12399;JDBC&#12473;&#12488;&#12450;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;</dt>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12518;&#12540;&#12470;&#12540;&#21517;</dt>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;URL</dt>
<dd>
<p>&#27425;&#12398;&#22580;&#21512;&#12395;&#20351;&#29992;&#12377;&#12427;JDBC&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12505;&#12531;&#12480;&#12540;&#12289;&#12518;&#12540;&#12470;&#12540;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12289;&#12362;&#12424;&#12403;&#12450;&#12463;&#12475;&#12473;URL&#12290;</p>
<ul>
<li>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;&#12301;&#12364;<code>shareddb</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;&#12301;&#12364;<code>jdbc</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;</p>
</li>
</ul>
<p>&#12469;&#12509;&#12540;&#12488;&#23550;&#35937;&#12398;&#12505;&#12531;&#12480;&#12540;&#12289;&#12362;&#12424;&#12403;&#21508;&#12505;&#12531;&#12480;&#12540;&#12398;&#12450;&#12463;&#12475;&#12473;URL&#12398;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244"><i>Oracle GlassFish Server Message Queue&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<i>JDBC-Based Persistence</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>JMS&#12398;&#21487;&#29992;&#24615;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;</p>
<p>GlassFish Server&#12399;JMS&#12398;&#21487;&#29992;&#24615;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20107;&#21069;&#12395;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-jmsservice.html">JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;</a></p>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
