<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstancenew"></a><h4>New Standalone Server Instance (Nueva instancia del servidor independiente)</h4>
<a name="indexterm-202"></a><a name="indexterm-203"></a><a name="indexterm-204"></a><p>Utilice la p&#225;gina New Standalone Server Instance (Nueva instancia del servidor independiente)
para crear una instancia de GlassFish Server independiente.</p>

<p>La p&#225;gina New Standalone Server Instance (Nueva instancia del servidor independiente) contiene
las opciones siguientes.</p>

<dl><dt>Nombre de instancia</dt>
<dd><p>El nombre de la instancia que se va a crear. </p>

<p>El nombre debe cumplir los siguientes requisitos:</p>


<ul><li><p>El nombre debe empezar por una letra, un n&#250;mero o un car&#225;cter de subrayado.</p>

</li>
<li><p>El nombre s&#243;lo puede contener los siguientes caracteres:</p>


<ul><li><p>Letras en min&#250;scula</p>

</li>
<li><p>Letras en may&#250;scula</p>

</li>
<li><p>N&#250;meros</p>

</li>
<li><p>Gui&#243;n</p>

</li>
<li><p>Punto</p>

</li>
<li><p>Subrayado</p>

</li></ul>
</li>
<li><p>El nombre debe ser exclusivo en el dominio y no debe ser el nombre de otra instancia de GlassFish Server, de un cl&#250;ster, de una configuraci&#243;n con nombre ni de un nodo.</p>

</li>
<li><p>El nombre non debe ser <tt>domain</tt>, <tt>server</tt> ni otra palabra clave reservada para GlassFish Server.</p>

</li></ul>
</dd>
<dt>Nodo</dt>
<dd><p>Lista desplegable de los nodos existentes que definen los hosts en los que puede residir la instancia. Debe seleccionarse un nodo en la lista. Si la instancia se va a crear en el host en el que se est&#225; ejecutando el servidor de administraci&#243;n de dominio (DAS), seleccione el nodo predefinido <tt>localhost-<i>dominio</i></tt>.</p>

</dd>
<dt>Configuraci&#243;n</dt>
<dd><p>Lista desplegable de las configuraciones con nombre existentes que la instancia puede utilizar. Debe seleccionarse una configuraci&#243;n en la lista. La instancia utilizar&#225; la configuraci&#243;n seleccionada cuando se cree.</p>

</dd>
<dt>Realizar una copia de la configuraci&#243;n seleccionada</dt>
<dd><p>Si se selecciona esta opci&#243;n, se copia la configuraci&#243;n seleccionada cuando se crea la instancia. Se asigna el nombre <tt><i>nombre_instancia</i>-config</tt> a la copia de la configuraci&#243;n, donde <i>nombre_instancia</i> es el nombre de la instancia del campo Nombre de instancia.</p>

<p>Si se selecciona <tt>default-config</tt> en la lista desplegable Configuraci&#243;n, debe elegir esta opci&#243;n. La configuraci&#243;n <tt>default-config</tt> s&#243;lo se puede copiar, no tomar como referencia.</p>

</dd>
<dt>Hacer referencia a la configuraci&#243;n seleccionada</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, la instancia usar&#225; la configuraci&#243;n con nombre especificada.</p>

<p>Si se selecciona <tt>default-config</tt> en la lista desplegable Configuraci&#243;n, <b>no</b> debe seleccionar esta opci&#243;n. La configuraci&#243;n <tt> default-config</tt> no puede tomarse como referencia, sino s&#243;lo copiarse.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-create-standalone-instance.html">Para crear una instancia de GlassFish Server independiente</a></p>

</li></ul>
<h5>Subcomando <tt>asadmin</tt> equivalente</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-instance-1"><tt>create-instance</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
