<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstancegeneral"></a><h4>Informaci&#243;n general</h4>
<a name="indexterm-205"></a><a name="indexterm-206"></a><a name="indexterm-207"></a><p>La p&#225;gina Informaci&#243;n general contiene las opciones siguientes.</p>

<dl><dt>Inicio</dt>
<dd><p>Bot&#243;n para iniciar la instancia. Si la instancia se est&#225; ejecutando, este bot&#243;n est&#225; desactivado. </p>

</dd>
<dt>Detener </dt>
<dd><p>Bot&#243;n para detener la instancia. Si la instancia se detiene, este bot&#243;n se desactiva.</p>

</dd>
<dt>Reiniciar</dt>
<dd><p>Bot&#243;n para reiniciar la instancia. Si la instancia se detiene, este bot&#243;n se desactiva.</p>

</dd>
<dt>Visualizar archivos de registro</dt>
<dd><p>Bot&#243;n para ver archivos de registro para la instancia.</p>

</dd>
<dt>Girar registro</dt>
<dd><p>Bot&#243;n para girar el archivo de registro para la instancia. Cuando se gira el archivo de registro, se cambia el nombre del archivo por un nombre con marca de tiempo con el formato <tt>server.log_</tt><i> fecha_y_hora</i><tt></tt> y se crea un archivo de registro vac&#237;o para los nuevos mensajes de registro. Los cambios se aplican de forma din&#225;mica. No es necesario reiniciar el servidor.</p>

</dd>
<dt>Recuperar transacciones</dt>
<dd><p>Bot&#243;n para recuperar las transacciones para la instancia.</p>

</dd>
<dt>Nombre</dt>
<dd><p>El nombre asignado a la instancia durante su creaci&#243;n. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>JVM</dt>
<dd><p>Si hace clic sobre el Informe de JVM, se abrir&#225; una ventana independiente que muestra informes en la m&#225;quina virtual de Java, incluyendo un informe resumido, un informe sobre administraci&#243;n de la memoria y recolecci&#243;n de elementos no utilizados, otro informe sobre carga de clases y un volcado de subprocesos actuales.</p>

</dd>
<dt>Estado</dt>
<dd><p>Indicaci&#243;n de si la instancia est&#225; en ejecuci&#243;n o no. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Nodo</dt>
<dd><p>Nombre del nodo en el que reside la instancia. Al hacer clic en el nombre se abre la p&#225;gina <a href="ref-nodeedit.html">Editar nodo</a> del nodo.</p>

</dd>
<dt>Configuraci&#243;n</dt>
<dd><p>la configuraci&#243;n a la que hace referencia la instancia. Al hacer clic en la configuraci&#243;n se abre la p&#225;gina <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=ref-configuration">Configuraciones</a> para la instancia.</p>

</dd>
<dt>Depuraci&#243;n</dt>
<dd><p>Indica si <a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">Java Platform Debugger Architecture (JPDA)</a> est&#225; o no activada la depuraci&#243;n para la instancia. Este campo es de s&#243;lo lectura.</p>

<p>Si se inicia una instancia desde la Consola de administraci&#243;n, la depuraci&#243;n JPDA no se activa para la instancia. Para iniciar una instancia con depuraci&#243;n JPDA activada, utilice el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a>.</p>

</dd>
<dt>Puertos HTTP</dt>
<dd><p>Lista separada por comas de los n&#250;meros de puerto en los que la instancia escucha los siguientes tipos de solicitudes:</p>


<ul><li><p>Solicitudes de administraci&#243;n</p>

</li>
<li><p>Solicitudes HTTP</p>

</li>
<li><p>Solicitudes HTTPS</p>

</li></ul>
<p>Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Puertos IIOP</dt>
<dd><p>Lista separada por comas de los n&#250;meros de puerto que utiliza la instancia para los siguientes tipos de conexiones:</p>


<ul><li><p>Conexi&#243;n IIOP segura</p>

</li>
<li><p>Conexiones IIOP seguras con autenticaci&#243;n de cliente</p>

</li>
<li><p>Conexiones IIOP</p>

</li></ul>
<p>Este campo es de s&#243;lo lectura.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-start-standalone-instances.html">Para iniciar instancias de Servidor GlassFish independientes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para detener instancias de Servidor GlassFish independientes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para ver archivos de registro para una instancia de Servidor GlassFish independiente</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transacciones para una instancia de Servidor GlassFish independiente</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-instance-1"><tt>stop-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=rotate-log-1"><tt>rotate-log</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
