<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstanceapplications" name="ref-standaloneinstanceapplications"></a><a id="GHCLU00021" name="GHCLU00021"></a></p>

<h4><a id="sthref334" name="sthref334"></a><a id="sthref335" name="sthref335"></a>Aplicaciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Aplicaciones para llevar a cabo las tareas siguientes en la instancia independiente seleccionada de GlassFish Server:</p>
<ul>
<li>
<p>Ver y gestionar las aplicaciones que ya est&aacute;n desplegadas en la instancia</p>
</li>
<li>
<p>Desplegar m&aacute;s aplicaciones en la instancia</p>
</li>
</ul>
<p>El campo Nombre de Instancia es un campo de s&oacute;lo lectura que muestra el nombre de la instancia actual.</p>
<p>La p&aacute;gina Aplicaciones muestra una lista de las aplicaciones que se han desplegado en la instancia seleccionada. Para cada aplicaci&oacute;n aparece la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Activado</dt>
<dd>
<p>Indica si se ha activado la aplicaci&oacute;n:</p>
<ul>
<li>
<p>Si se ha activado la aplicaci&oacute;n, se muestra una marca de control (&#10003;).</p>
</li>
<li>
<p>Si la aplicaci&oacute;n est&aacute; desactivada, se muestra una cruz (&#10007;).</p>
</li>
</ul>
</dd>
<dt>Equilibrador de Carga Activado</dt>
<dd>
<p>Indica si se ha activado la aplicaci&oacute;n para el equilibrio de carga:</p>
<ul>
<li>
<p>Si se ha activado la aplicaci&oacute;n para el equilibrio de carga, se muestra una marca de control (&#10003;).</p>
</li>
<li>
<p>Si se ha desactivado la aplicaci&oacute;n para el equilibrio de carga, se muestra una cruz (&#10007;).</p>
</li>
</ul>
</dd>
<dt>Motores</dt>
<dd>
<p>Tipos de contenedores que emplea la aplicaci&oacute;n. Los tipos de contenedores pueden ser:</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>conector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code>: contenedor para los contextos y la inyecci&oacute;n de dependencia para las aplicaciones de la plataforma Java EE.</p>
</li>
</ul>
</dd>
</dl>
<p>La tabla Aplicaciones Desplegadas tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Desplegar</dt>
<dd>
<p>Bot&oacute;n para desplegar una aplicaci&oacute;n.</p>
</dd>
<dt>Anular Despliegue</dt>
<dd>
<p>Bot&oacute;n para anular el despliegue de una o m&aacute;s aplicaciones seleccionadas.</p>
<p>Al anular el despliegue de una aplicaci&oacute;n se elimina la aplicaci&oacute;n de todos los destinos y del dominio. Cuando se anula el despliegue de una aplicaci&oacute;n, la aplicaci&oacute;n ya no aparece en la p&aacute;gina <a href="../../../common/es/help/missingtopic.html">Aplicaciones</a> que muestra todas las aplicaciones desplegadas en GlassFish Server.</p>
<p>Para eliminar aplicaciones solo del destino actual, utilice el bot&oacute;n Eliminar en esta p&aacute;gina.</p>
</dd>
<dt>Eliminar</dt>
<dd>
<p>Bot&oacute;n para eliminar una o m&aacute;s aplicaciones seleccionadas.</p>
<p>Al eliminar una aplicaci&oacute;n solo se elimina del destino actual. Cuando una aplicaci&oacute;n se elimina de un destino, la aplicaci&oacute;n sigue apareciendo en la p&aacute;gina <a href="../../../common/es/help/missingtopic.html">Aplicaciones</a> que muestra todas las aplicaciones despelgadas en GlassFish Server. La aplicaci&oacute;n tambi&eacute;n seguir&aacute; desplegada en otros destinos en los que se hubiera desplegado.</p>
<p>Para eliminar aplicaciones de todos los destinos y del dominio, utilice el bot&oacute;n Anular Despliegue en esta p&aacute;gina.</p>
</dd>
<dt>M&aacute;s Acciones</dt>
<dd>
<p>Lista desplegable que realiza acciones adicionales en una o m&aacute;s aplicaciones seleccionadas.</p>
<dl>
<dt>Activar</dt>
<dd>
<p>Activa una o m&aacute;s aplicaciones seleccionadas.</p>
</dd>
<dt>Desactivar</dt>
<dd>
<p>Desactiva una o m&aacute;s aplicaciones seleccionadas.</p>
</dd>
<dt>Activaci&oacute;n de Equilibrador de Carga</dt>
<dd>
<p>Activa una o m&aacute;s aplicaciones seleccionadas para el equilibrio de carga.</p>
</dd>
<dt>Desactivaci&oacute;n de Equilibrador de Carga</dt>
<dd>
<p>Desactiva una o m&aacute;s aplicaciones seleccionadas para el equilibrio de carga.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref336" name="sthref336"></a>
<h5>Tareas Relacionadas</h5>
<ul>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Desplegar una Aplicaci&oacute;n en una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enumerar Aplicaciones que se Despliegan en una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Anular Despliegue de Aplicaciones desde una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Eliminar Aplicaciones desde una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Editar una Aplicaci&oacute;n que se Despliega en una instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activar o Desactivar una Aplicaci&oacute;n que se Despliega en una instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activar o Desactivar el Equilibrio de Carga para una Aplicaci&oacute;n que se Despliega en una Instancia de GlassFish Server Independiente</a></p>
</li>
</ul>
<a id="sthref337" name="sthref337"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>disable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>enable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
