<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstances"></a><h4>Instancias de servidor independientes</h4>
<a name="indexterm-199"></a><a name="indexterm-200"></a><a name="indexterm-201"></a><p>Utilice la p&#225;gina Instancias de servidor independientes para crear y administrar instancias
de GlassFish Server independientes.</p>

<p>La p&#225;gina Instancias de servidor independientes muestra una lista de todas las
instancias independientes del dominio. Para cada instancia se proporciona la informaci&#243;n siguiente.</p>

<dl><dt>Nombre</dt>
<dd><p>El nombre asignado a la instancia durante su creaci&#243;n. Al hacer clic en el nombre se abre la p&#225;gina <a href="ref-standaloneinstancegeneral.html">Informaci&#243;n general</a> para la instancia.</p>

</dd>
<dt>Peso de LB</dt>
<dd><p>Entero que representa la ponderaci&#243;n de equilibrio de carga de la instancia.</p>

<p>La ponderaci&#243;n de equilibrio de carga determina la proporci&#243;n de todas las solicitudes con respecto al cl&#250;ster que debe procesar la instancia.</p>

<p>Por ejemplo, en un cl&#250;ster de dos instancias, puede necesitar que una instancia procese una solicitud de cuatro, y que otra procese las otras tres. En este caso, configure la ponderaci&#243;n de la instancia que debe procesar una de las cuatro solicitudes como 1 y la ponderaci&#243;n de la otra instancia como 3. Si prefiere usar porcentajes, defina las ponderaciones de las instancias como 25 y 75, respectivamente.</p>

<p>La ponderaci&#243;n predeterminada es 100. </p>

</dd>
<dt>Configuraci&#243;n</dt>
<dd><p>Configuraci&#243;n seleccionada para la instancia en el momento de su creaci&#243;n. Al hacer clic en la configuraci&#243;n se abre la p&#225;gina <a href="../../../common/es/help/ref-configuration.html">Configuraciones</a> para la instancia.</p>

</dd>
<dt>Nodo</dt>
<dd><p>Nombre del nodo en el que reside la instancia. Al hacer clic en el nombre se abre la p&#225;gina <a href="ref-nodeedit.html">Editar nodo</a> del nodo.</p>

</dd>
<dt>Estado</dt>
<dd><p>Indicaci&#243;n de si la instancia est&#225; en ejecuci&#243;n o no.</p>

</dd>
</dl>
<p>La tabla Instancias del servidor tambi&#233;n contiene las opciones siguientes.</p>

<dl><dt>Nuevo</dt>
<dd><p>Bot&#243;n para crear una instancia independiente.</p>

</dd>
<dt>Borrar</dt>
<dd><p>Bot&#243;n para eliminar una o varias instancias independientes.</p>

</dd>
<dt>Inicio</dt>
<dd><p>Bot&#243;n para iniciar una o varias instancias independientes.</p>

</dd>
<dt>Detener</dt>
<dd><p>Bot&#243;n para detener una o varias instancias independientes seleccionadas.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-create-standalone-instance.html">Para crear una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Para suprimir instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">Para iniciar instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para detener instancias de GlassFish Server independientes</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-instance-1"><tt>create-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-instance-1"><tt>delete-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-instances-1"><tt>list-instances</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-instance-1"><tt>stop-instance</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
