<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clustergeneral"></a><h4>Informaci&#243;n general</h4>
<a name="indexterm-164"></a><a name="indexterm-165"></a><a name="indexterm-166"></a><a name="indexterm-167"></a><p>La p&#225;gina Informaci&#243;n general contiene las opciones siguientes.</p>

<dl><dt>Iniciar cl&#250;ster</dt>
<dd><p>Bot&#243;n para iniciar el cl&#250;ster. Si todas las instancias del cl&#250;ster est&#225;n en ejecuci&#243;n, este bot&#243;n est&#225; desactivado.</p>

</dd>
<dt>Detener cl&#250;ster </dt>
<dd><p>Bot&#243;n para detener el cl&#250;ster. Si todas las instancias en el cl&#250;ster se detienen, este bot&#243;n se desactiva.</p>

</dd>
<dt>Migrar temporizadores EJB</dt>
<dd><p>Bot&#243;n para migrar temporizadores de tecnolog&#237;a Enterprise JavaBeans (EJB) desde una instancia de Servidor GlassFish detenida a una instancia en ejecuci&#243;n en el cl&#250;ster. Al pulsar este bot&#243;n se abre la p&#225;gina <a href="ref-migrateejbtimers.html">Migrar temporizadores EJB</a>. Si todas las instancias del cl&#250;ster est&#225;n en ejecuci&#243;n, este bot&#243;n est&#225; desactivado. </p>

</dd>
<dt>Girar registro</dt>
<dd><p>Bot&#243;n para girar el archivo de registro para el cl&#250;ster. Cuando se gira el archivo de registro, se cambia el nombre del archivo por un nombre con marca de tiempo con el formato <tt>server.log_</tt><i> fecha_y_hora</i><tt></tt> y se crea un archivo de registro vac&#237;o para los nuevos mensajes de registro. Los cambios se aplican de forma din&#225;mica. No es necesario reiniciar el servidor.</p>

</dd>
<dt>Nombre de cl&#250;ster</dt>
<dd><p>El nombre que se asign&#243; al cl&#250;ster en el momento de crearlo. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>JVM</dt>
<dd><p>Si hace clic sobre el Informe de JVM, se abrir&#225; una ventana independiente que muestra informes en la m&#225;quina virtual de Java, incluyendo un informe resumido, un informe sobre administraci&#243;n de la memoria y recolecci&#243;n de elementos no utilizados, otro informe sobre carga de clases y un volcado de subprocesos actuales.</p>

</dd>
<dt>Configuraci&#243;n</dt>
<dd><p>La configuraci&#243;n que se seleccion&#243; para el cl&#250;ster en el momento de crearlo. Al hacer clic en la configuraci&#243;n se abre la p&#225;gina <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=ref-configuration">Configuraci&#243;n</a> para el cl&#250;ster. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>GMS</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, se inician los Servicios de administraci&#243;n de grupos(GMS) en cada instancia de Servidor GlassFish del cl&#250;ster y en el servidor de administraci&#243;n de dominios (DAS). El DAS participa en cada cl&#250;ster para el que se han habilitado los GMS. Los GMS proporcionan supervisi&#243;n del cl&#250;ster, pertenencia al cl&#250;ster y servicios de comunicaci&#243;n para los grupos. Esta opci&#243;n se habilita por defecto.</p>

</dd>
<dt>Puerto de multidifusi&#243;n</dt>
<dd><p>N&#250;mero del puerto de comunicaci&#243;n en el que los GMS escuchan los eventos de grupos. Esta opci&#243;n debe especificar un n&#250;mero de puerto v&#225;lido entre 2048 y 32000. El valor predeterminado se genera autom&#225;ticamente dentro de este rango.</p>

</dd>
<dt>Direcci&#243;n de multidifusi&#243;n</dt>
<dd><p>Direcci&#243;n en la que los GMS escuchan los eventos de grupos. Esta opci&#243;n debe especificar una direcci&#243;n de multidifusi&#243;n entre 224.0.0.0 y 239.255.255.255. El valor predeterminado es 228.9.<i>XX</i>.<i>YY</i>, donde <i>XX</i> e <i>YY</i> son valores independientes generados autom&#225;ticamente entre 0 y 255.</p>

</dd>
<dt>Enlazar direcci&#243;n de interfaz</dt>
<dd><p>Direcci&#243;n IP (Internet Protocol) de la interfaz de red a la que se vinculan los GMS. Esta opci&#243;n debe especificar la direcci&#243;n IP de una interfaz de red local. Los valores predeterminados son direcciones de interfaz de red p&#250;blicas.</p>

<p>En un equipo multiorigen, esta opci&#243;n configura la interfaz de red usada para los GMS. Un equipo multiorigen posee dos o m&#225;s interfaces de red.</p>

<p>Para especificar una direcci&#243;n que sea v&#225;lida para todas las instancias de Servidor GlassFish del cl&#250;ster, utilice una propiedad del sistema para establecer la direcci&#243;n de forma individual para cada instancia.</p>

<p>Por ejemplo, utilice la p&#225;gina <a href="ref-clustersystemproperties.html">Propiedades del sistema de cl&#250;ster</a> para crear la propiedad del sistema <tt> GMS-BIND-INTERFACE-ADDRESS-<i>nombre_cl&#250;ster</i></tt>. A continuaci&#243;n, configure la opci&#243;n de enlace de direcci&#243;n de esta p&#225;gina como <tt>${GMS-BIND-INTERFACE-ADDRESS-<i>nombre_cl&#250;ster</i>}</tt> para especificar la propiedad del sistema. Por &#250;ltimo, para cada instancia del cl&#250;ster, configure la propiedad del sistema <tt>GMS-BIND-INTERFACE-ADDRESS-<i>nombre_cl&#250;ster</i></tt> con la direcci&#243;n de interfaz de red necesaria del equipo de la instancia.</p>

</dd>
<dt>Estado</dt>
<dd><p>Indicaci&#243;n del n&#250;mero de instancias del cl&#250;ster que se ejecutan y que no se ejecutan. Este campo es de s&#243;lo lectura.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-gmscluster.html">Para configurar los Servicios de administraci&#243;n de grupos para un cl&#250;ster</a></p>

</li>
<li><p><a href="task-migrate-ejb-timers.html">Para migrar temporizadores EJB</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=migrate-timers-1"><tt>migrate-timers</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=rotate-log-1"><tt>rotate-log</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
