<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-availabilityservice"></a><h4>Servicio de disponibilidad</h4>
<a name="indexterm-219"></a><p>Utilice la p&#225;gina Servicio de disponibilidad para cambiar la configuraci&#243;n de disponibilidad
para un cl&#250;ster.</p>

<p>La p&#225;gina Servicio de disponibilidad contiene las siguientes opciones.</p>

<dl><dt>Configuration Name</dt>
<dd><p>El nombre de la configuraci&#243;n a la que aplicar los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer las opciones que tienen valores por defecto a estos. Las opciones que no tienen valores por defecto no se modifican.</p>

</dd>
<dt>Servicio de disponibilidad</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitada, se ha habilitado la disponibilidad para el cl&#250;ster. Esta opci&#243;n est&#225; seleccionada por defecto.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Una tabla de propiedades adicionales para el Servicio de disponibilidad. </p>

<p>Servidor GlassFish no define propiedades adicionales para el Servicio de disponibilidad.</p>

<p>Para cada propiedad se muestra la informaci&#243;n siguiente:</p>

<dl><dt>Nombre</dt>
<dd><p>Nombre de la propiedad.</p>

</dd>
<dt>Valor</dt>
<dd><p>Valor de la propiedad que se define para la instancia seleccionada.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Descripci&#243;n textual que ofrece m&#225;s informaci&#243;n sobre la propiedad.</p>

</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&#233;n contiene las opciones siguientes.</p>

<dl><dt>Agregar propiedad</dt>
<dd><p>Bot&#243;n para agregar una propiedad. Al hacer clic en este bot&#243;n se a&#241;ade una fila a la tabla Propiedades adicionales.</p>

</dd>
<dt>Eliminar propiedades</dt>
<dd><p>Bot&#243;n para eliminar una o varias propiedades seleccionadas. Cualquier propiedad que se elimine vuelve a su valor predeterminado o, si no se ha definido ning&#250;n valor predeterminado, se queda sin definir.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-availabilityservice.html">Para configurar las opciones de disponibilidad de un cl&#250;ster</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
