<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterapplications"></a><h4>Aplicaciones</h4>
<a name="indexterm-171"></a><a name="indexterm-172"></a><p>Utilice la p&#225;gina Aplicaciones para llevar a cabo las tareas siguientes en
el cl&#250;ster actual:</p>


<ul><li><p>Ver y administrar las aplicaciones que ya est&#233;n implementadas en el cl&#250;ster</p>

</li>
<li><p>Implementar m&#225;s aplicaciones en el cl&#250;ster</p>

</li></ul>
<p>El campo Nombre de cl&#250;ster es un campo de s&#243;lo lectura que
muestra el nombre del cl&#250;ster actual.</p>

<p>La p&#225;gina Aplicaciones muestra una lista de las aplicaciones que se han
implementado en el cl&#250;ster actual. En cada aplicaci&#243;n aparece la siguiente informaci&#243;n.</p>

<dl><dt>Nombre</dt>
<dd><p>El nombre de la aplicaci&#243;n.</p>

<p>El nombre puede incluir un identificador de versi&#243;n opcional, que va a continuaci&#243;n del nombre y est&#225; separado de &#233;l por dos puntos (<tt>:</tt>). Para obtener m&#225;s informaci&#243;n sobre las versiones de m&#243;dulo y de aplicaci&#243;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions de <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p>

</dd>
<dt>Habilitado</dt>
<dd><p>Indica si se ha habilitado la aplicaci&#243;n:</p>


<ul><li><p>Si se ha habilitado la aplicaci&#243;n, se muestra una marca de verificaci&#243;n (&#10003;).</p>

</li>
<li><p>Si la aplicaci&#243;n est&#225; deshabilitada, se muestra una cruz (&#10007;).</p>

</li></ul>
</dd>
<dt>Equilibrador de carga activado</dt>
<dd><p>Indica si se ha habilitado la aplicaci&#243;n para el equilibrio de carga:</p>


<ul><li><p>Si se ha habilitado la aplicaci&#243;n para el equilibrio de carga, se muestra una marca de verificaci&#243;n (&#10003;).</p>

</li>
<li><p>Si el equilibrio de carga de la aplicaci&#243;n est&#225; deshabilitado, se muestra una cruz (&#10007;).</p>

</li></ul>
</dd>
<dt>Motores</dt>
<dd><p>Tipos de contenedores que emplea la aplicaci&#243;n. Los tipos de contenedores pueden ser:</p>


<ul><li><p><tt>web</tt></p>

</li>
<li><p><tt>webservices</tt></p>

</li>
<li><p><tt>ejb</tt></p>

</li>
<li><p><tt>connector</tt></p>

</li>
<li><p><tt>appclient</tt></p>

</li>
<li><p><tt>weld</tt> (el contenedor para los contextos y la inyecci&#243;n de dependencias para las aplicaciones de la plataforma Java EE)</p>

</li></ul>
</dd>
</dl>
<p>La tabla Aplicaciones implementadas tambi&#233;n contiene las siguientes opciones. </p>

<dl><dt>Implementar</dt>
<dd><p>Bot&#243;n para implementar una aplicaci&#243;n.</p>

</dd>
<dt>Anular implementaci&#243;n</dt>
<dd><p>Bot&#243;n para anular la implementaci&#243;n de una o m&#225;s aplicaciones seleccionadas. </p>

<p>Al anular la implementaci&#243;n de una aplicaci&#243;n se elimina la aplicaci&#243;n de todos los destinos y del dominio. Cuando se anula la implementaci&#243;n de una aplicaci&#243;n, la aplicaci&#243;n ya no aparece en la p&#225;gina <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=ref-applications">Aplicaciones</a> que enumera todas las aplicaciones implementadas en Servidor GlassFish.</p>

<p>Para eliminar aplicaciones solo del destino actual, utilice el bot&#243;n Eliminar en esta p&#225;gina. </p>

</dd>
<dt>Borrar</dt>
<dd><p>Bot&#243;n para eliminar una o m&#225;s aplicaciones seleccionadas. </p>

<p>Al eliminar una aplicaci&#243;n solo se elimina del destino actual. Cuando una aplicaci&#243;n se elimina de un destino, la aplicaci&#243;n sigue apareciendo en la p&#225;gina <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=ref-applications">Aplicaciones</a> que enumera todas las aplicaciones implementadas en Servidor GlassFish. La aplicaci&#243;n tambi&#233;n seguir&#225; implementada en otros destinos en los que se hubiera implementado.</p>

<p>Para eliminar aplicaciones de todos los destinos y del dominio, utilice el bot&#243;n Anular la implementaci&#243;n en esta p&#225;gina. </p>

</dd>
<dt>M&#225;s acciones</dt>
<dd><p>Lista desplegable que realiza acciones adicionales en una o m&#225;s aplicaciones seleccionadas.</p>

<dl><dt>Habilitar</dt>
<dd><p>Habilita una o m&#225;s aplicaciones seleccionadas.</p>

</dd>
<dt>Deshabilitar</dt>
<dd><p>Desactiva una o m&#225;s aplicaciones seleccionadas.</p>

</dd>
<dt>Habilitar Equilibrador de carga</dt>
<dd><p>Habilita una o m&#225;s aplicaciones seleccionadas para el equilibrio de carga.</p>

</dd>
<dt>Deshabilitar Equilibrador de carga</dt>
<dd><p>Deshabilita una o m&#225;s aplicaciones seleccionadas para el equilibrio de carga.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-cluster-app-deploy.html">Para implementar una aplicaci&#243;n en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">Para enumerar las aplicaciones que se han implementado en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">Para anular la implementaci&#243;n de aplicaciones de un cluster</a> </p>

</li>
<li><p><a href="task-cluster-app-remove.html">Para eliminar aplicaciones de un cluster </a> </p>

</li>
<li><p><a href="task-cluster-app-edit.html">Para editar una aplicaci&#243;n que est&#225; implementada en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">Para habilitar o inhabilitar una aplicaci&#243;n que est&#225; implementada en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">Para habilitar o inhabilitar el equilibrio de carga para una aplicaci&#243;n implementada en un cl&#250;ster</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=deploy-1"><tt>deploy</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-1"><tt>disable</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-http-lb-application-1"><tt>disable-http-lb-application</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-1"><tt>enable</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-http-lb-application-1"><tt>enable-http-lb-application</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-applications-1"><tt>list-applications</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
