<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clusterinstanceconfigproperties"></a><h4>Instance System Properties (Propiedades de sistema de la instancia)</h4>
<a name="indexterm-182"></a><a name="indexterm-183"></a><a name="indexterm-184"></a><p>La p&#225;gina Propiedades de sistema de la instancia muestra una lista de
las propiedades de sistema Java configuradas para la instancia actual de Servidor
GlassFish. Las propiedades del sistema Java se transfieren al lanzador de aplicaciones
Java mediante la opci&#243;n <tt>-D</tt> del lanzador de aplicaciones Java al iniciar
Servidor GlassFish.</p>

<p>Estas propiedades anulan las definiciones de propiedades de configuraci&#243;n de puertos en
la configuraci&#243;n de la instancia. La configuraci&#243;n de puertos predefinida se debe
anular si, por ejemplo, dos instancias agrupadas en cl&#250;ster residen en el
mismo equipo. En esta situaci&#243;n, la configuraci&#243;n de puertos para una instancia
debe anularse porque las dos instancias comparten la misma configuraci&#243;n. </p>

<p>Para obtener informaci&#243;n sobre la configuraci&#243;n de puertos predefinida, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=ref-predefinedconfigsysproperties">Propiedades predefinidas del sistema de configuraci&#243;n</a>.</p>

<p>El campo Nombre de instancia es un campo de s&#243;lo lectura que
muestra el nombre de la instancia actual.</p>

<p>Para cada propiedad se muestra la informaci&#243;n siguiente:</p>

<dl><dt>Nombre de variable de instancia</dt>
<dd><p>Nombre de la propiedad del sistema.</p>

</dd>
<dt>Valor Actual</dt>
<dd><p>El valor actualmente asignado a la propiedad. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Reemplazar valor</dt>
<dd><p>El valor que se asignar&#225; a la propiedad despu&#233;s de guardar los cambios. </p>

</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&#233;n contiene las opciones siguientes.</p>

<dl><dt>Agregar propiedad</dt>
<dd><p>Bot&#243;n para agregar una propiedad. Al hacer clic en este bot&#243;n se a&#241;ade una fila a la tabla Propiedades adicionales.</p>

</dd>
<dt>Eliminar propiedades</dt>
<dd><p>Bot&#243;n para eliminar una o varias propiedades seleccionadas. Cualquier propiedad que se elimine vuelve a su valor predeterminado o, si no se ha definido ning&#250;n valor predeterminado, se queda sin definir.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-change-clustered-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-config-sys-properties-defaults.html">Para definir los valores predeterminados de las propiedades del sistema de configuraci&#243;n</a></p>

</li></ul>
<h5>Subcomandos <tt>asadmin</tt> equivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-system-properties-1"><tt>create-system-properties</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-system-property-1"><tt>delete-system-property</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-system-properties-1"><tt>list-system-properties</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
