<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-gms"></a><h4>Editar servicio de administraci&#243;n de grupos: </h4>
<a name="indexterm-220"></a><p>Utilice la p&#225;gina Servicios de administraci&#243;n de grupos para cambiar la configuraci&#243;n
de los GMS.</p>

<p>Los Servicios de administraci&#243;n de grupos (GMS) son servicios en curso que
proporcionan supervisi&#243;n del cl&#250;ster, pertenencia al cl&#250;ster y servicios de comunicaci&#243;n de
grupos. Los GMS se basan en una pila configurable de protocolos de
descubrimiento de pertenencia a grupos y de supervisi&#243;n de estado. Los GMS
realizan las funciones siguientes:</p>


<ul><li><p>Notifican los m&#243;dulos registrados en una instancia de GlassFish Server cuando se a&#241;aden o eliminan una o varias instancias en un cl&#250;ster, o cuando se sospecha o se confirma que han fallado.</p>

</li>
<li><p>Permiten enviar y recibir mensajes entre un grupo de procesos.</p>

</li></ul>
<p>La p&#225;gina Servicios de administraci&#243;n de grupos contiene las opciones siguientes.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer los valores predeterminados de todos los par&#225;metros de configuraci&#243;n.</p>

</dd>
<dt>Nombre de configuraci&#243;n</dt>
<dd><p>El nombre de la configuraci&#243;n a la que se aplican los par&#225;metros de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Maximum Missed Heartbeats (M&#225;ximo de latidos descartados)</dt>
<dd><p>N&#250;mero de intentos de supervisi&#243;n despu&#233;s de los cuales se sospecha que se producir&#225; un error en la instancia de servidor. El valor predeterminado es 3.</p>

</dd>
<dt>Heartbeat Frequency (Frecuencia de latido)</dt>
<dd><p>Tiempo que transcurre entre los intentos de supervisi&#243;n. El valor predeterminado es 2.000 milisegundos.</p>

</dd>
<dt>Group Discovery Timeout (Tiempo de espera de detecci&#243;n de grupos)</dt>
<dd><p>Tiempo que esperan los GMS para detectar otros miembros del cl&#250;ster. El valor predeterminado es 5.000 milisegundos.</p>

</dd>
<dt>Failure Verification Wait Time (Tiempo de espera para la verificaci&#243;n de errores)</dt>
<dd><p>Tiempo tras el cual un presunto error se considera comprobado. El valor predeterminado es 1.500 milisegundos.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Una tabla de propiedades adicionales para el Servicio de administraci&#243;n de grupos.</p>

<p>GlassFish Server no define propiedades adicionales para el Servicio de administraci&#243;n de grupos.</p>

<p>Para cada propiedad se muestra la informaci&#243;n siguiente:</p>

<dl><dt>Nombre</dt>
<dd><p>Nombre de la propiedad.</p>

</dd>
<dt>Valor</dt>
<dd><p>Valor de la propiedad que se define para la instancia seleccionada.</p>

</dd>
<dt>Descripci&#243;n</dt>
<dd><p>Descripci&#243;n textual que ofrece m&#225;s informaci&#243;n sobre la propiedad.</p>

</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&#233;n contiene las opciones siguientes.</p>

<dl><dt>Agregar propiedad</dt>
<dd><p>Bot&#243;n para agregar una propiedad. Al hacer clic en este bot&#243;n se a&#241;ade una fila a la tabla Propiedades adicionales.</p>

</dd>
<dt>Eliminar propiedades</dt>
<dd><p>Bot&#243;n para eliminar una o varias propiedades seleccionadas. Cualquier propiedad que se elimine vuelve a su valor predeterminado o, si no se ha definido ning&#250;n valor predeterminado, se queda sin definir.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-gmsenable.html">Para habilitar los Servicios de administraci&#243;n de grupos</a></p>

</li>
<li><p><a href="task-gms.html">Para configurar los Servicios de administraci&#243;n de grupos</a></p>

</li>
<li><p><a href="task-gmscluster.html">Para configurar los Servicios de administraci&#243;n de grupos para un cl&#250;ster</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
