<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-standalone-instance-app-undeploy"></a><h4>Para anular la implementaci&#243;n de aplicaciones de una instancia independiente de GlassFish Server</h4><a name="indexterm-106"></a><a name="indexterm-107"></a><p>Al anular la implementaci&#243;n de una aplicaci&#243;n se elimina la aplicaci&#243;n de
todos los destinos y del dominio. Cuando se anula la implementaci&#243;n de
una aplicaci&#243;n, la aplicaci&#243;n ya no aparece en la p&#225;gina <a href="../../../common/es/help/ref-applications.html">Aplicaciones</a> que
enumera todas las aplicaciones implementadas en GlassFish Server.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Instancias independientes.</b><p>Se abrir&#225; la p&#225;gina Instancias de servidor independientes.</p></li>
<li><b>En la p&#225;gina Instancias de servidor independientes, seleccione la instancia.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para la instancia.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general de la instancia, haga clic en la
ficha Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones para la instancia.</p></li>
<li><b>Para cada aplicaci&#243;n cuya implementaci&#243;n vaya a anular, seleccione la casilla de
verificaci&#243;n que aparece junto a ella en la tabla Aplicaciones implementadas.</b></li>
<li><b>Haga clic en Anular implementaci&#243;n.</b><p>Se le pedir&#225; que confirme que desea anular la implementaci&#243;n de las
aplicaciones.</p></li>
<li><b>Confirme que desea anular la implementaci&#243;n de las aplicaciones.</b><p>Se anula la implementaci&#243;n de las aplicaciones y estas se eliminan de
la tabla de aplicaciones implementadas de la p&#225;gina. </p></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Para crear una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Para suprimir instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">Para iniciar instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para detener instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para ver archivos de registro para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transacciones para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">Para implementar una aplicaci&#243;n en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">Para enumerar las aplicaciones que se han implementado en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Para eliminar aplicaciones de una instancia independiente de GlassFish Server</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Para editar una aplicaci&#243;n implementada en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Para habilitar o inhabilitar una aplicaci&#243;n implementada en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Para habilitar o inhabilitar el equilibrio de carga para una aplicaci&#243;n implementada en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Para crear un recurso para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">Para enumerar los recursos para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Para habilitar o inhabilitar un recurso para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Para editar un recurso para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Para establecer las propiedades de s&#243;lo instancia de una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Para ver datos de supervisi&#243;n de aplicaciones para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Para ver datos de supervisi&#243;n de servidor virtual para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Para ver los datos de supervisi&#243;n de recursos para una instancia de GlassFish Server independiente</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
