<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-recovertransactions"></a><h3>Para recuperar transacciones para una instancia de Servidor GlassFish agrupada en cl&#250;ster</h3><a name="indexterm-61"></a><a name="indexterm-62"></a><a name="indexterm-63"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Cl&#250;steres.</b></li>
<li><b>En el nodo Cl&#250;steres expandido, seleccione el nodo para el cl&#250;ster.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para el cl&#250;ster.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en la ficha Instancias. </b><p>Se abrir&#225; la p&#225;gina Instancias de servidor agrupadas para el cl&#250;ster.</p></li>
<li><b>Seleccione la instancia en la que se deben recuperar transacciones.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para la instancia.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n General, haga clic en Recuperar transacciones.</b><p>Se abrir&#225; la p&#225;gina Recuperar transacciones.</p><p>El contenido de la p&#225;gina depende de si la instancia se est&#225;
ejecutando.</p>
<ul><li><p>Si la instancia se est&#225; ejecutando, la p&#225;gina Recuperar transacciones solo contiene el texto <b>Recovery is performed by the running server itself</b> (La recuperaci&#243;n la realiza el propio servidor en ejecuci&#243;n) y el bot&#243;n Aceptar.</p>

</li>
<li><p>Si la instancia no se est&#225; ejecutando, la p&#225;gina Recuperar transacciones contiene opciones adicionales.</p>

</li></ul>
</li>
<li><b>En la lista desplegable Servidor de destino, seleccione otra instancia del mismo
cl&#250;ster que pueda recuperar transacciones en la instancia actual.</b></li>
<li><b>En el campo Directorio de registro de transacciones, escriba el directorio donde
se guardar&#225;n los registros de transacciones.</b><p>El valor predeterminado es <tt>/logs/tx</tt> en el directorio de dominio. Los registros
de transacciones se guardan en el subdirectorio <tt>tx</tt> del directorio especificado en
el campo Ubicaci&#243;n del registro de transacci&#243;n del servicio de transacci&#243;n para
la configuraci&#243;n del cl&#250;ster. El valor predeterminado de Ubicaci&#243;n del registro de
transacci&#243;n es el directorio especificado en el campo Ra&#237;z de registro de
la p&#225;gina Atributos de dominio, que est&#225; ubicada en la ficha Avanzado
del nodo Servidor GlassFish.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-create-clustered-instance.html">Para agregar una instancia de Servidor GlassFish a un cl&#250;ster</a></p>

</li>
<li><p><a href="task-delete-clustered-instances.html">Para suprimir instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">Para iniciar instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Para detener instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">Para ver archivos de registro para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">Para definir las propiedades de s&#243;lo instancia para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">Para ver datos de supervisi&#243;n de aplicaciones para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">Para ver datos de supervisi&#243;n de servidor virtual para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">Para ver datos de supervisi&#243;n de recursos para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
