<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-migrate-ejb-timers"></a><h3>Para migrar temporizadores EJB</h3><a name="indexterm-158"></a><a name="indexterm-159"></a><a name="indexterm-160"></a><p>Si se detiene una instancia de Servidor GlassFish, los temporizadores EJB (Enterprise
JavaBeans) instalados en dicha instancia tambi&#233;n se detendr&#225;n. Si la instancia se
ha detenido de forma anormal o inesperada, puede activar los temporizadores. Para
ello, ejec&#250;telos mientras la instancia est&#233; detenida y m&#237;grelos a una instancia
de servidor en ejecuci&#243;n del cl&#250;ster.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Cl&#250;steres.</b></li>
<li><b>En el nodo Cl&#250;steres del &#225;rbol de navegaci&#243;n, seleccione el cl&#250;ster.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para el cl&#250;ster.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en Migrar temporizadores EJB.</b><p>Se abrir&#225; la p&#225;gina Migrar temporizadores EJB.</p>
<hr><p><b>Nota - </b>Si todas las instancias del cl&#250;ster est&#225;n en ejecuci&#243;n, el bot&#243;n Migrar
temporizadores EJB estar&#225; desactivado.</p>


<hr>
</li>
<li><b>En la p&#225;gina Migrar temporizadores EJB, seleccione la instancia a la que
se migrar&#225;n los temporizadores y desde la cual se migrar&#225;n.</b><ol style="list-style-type: lower-alpha">
<li><b>En la lista desplegable Origen, seleccione la instancia detenida desde la cual
se migrar&#225;n los temporizadores.</b></li>
<li>(Opcional) <b>En la lista desplegable Destino, seleccione la instancia en ejecuci&#243;n a la
que se migrar&#225;n los temporizadores. </b></li>
<li><b>Haga clic en Aceptar.</b></li></ol></li>
<li><b>Detenga y reinicie la instancia a la cual se han migrado los
temporizadores EJB.</b><p>Si la instancia de origen se est&#225; ejecutando o la instancia de
destino no se est&#225; ejecutando, la Consola de administraci&#243;n mostrar&#225; un mensaje
de error.</p></li></ol>

<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
