<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-gmsenable"></a><h4>Para habilitar los Servicios de administraci&#243;n de grupos</h4><a name="indexterm-150"></a><a name="indexterm-151"></a><p>Los Servicios de administraci&#243;n de grupos (GMS) son servicios en curso que
proporcionan supervisi&#243;n del cl&#250;ster, pertenencia al cl&#250;ster y servicios de comunicaci&#243;n de
grupos. Los GMS realizan las funciones siguientes:</p>


<ul><li><p>Notifican los m&#243;dulos registrados en una instancia de GlassFish Server cuando se a&#241;aden o eliminan una o varias instancias en un cl&#250;ster, o cuando se sospecha o se confirma que han fallado.</p>

</li>
<li><p>Permiten enviar y recibir mensajes entre un grupo de procesos.</p>

</li></ul>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Cl&#250;steres.</b></li>
<li><b>Seleccione el cl&#250;ster para el que va a habilitar los Servicios de
administraci&#243;n de grupos (GMS).</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para el cl&#250;ster.</p></li>
<li><b>Seleccione la casilla Habilitado de GMS para activar los GMS para el
cl&#250;ster.</b><p>Esta opci&#243;n est&#225; seleccionada de forma predeterminada. Para inhabilitar los GMS para
el cl&#250;ster, quiete la marca de selecci&#243;n de la casilla Habilitado de
GMS.</p><p>Si est&#225;n habilitados, los Servicios de administraci&#243;n de grupos se inician en
cada instancia del servidor en el cl&#250;ster y en el servidor de
administraci&#243;n de dominios (DAS). El DAS participa en cada cl&#250;ster que tenga
los GMS habilitados.</p></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-gmscluster.html">Para configurar los Servicios de administraci&#243;n de grupos para un cl&#250;ster</a></p>

</li>
<li><p><a href="task-gms.html">Para configurar los Servicios de administraci&#243;n de grupos</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
