<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-stop-cluster"></a><h4>Para detener un cl&#250;ster</h4><a name="indexterm-9"></a><p>Al detener un cl&#250;ster se detienen todas las instancias de GlassFish Server
que est&#233;n en ejecuci&#243;n en dicho cl&#250;ster.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Cl&#250;steres.</b><p>Se abrir&#225; la p&#225;gina Cl&#250;steres.</p></li>
<li><b>En la p&#225;gina Cl&#250;steres, seleccione la casilla de verificaci&#243;n adyacente al nombre
del cl&#250;ster.</b></li>
<li><b>Haga clic en Detener cl&#250;ster.</b><p>Se le pedir&#225; que confirme que desea detener el cl&#250;ster.</p></li>
<li><b>Confirme que quiere detener el cl&#250;ster.</b><p>Se detendr&#225; el cl&#250;ster. El estado de cada instancia del cl&#250;ster se
actualiza en la p&#225;gina Cl&#250;steres cuando se detiene la instancia.</p></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-create-cluster.html">Para crear un cl&#250;ster</a></p>

</li>
<li><p><a href="task-delete-cluster.html">Para eliminar un cl&#250;ster</a></p>

</li>
<li><p><a href="task-availabilityservice.html">Para configurar las opciones de disponibilidad de un cl&#250;ster</a></p>

</li>
<li><p><a href="task-start-cluster.html">Para iniciar un cl&#250;ster</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">Para modificar la configuraci&#243;n de un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">Para implementar una aplicaci&#243;n en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">Para enumerar las aplicaciones que se han implementado en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">Para anular la implementaci&#243;n de aplicaciones de un cluster</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">Para eliminar aplicaciones de un cluster </a> </p>

</li>
<li><p><a href="task-cluster-app-edit.html">Para editar una aplicaci&#243;n que est&#225; implementada en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">Para habilitar o inhabilitar una aplicaci&#243;n que est&#225; implementada en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">Para habilitar o inhabilitar el equilibrio de carga para una aplicaci&#243;n implementada en un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">Para crear un recurso para un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">Para enumerar los recursos para un cl&#250;ster</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">Para habilitar o inhabilitar un recurso de forma global</a></p>

</li>
<li><p><a href="task-cluster-resource-edit.html">Para editar un recurso para un cl&#250;ster</a></p>

</li>
<li><p><a href="task-upgrade-components.html">Para actualizar componentes sin p&#233;rdida de servicio</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
