<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmsenable" name="task-gmsenable"></a><a id="GHCLU00078" name="GHCLU00078"></a></p>

<h4><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a>Activar el Servicio de Gesti&oacute;n de Grupos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El Servicio de Gesti&oacute;n de Grupos (GMS) es un servicio en curso que proporciona supervisi&oacute;n del cluster, pertenencia al cluster y servicios de comunicaci&oacute;n de grupos. Los GMS realizan las funciones siguientes:</p>
<ul>
<li>
<p>Notifican los m&oacute;dulos registrados en una instancia de GlassFish Server cuando se agregan o eliminan una o varias instancias en un cluster, o cuando se sospecha o se confirma que han fallado.</p>
</li>
<li>
<p>Permiten enviar y recibir mensajes entre un grupo de procesos.</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>Seleccione el cluster para el que va a activar el Servicio de Gesti&oacute;n de Grupos (GMS).</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n de activaci&oacute;n de GMS para activar los GMS para el cluster.</p>
<p>Esta opci&oacute;n est&aacute; seleccionada por defecto. Para desactivar los GMS para el cluster, quite la marca de selecci&oacute;n de la casilla de verificaci&oacute;n de activaci&oacute;n de GMS.</p>
<p>Si est&aacute; activado, el Servicio de Gesti&oacute;n de Grupos se inicia en cada instancia del servidor en el cluster y en el Servidor de Administraci&oacute;n de Dominio (DAS). El DAS participa en cada cluster que tenga los GMS activados.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref219" name="sthref219"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">Configurar Opciones del Servicio de Gesti&oacute;n de Grupos para un Cluster</a></p>
</li>
<li>
<p><a href="task-gms.html">Configurar el Servicio de Gesti&oacute;n de Grupos</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
