<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-config-sys-properties-defaults"></a><h3>Para definir los valores predeterminados de las propiedades del sistema de configuraci&#243;n</h3><p>Los valores predeterminados de las propiedades de configuraci&#243;n se definen en la
configuraci&#243;n a la que hace referencia el cl&#250;ster o la instancia.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo relativo a la configuraci&#243;n.</b></li>
<li><b>En la lista de tipos de propiedades bajo el nodo expandido, seleccione
Propiedades del sistema.</b><p>Se abrir&#225; la p&#225;gina Propiedades del sistema para la configuraci&#243;n seleccionada.</p><p>Esta p&#225;gina muestra los valores actuales de las siguientes propiedades del sistema
para la configuraci&#243;n:</p>
<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=ref-predefinedconfigsysproperties">N&#250;meros de puerto predefinidos cuando se cre&#243; la configuraci&#243;n</a></p>

</li>
<li><p>Propiedades personalizadas que se a&#241;aden a la configuraci&#243;n, si la hay</p>

</li></ul>
</li>
<li><b>Para asegurarse de que se apliquen los cambios sin necesidad de reiniciar
el cl&#250;ster o la instancia, seleccione la opci&#243;n Reconfiguraci&#243;n din&#225;mica.</b></li>
<li><b>Para cada propiedad para la que configure un valor predeterminado, escriba el
nuevo valor en el campo Valor predeterminado de la propiedad.</b></li>
<li><b>Defina los valores predeterminados para las propiedades adicionales que necesite.</b><ol style="list-style-type: lower-alpha">
<li><b>En la tabla Propiedades adicionales, haga clic en Agregar propiedad.</b><p>Se a&#241;ade una fila a la tabla Propiedades adicionales.</p></li>
<li><b>En el campo Nombre de variable de instancia, escriba el nombre de
la propiedad.</b></li>
<li><b>En el campo Valor predeterminado, escriba un valor.</b></li></ol></li>
<li><b>Haga clic en Guardar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-change-clustered-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de Servidor GlassFish independiente</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
