<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-app-remove" name="task-standalone-instance-app-remove"></a><a id="GHCLU00065" name="GHCLU00065"></a></p>

<h4><a id="sthref159" name="sthref159"></a><a id="sthref160" name="sthref160"></a>Eliminar Aplicaciones desde una Instancia de GlassFish Server Independiente</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Al eliminar una aplicaci&oacute;n, s&oacute;lo se elimina del destino actual. Cuando una aplicaci&oacute;n se elimina de un destino, la aplicaci&oacute;n sigue apareciendo en la p&aacute;gina <a href="../../../common/es/help/missingtopic.html">Aplicaciones</a> que enumera todas las aplicaciones desplegadas en GlassFish Server. La aplicaci&oacute;n tambi&eacute;n seguir&aacute; desplegada en otros objetivos en los que se hubiera desplegado.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Instancias Independientes.</p>
<p>Se abre la p&aacute;gina Instancias de Servidor Independientes.</p>
</li>
<li>
<p>En la p&aacute;gina Instancias de Servidor Independientes, seleccione la instancia.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General para la instancia, haga clic en el separador Aplicaciones.</p>
<p>Se abre la p&aacute;gina Aplicaciones para la instancia.</p>
</li>
<li>
<p>Para cada aplicaci&oacute;n que vaya a eliminar, seleccione la casilla de verificaci&oacute;n que aparece junto a ella en la tabla Aplicaciones Desplegadas.</p>
</li>
<li>
<p>Haga clic en Eliminar.</p>
<p>Se le pedir&aacute; que confirme que desea eliminar las aplicaciones.</p>
</li>
<li>
<p>Confirme que desea eliminar las aplicaciones.</p>
<p>Las aplicaciones se eliminan de la tabla de aplicaciones desplegadas de la p&aacute;gina.</p>
</li>
</ol>
<a id="sthref161" name="sthref161"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Crear una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suprimir Instancias de GlassFish Server Independientes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Iniciar Instancias de GlassFish Server Independientes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Parar Instancias de GlassFish Server Independientes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Ver Archivos Log para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Recuperar Transacciones para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Desplegar una Aplicaci&oacute;n en una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enumerar Aplicaciones que se Despliegan en una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Anular Despliegue de Aplicaciones desde una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Editar una Aplicaci&oacute;n que se Despliega en una instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activar o Desactivar una Aplicaci&oacute;n que se Despliega en una instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activar o Desactivar el Equilibrio de Carga para una Aplicaci&oacute;n que se Despliega en una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Crear un Recurso para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Enumerar Recursos para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activar o Desactivar un Recurso que se Despliega en una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Editar un Recurso para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modificar los N&uacute;meros de Puerto de una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Establecer Propiedades s&oacute;lo de Instancia para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Ver Datos de Supervisi&oacute;n de Aplicaci&oacute;n para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Ver Datos de Supervisi&oacute;n de Servidores Virtuales para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Ver Supervisi&oacute;n de Recursos para una Instancia de GlassFish Server Independiente</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
