<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-set-props-clustered-instance"></a><h3>Para definir las propiedades de s&#243;lo instancia para una instancia de Servidor GlassFish agrupada en cl&#250;ster</h3><a name="indexterm-67"></a><a name="indexterm-68"></a><a name="indexterm-69"></a><p>Las propiedades de una instancia de Servidor GlassFish incluyen informaci&#243;n de configuraci&#243;n
opcional acerca de la instancia.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Cl&#250;steres.</b></li>
<li><b>En el nodo Cl&#250;steres expandido, seleccione el nodo para el cl&#250;ster.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para el cl&#250;ster.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en la ficha Instancias. </b><p>Se abrir&#225; la p&#225;gina Instancias de servidor agrupadas para el cl&#250;ster.</p></li>
<li><b>Seleccione la instancia para la cual se modificar&#225;n las propiedades exclusivas de
la instancia.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para la instancia.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en la ficha Propiedades.</b></li>
<li><b>Si es necesario, haga clic en la ficha Propiedades de instancia.</b><p>Se abrir&#225; la p&#225;gina Propiedades de la instancia.</p><p>Esta p&#225;gina muestra una lista de las propiedades que se establecen para
la instancia seleccionada de Servidor GlassFish.</p></li>
<li><b>Para cada propiedad que est&#233; modificando, escriba el nuevo valor en el
campo Valor de la propiedad.</b></li>
<li><b>Establezca los valores que necesite en las dem&#225;s propiedades.</b><ol style="list-style-type: lower-alpha">
<li><b>En la tabla Propiedades adicionales, haga clic en Agregar propiedad.</b><p>Se a&#241;ade una fila a la tabla Propiedades adicionales.</p></li>
<li><b>En el campo Nombre, escriba un nombre para la propiedad.</b></li>
<li><b>En el campo Valor, escriba el valor.</b></li>
<li><b>En el campo Descripci&#243;n, escriba una breve descripci&#243;n de la propiedad.</b></li></ol></li>
<li><b>Haga clic en Guardar.</b></li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="task-create-clustered-instance.html">Para agregar una instancia de Servidor GlassFish a un cl&#250;ster</a></p>

</li>
<li><p><a href="task-delete-clustered-instances.html">Para suprimir instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">Para iniciar instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Para detener instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">Para ver archivos de registro para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-recovertransactions.html">Para recuperar transacciones para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">Para ver datos de supervisi&#243;n de aplicaciones para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">Para ver datos de supervisi&#243;n de servidor virtual para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">Para ver datos de supervisi&#243;n de recursos para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
