<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a><a id="GHCLU00079" name="GHCLU00079"></a></p>

<h4><a id="sthref220" name="sthref220"></a>Configurar Opciones del Servicio de Gesti&oacute;n de Grupos para un Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El Servicio de Gesti&oacute;n de Grupos (GMS) es un servicio en curso que proporciona supervisi&oacute;n del cluster, pertenencia al cluster y servicios de comunicaci&oacute;n de grupos. Los GMS realizan las funciones siguientes:</p>
<ul>
<li>
<p>Notifican los m&oacute;dulos registrados en una instancia de GlassFish Server cuando se agregan o eliminan una o varias instancias en un cluster, o cuando se sospecha o se confirma que han fallado.</p>
</li>
<li>
<p>Permiten enviar y recibir mensajes entre un grupo de procesos.</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>Seleccione el cluster para el que va a configurar el Servicio de Gesti&oacute;n de Grupos (GMS).</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>Seleccione la casilla de verificaci&oacute;n de activaci&oacute;n de GMS para activar los GMS para el cluster.</p>
<p>Esta opci&oacute;n est&aacute; seleccionada por defecto. Para desactivar los GMS para el cluster, quite la marca de selecci&oacute;n de la casilla de verificaci&oacute;n de activaci&oacute;n de GMS.</p>
<p>Si est&aacute; activado, el Servicio de Gesti&oacute;n de Grupos se inicia en cada instancia del servidor en el cluster y en el Servidor de Administraci&oacute;n de Dominio (DAS). El DAS participa en cada cluster que tenga los GMS activados.</p>
</li>
<li>
<p>En el campo Puerto de Multidifusi&oacute;n, especifique el puerto que utiliza el Servicio de Gesti&oacute;n de Grupos para escuchar los eventos del grupo.</p>
<p>Especifique un n&uacute;mero de puerto UDP est&aacute;ndar entre 2048 y 32000. El valor por defecto se genera autom&aacute;ticamente dentro de este rango.</p>
</li>
<li>
<p>En el campo Direcci&oacute;n de Multidifusi&oacute;n, especifique la direcci&oacute;n que utiliza el Servicio de Gesti&oacute;n de Grupos para escuchar los eventos del grupo.</p>
<p>Especifique una direcci&oacute;n de multidifusi&oacute;n IP de clase D. Las direcciones IP de clase D est&aacute;n en el rango <code>224.0.0.0</code> a <code>239.255.255.255</code>, inclusive. La direcci&oacute;n <code>224.0.0.0</code> est&aacute; reservada y no debe utilizarse. El valor por defecto es 228.9.<i>XX</i>. <i>YY</i>, donde <i>XX</i> e <i>YY</i> son valores independientes generados autom&aacute;ticamente entre 0 y 255.</p>
</li>
<li>
<p>En el campo Direcci&oacute;n de Interfaz de Enlace, indique la direcci&oacute;n de la interfaz de red para el Servicio de Gesti&oacute;n de Grupos si hay m&aacute;s de una interfaz de red.</p>
<p>Esta opci&oacute;n permite configurar la interfaz de red que se utilizar&aacute; para los GMS si hay m&aacute;s de una en cualquiera de los equipos en los que se alojan las instancias de servidor del cluster. Este valor debe ser una direcci&oacute;n IP de una interfaz de red local. Por defecto, se utilizan todas las direcciones de interfaz de red p&uacute;blicas.</p>
<p>Para especificar una direcci&oacute;n que sea v&aacute;lida para todas las instancias de GlassFish Server del cluster, utilice una propiedad del sistema para establecer la direcci&oacute;n de forma individual para cada instancia.</p>
<p>Por ejemplo, cree la propiedad del sistema <code>GMS-BIND-INTERFACE-ADDRESS-</code>nombre_cluster en el DAS. A continuaci&oacute;n, configure la opci&oacute;n Direcci&oacute;n de Interfaz de Enlace como <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>nombre_cluster</i><code>}</code> para especificar la propiedad del sistema. Por &uacute;ltimo, para cada instancia del cluster, defina la propiedad del sistema <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> en la direcci&oacute;n de interfaz de red necesaria de la m&aacute;quina de la instancia.</p>
</li>
<li>
<p>Para especificar propiedades adicionales, seleccione el separador Propiedades y el subseparador Propiedades del Cluster.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, escriba el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite su campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, seleccione la casilla de verificaci&oacute;n a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Activar el Servicio de Gesti&oacute;n de Grupos</a></p>
</li>
<li>
<p><a href="task-gms.html">Configurar el Servicio de Gesti&oacute;n de Grupos</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
