<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-change-standalone-instance-ports"></a><h4>Para modificar los n&#250;meros de puerto de una instancia de GlassFish Server independiente</h4><a name="indexterm-131"></a><a name="indexterm-132"></a><a name="indexterm-133"></a><p>Los n&#250;meros de puerto de una instancia de GlassFish Server independiente se
establecen inicialmente en la configuraci&#243;n a la que hace referencia la instancia.
Debe modificar estos n&#250;meros de puerto si, por ejemplo, dos instancias que
hacen referencia a la misma configuraci&#243;n residen en el mismo host. En
este caso, los n&#250;meros de puerto de una instancia deben modificarse porque
ambas instancias hacen referencia a la misma configuraci&#243;n.</p>

<p>Los n&#250;meros de puerto de una instancia se guardan como propiedades del
sistema Java. Estas propiedades se transfieren al lanzador de aplicaciones Java mediante
la opci&#243;n <tt>-D</tt> del lanzador de aplicaciones Java cuando se inicia GlassFish
Server. </p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Instancias independientes.</b><p>Se abrir&#225; la p&#225;gina Instancias de servidor independientes.</p></li>
<li><b>Seleccione la instancia para la cual se modificar&#225;n los n&#250;meros de puerto.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para la instancia.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en la ficha Propiedades.</b><p>Se abrir&#225; la p&#225;gina Instance System Properties (Propiedades de sistema de la
instancia).</p><p>Esta p&#225;gina muestra los valores actuales de las siguientes propiedades del sistema
para la instancia:</p>
<ul><li><p><a href="../../../common/es/help/ref-predefinedconfigsysproperties.html">N&#250;meros de puerto predefinidos en la configuraci&#243;n de la instancia</a></p>

</li>
<li><p>Propiedades personalizadas que se definen para la instancia, si las hay</p>

</li></ul>
</li>
<li><b>Para cada propiedad que vaya a modificar, escriba el nuevo valor en
el campo Reemplazar valor para la propiedad.</b></li>
<li><b>Establezca los valores que necesite en las dem&#225;s propiedades.</b><ol style="list-style-type: lower-alpha">
<li><b>En la tabla Propiedades adicionales, haga clic en Agregar propiedad.</b><p>Se a&#241;ade una fila a la tabla Propiedades adicionales.</p></li>
<li><b>En el campo Nombre de variable de instancia, escriba el nombre de
la propiedad.</b></li>
<li><b>En el campo Reemplazar valor, escriba el valor.</b></li></ol></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-create-standalone-instance.html">Para crear una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">Para suprimir instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">Para iniciar instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">Para detener instancias de GlassFish Server independientes</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">Para ver archivos de registro para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">Para recuperar transacciones para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">Para implementar una aplicaci&#243;n en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">Para enumerar las aplicaciones que se han implementado en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">Para anular la implementaci&#243;n de aplicaciones de una instancia independiente de GlassFish Server</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">Para eliminar aplicaciones de una instancia independiente de GlassFish Server</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">Para editar una aplicaci&#243;n implementada en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">Para habilitar o inhabilitar una aplicaci&#243;n implementada en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">Para habilitar o inhabilitar el equilibrio de carga para una aplicaci&#243;n implementada en una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">Para crear un recurso para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">Para enumerar los recursos para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">Para habilitar o inhabilitar un recurso para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">Para editar un recurso para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">Para establecer las propiedades de s&#243;lo instancia de una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">Para ver datos de supervisi&#243;n de aplicaciones para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">Para ver datos de supervisi&#243;n de servidor virtual para una instancia de GlassFish Server independiente</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">Para ver los datos de supervisi&#243;n de recursos para una instancia de GlassFish Server independiente</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
