<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-editnode"></a><h4>Para editar un nodo</h4><a name="indexterm-157"></a><p>Al editar un nodo se actualizan los datos de configuraci&#243;n de un
nodo de GlassFish Server. La edici&#243;n de un nodo tambi&#233;n permite modificar
el tipo de nodo de CONFIG a SSH para habilitar la comunicaci&#243;n
SSH para el nodo.</p>

<p>Si cambia el tipo de nodo de CONFIG a SSH , se
aplicar&#225;n los valores predeterminados si se deja vac&#237;o cualquiera de los campos
siguientes:</p>


<ul><li><p>Puerto SSH</p>

</li>
<li><p>Nombre de usuario SSH </p>

</li>
<li><p>Archivo de claves</p>

</li></ul>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Nodos.</b></li>
<li><b>En la lista de nodos, seleccione el nodo que vaya a editar.</b><p>Se abrir&#225; la p&#225;gina Editar nodo.</p></li>
<li><b>En la lista desplegable Tipo, seleccione el tipo de nodo actualizado.</b><ul>
<li><b>Para permitir que el nodo admita la comunicaci&#243;n sobre Secure Shell (SSH),
seleccione SSH.</b></li>
<li><b>Para que el nodo deje de admitir la configuraci&#243;n remota, seleccione CONFIG.</b><p>Si selecciona CONFIG, no se mostrar&#225; ninguna opci&#243;n para la configuraci&#243;n de
SSH. Si el tipo actual del nodo es SSH y selecciona CONFIG,
se eliminar&#225;n los datos de configuraci&#243;n SSH de la configuraci&#243;n del nodo
cuando guarde los cambios.</p></li></ul></li>
<li><b>En el campo Host de nodo, indique el nombre del host que
representar&#225; el nodo actualizado.</b><p>Este campo es obligatorio o no en funci&#243;n del tipo de nodo:</p>
<ul><li><p>Si el tipo de nodo es CONFIG., el nombre del host puede omitirse. El nombre del host se puede determinar al crear las instancias que residen en el nodo.</p>

</li>
<li><p>Si el tipo de nodo es SSH, se debe especificar el nombre del host. De lo contrario, se produce un error.</p>

</li></ul>
</li>
<li><b>En el campo Directorio de nodos, indique la ruta al directorio que
contendr&#225; las instancias de GlassFish Server que se crean en el nodo.</b><p>Si especifica una ruta relativa, la ruta es relativa al directorio <i>as-install</i>,
donde <i>as-install</i> es el directorio base de instalaci&#243;n del software GlassFish Server
en el host.</p></li>
<li><b>En el campo Directorio de instalaci&#243;n, especifique la ruta completa al directorio
principal del directorio base de instalaci&#243;n del software GlassFish Server en el
host, por ejemplo <tt>/export/glassfish3/</tt>.</b></li>
<li><b>Para forzar al nodo a que se cree en la configuraci&#243;n del
servidor de administraci&#243;n de dominios (DAS) aunque falle la validaci&#243;n de los
par&#225;metros del nodo, habilite la opci&#243;n Forzar.</b></li>
<li><b>En el campo Puerto SSH, escriba el puerto que se utilizar&#225; para
las conexiones SSH con el host de este nodo.</b><p>Si cambia el tipo de nodo de CONFIG a SSH y deja
este campo vac&#237;o, la opci&#243;n Puerto SSH se establece en 22.</p></li>
<li><b>En el campo Nombre de usuario, escriba el nombre del usuario del
host de este nodo que ejecutar&#225; el proceso para conectar al host
mediante SSH.</b><p>Si cambia el tipo de nodo de CONFIG a SSH y deja
este campo vac&#237;o, la opci&#243;n Nombre de usuario SSH se configura con
el usuario que ejecuta el proceso DAS.</p></li>
<li><b>Especifique c&#243;mo se autenticar&#225; el usuario de SSH al iniciar sesi&#243;n en
el host de este nodo.</b><ul>
<li><b>Para especificar la autenticaci&#243;n a trav&#233;s de un archivo de claves privadas
SSH, efect&#250;e los pasos siguientes:</b><ol style="list-style-type: lower-alpha">
<li><b>Seleccione Archivo de claves en la lista desplegable Autenticaci&#243;n de usuario de
SSH.</b></li>
<li><b>En el campo Archivo de claves, escriba la ruta absoluta al archivo
de claves privadas SSH para el usuario especificado en la opci&#243;n Nombre
de usuario. </b>
<hr><p><b>Nota - </b>GlassFish Server tambi&#233;n admite la autenticaci&#243;n con contrase&#241;a a trav&#233;s de la
entrada <tt>AS_ADMIN_SSHPASSWORD</tt> en el archivo de contrase&#241;as. El archivo de contrase&#241;as se
configura en la opci&#243;n <tt>--paswordfile</tt> de la utilidad <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=asadmin-1m"><tt>asadmin</tt>(1M)</a>.</p>


<hr>
<p>Si cambia el tipo de nodo de CONFIG a SSH y deja
este campo vac&#237;o, la opci&#243;n Archivo de claves se configura a un
archivo de claves situado en el directorio <tt>.ssh</tt> del usuario. Si se
encuentran varios archivos de claves, GlassFish Server utiliza el siguiente orden de
preferencia:</p>
<ul><li><p><tt>id_rsa</tt></p>

</li>
<li><p><tt>id_dsa</tt></p>

</li>
<li><p><tt>identity</tt></p>

</li></ul>
</li></ol></li>
<li><b>Para especificar autenticaci&#243;n mediante una contrase&#241;a guardada en la configuraci&#243;n de DAS,
efect&#250;e los pasos siguientes:</b>
<hr><p><b>Precauci&#243;n - </b>Esta contrase&#241;a se almacena en forma de texto en la configuraci&#243;n de
DAS. Para mayor seguridad, utilice un archivo de claves o un alias
de contrase&#241;a.</p>


<hr>
<ol style="list-style-type: lower-alpha">
<li><b>Seleccione Contrase&#241;a en la lista desplegable Autenticaci&#243;n de usuario de SSH.</b></li>
<li><b>En el campo Contrase&#241;a SSH, escriba la contrase&#241;a que el usuario de
SSH utilizar&#225; al conectarse al host de este nodo. </b></li>
<li><b>En el campo Confirmar contrase&#241;a SSH, vuelva a escribir la contrase&#241;a.</b></li></ol></li>
<li><b>Para especificar autenticaci&#243;n mediante un alias de contrase&#241;a, efect&#250;e los pasos siguientes:</b><ol style="list-style-type: lower-alpha">
<li><b>Seleccione Alias de contrase&#241;a en la lista desplegable Autenticaci&#243;n de usuario de
SSH.</b></li>
<li><b>En la lista desplegable Alias de contrase&#241;a, seleccione un alias existente.</b></li></ol></li></ul></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-createnode.html">Para crear un nodo</a></p>

</li>
<li><p><a href="task-deletenode.html">Para suprimir nodos</a></p>

</li>
<li><p><a href="task-listnodes.html">Para enumerar todos los nodos en el dominio actual</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
