<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-view-logs-clustered-instance"></a><h3>Para ver archivos de registro para una instancia de Servidor GlassFish agrupada en cl&#250;ster</h3><a name="indexterm-57"></a><a name="indexterm-58"></a><a name="indexterm-59"></a><a name="indexterm-60"></a><p><b>Antes de empezar</b></p><p>La instancia cuyos archivos de registro desea ver debe estar en ejecuci&#243;n.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Cl&#250;steres.</b></li>
<li><b>En el nodo Cl&#250;steres expandido, seleccione el nodo para el cl&#250;ster.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para el cl&#250;ster.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en la ficha Instancias. </b><p>Se abrir&#225; la p&#225;gina Instancias de servidor agrupadas para el cl&#250;ster.</p></li>
<li><b>Seleccione la instancia para la cual desea ver los archivos de registro.</b><p>Se abrir&#225; la p&#225;gina Informaci&#243;n general para la instancia.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en Visualizar archivos de registro.</b><p>Se abre una ventana con el Visualizador de registros.</p>
<hr><p><b>Nota - </b>La instancia ya debe estar en ejecuci&#243;n. Si la instancia no est&#225;
ejecut&#225;ndose, el bot&#243;n Visualizar archivos de registro estar&#225; desactivado.</p>


<hr>
</li></ol><p></b>V&#233;ase tambi&#233;n</b></p>
<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3028&id=task-filter-logs">Para filtrar los registros mostrados</a></p>

</li>
<li><p><a href="task-create-clustered-instance.html">Para agregar una instancia de Servidor GlassFish a un cl&#250;ster</a></p>

</li>
<li><p><a href="task-delete-clustered-instances.html">Para suprimir instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">Para iniciar instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">Para detener instancias de Servidor GlassFish agrupadas en cl&#250;ster</a></p>

</li>
<li><p><a href="task-recovertransactions.html">Para recuperar transacciones para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">Para modificar los n&#250;meros de puerto de una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">Para definir las propiedades de s&#243;lo instancia para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">Para ver datos de supervisi&#243;n de aplicaciones para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">Para ver datos de supervisi&#243;n de servidor virtual para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">Para ver datos de supervisi&#243;n de recursos para una instancia de Servidor GlassFish agrupada en cl&#250;ster</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
