<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-javamailsessionsedit"></a><h4>Editar sess&#227;o JavaMail</h4>
<a name="indexterm-23"></a><p>Utilize a p&#225;gina Editar sess&#227;o JavaMail para editar uma sess&#227;o JavaMail.</p>

<p>A p&#225;gina Editar sess&#227;o JavaMail cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar com os valores padr&#227;o as configura&#231;&#245;es que apresentam valores padr&#227;o. As configura&#231;&#245;es que n&#227;o apresentam valores padr&#227;o n&#227;o s&#227;o alteradas.</p>

</dd>
<dt>Nome JNDI</dt>
<dd><p>Um nome exclusivo que identifica a sess&#227;o JavaMail. O nome JNDI &#233; um campo somente leitura. Voc&#234; somente pode especificar o nome JNDI quando cria uma nova sess&#227;o JavaMail.</p>

</dd>
<dt>Host de correio</dt>
<dd><p>O nome do host do servidor de correio padr&#227;o. Os m&#233;todos de conex&#227;o dos objetos Armazenamento e Transporte usam esse valor se n&#227;o &#233; fornecida uma propriedade de host espec&#237;fica do protocolo. O nome deve ser resol&#250;vel para um nome de host real.</p>

</dd>
<dt>Usu&#225;rio padr&#227;o</dt>
<dd><p>O nome de usu&#225;rio a ser fornecido ao conectar-se a um servidor de correio. Os m&#233;todos de conex&#227;o dos objetos Armazenamento e Transporte usam esse valor se n&#227;o &#233; fornecida uma propriedade de nome de usu&#225;rio espec&#237;fica do protocolo. O nome de usu&#225;rio deve conter somente caracteres alfanum&#233;ricos, sublinhado, tra&#231;o ou ponto.</p>

</dd>
<dt>Endere&#231;o padr&#227;o do remetente</dt>
<dd><p>O endere&#231;o de e-mail do usu&#225;rio padr&#227;o. O formato &#233; <i>nome de usu&#225;rio</i><tt>@</tt><i>host</i><i>dom&#237;nio</i>.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o dessa sess&#227;o de correio.</p>

</dd>
<dt>Status</dt>
<dd><p>O status da sess&#227;o de correio. A sess&#227;o de correio pode ser ativada ou desativada. O valor padr&#227;o &#233; Ativo.</p>

</dd>
<dt>Protocolo de armazenamento</dt>
<dd><p>O servi&#231;o de protocolo de armazenamento, que se conecta a um servidor de correio, recuperar mensagens e as salva em uma ou mais pastas. Os valores permitidos s&#227;o <tt>imap</tt>, <tt>pop3</tt>, <tt>imaps</tt> e <tt>pop3s</tt>. O valor padr&#227;o &#233; <tt>imap</tt>.</p>

</dd>
<dt>Classe do protocolo de armazenamento</dt>
<dd><p>A classe de implementa&#231;&#227;o do provedor do servi&#231;o para armazenamento. Os valores permitidos s&#227;o:</p>


<ul><li><p><tt>com.sun.mail.imap.IMAPStore</tt></p>

</li>
<li><p><tt>com.sun.mail.pop3.POP3Store</tt></p>

</li>
<li><p><tt>com.sun.mail.imap.IMAPSSLStore</tt></p>

</li>
<li><p><tt>com.sun.mail.pop3.POP3SSLStore</tt></p>

</li></ul>
<p>O valor padr&#227;o &#233; <tt>com.sun.mail.imap.IMAPStore</tt>.</p>

</dd>
<dt>Protocolo de transporte</dt>
<dd><p>O servi&#231;o de protocolo de transporte, que envia mensagens. Os valores permitidos s&#227;o <tt>smtp</tt> e <tt>smtps</tt>. O valor padr&#227;o &#233; <tt>smtp</tt>.</p>

</dd>
<dt>Classe do protocolo de transporte</dt>
<dd><p>A classe de implementa&#231;&#227;o do provedor do servi&#231;o de transporte. Os valores permitidos s&#227;o:</p>


<ul><li><p><tt>com.sun.mail.smtp.SMTPTransport</tt></p>

</li>
<li><p><tt>com.sun.mail.smtp.SMTPSSLTransport</tt></p>

</li></ul>
<p>O valor padr&#227;o &#233; <tt>com.sun.mail.smtp.SMTPTransport</tt>.</p>

</dd>
<dt>Depura&#231;&#227;o</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, a depura&#231;&#227;o para esse recurso &#233; ativada. Se o n&#237;vel de log JavaMail estiver definido como <tt>BOM</tt> ou melhor, a sa&#237;da de depura&#231;&#227;o &#233; gerada e inclu&#237;da no arquivo de log do sistema. Para obter informa&#231;&#245;es sobre a configura&#231;&#227;o do n&#237;vel de log, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3031&id=task-eelogginglevels">Para configurar n&#237;veis de log</a>.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais para a sess&#227;o JavaMail. Para obter uma lista das propriedades dispon&#237;veis, consulte a documenta&#231;&#227;o da JavaMail API em <a href="http://java.sun.com/products/javamail/javadocs/index.html"></a>. Propriedades adicionais devem come&#231;ar com <tt>mail-</tt> e devem usar h&#237;fens, n&#227;o pontos, como separadores. Por exemplo, <tt>mail-debug</tt> &#233; correto, mas <tt>mail.debug</tt> n&#227;o. O back-end do Servidor GlassFish converte os h&#237;fens nos pontos esperados pela JavaMail API.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-javamailsessioncreate.html">Para criar uma sess&#227;o JavaMail</a></p>

</li>
<li><p><a href="task-javamailsessionsedit.html">Para editar uma sess&#227;o JavaMail</a></p>

</li>
<li><p><a href="task-javamailsessionsdelete.html">Para excluir uma sess&#227;o JavaMail</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-javamail-resource-1"><tt>create-javamail-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-javamail-resources-1"><tt>list-javamail-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-javamail-resource-1"><tt>delete-javamail-resource</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
