<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jndicustomresourcenew"></a><h4>Novo recurso personalizado</h4>
<a name="indexterm-27"></a><a name="indexterm-28"></a><a name="indexterm-29"></a><p>Utilize a p&#225;gina Novo recurso personalizado para criar um recuso JNDI personalizado.</p>

<p>A p&#225;gina Novo recurso personalizado cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Nome JNDI</dt>
<dd><p>Um nome exclusivo que identifica o recurso.</p>

</dd>
<dt>Tipo de recurso</dt>
<dd><p>A defini&#231;&#227;o de tipo totalmente qualificado para o recurso.</p>

</dd>
<dt>Classe de f&#225;brica</dt>
<dd><p>O nome especificado de usu&#225;rio para a classe de f&#225;brica. Essa classe implementa a interface <tt>javax.naming.spi.ObjectFactory</tt>.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do recurso personalizado.</p>

</dd>
<dt>Status</dt>
<dd><p>O status do recurso personalizado. O recurso personalizado pode ser ativado ou desativado. O valor padr&#227;o &#233; Ativo.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais para o recurso personalizado. O Servidor GlassFish n&#227;o define quaisquer propriedades adicionais para recursos personalizados.</p>

</dd>
<dt>Destinos</dt>
<dd><p>Clusters e inst&#226;ncias independentes do recurso personalizado. Mova os destinos desejados para a coluna Destinos selecionados utilizando os bot&#245;es Adicionar e Adicionar tudo. Mova os destinos desnecess&#225;rios para a coluna Destinos dispon&#237;veis utilizando os bot&#245;es Remover e Remover tudo.</p>

<p>Esta op&#231;&#227;o &#233; exibida somente se os clusters ou inst&#226;ncias independentes tiverem sido criados no dom&#237;nio.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jndicustomresourcenew.html">Para criar um recurso JNDI</a></p>

</li>
<li><p><a href="task-jndicustomresourceedit.html">Para editar um recurso JNDI personalizado</a></p>

</li>
<li><p><a href="task-jndicustomresourcedelete.html">Para excluir um recurso JNDI personalizado</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-custom-resource-1"><tt>create-custom-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-custom-resources-1"><tt>list-custom-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-custom-resource-1"><tt>delete-custom-resource</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
