<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndicustomresourceedit" name="task-jndicustomresourceedit"></a><a id="GHJML00016" name="GHJML00016"></a></p>

<h4><a id="sthref13" name="sthref13"></a><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Para Editar um Recurso Personalizado da JNDI</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; JNDI.</p>
</li>
<li>
<p>No n&oacute; JNDI, selecione Recursos personalizados.</p>
<p>A p&aacute;gina Recursos personalizados &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos personalizados, clique no nome do recurso a ser editado.</p>
<p>A p&aacute;gina Editar recurso personalizado &eacute; aberta.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; pode especificar o nome JNDI ao criar um novo recurso personalizado.
<hr>

</li>
<li>
<p>Para modificar o Tipo de recurso, efetue um dos procedimentos a seguir.</p>
<ul>
<li>
<p>Na lista drop-down, selecione uma defini&ccedil;&atilde;o de tipo.</p>
</li>
<li>
<p>Selecione o segundo bot&atilde;o de r&aacute;dio e digite uma defini&ccedil;&atilde;o de tipo totalmente qualificada que siga o formato <i>xxx</i><code>.</code><i>xxx</i>.</p>
</li>
</ul>
</li>
<li>
<p>No campo Classe de f&aacute;brica, digite um nome de classe de f&aacute;brica para o recurso personalizado.</p>
<p>A Classe de f&aacute;brica &eacute; o nome especificado de usu&aacute;rio para a classe de f&aacute;brica. Essa classe implementa a interface <code>javax.naming.spi.ObjectFactory</code>.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o breve do recurso.</p>
<p>Essa descri&ccedil;&atilde;o &eacute; um valor de string e pode incluir um m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status ativo para ativar o recurso.</p>
<p>Por default, o recurso est&aacute; ativado, significando que est&aacute; dispon&iacute;vel assim que &eacute; criado.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades adicionais, especifique propriedades adicionais do recurso personalizado.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para recursos personalizados.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar propriedade. Na linha em branco que &eacute; exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jndicustomresourcenew.html">Para Criar um Recurso Personalizado da JNDI</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">Para Deletar um Recurso Personalizado da JNDI</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcecreate.html">recursos externosPara Criar um Recurso Externo da JNDI</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourceedit.html">Para Editar um Recurso Externo da JNDI</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">Para Deletar um Recurso Externo da JNDI</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
