<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jndicustomresourcenew"></a><h3>Para criar um recurso JNDI</h3><a name="indexterm-4"></a><a name="indexterm-5"></a><a name="indexterm-6"></a><a name="indexterm-7"></a><p>Um recurso JNDI personalizado especifica uma f&#225;brica de objetos de recursos personalizada
para todos os servidores.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>No n&#243; Recursos, expanda o n&#243; JNDI.</b></li>
<li><b>No n&#243; JNDI, selecione Recursos personalizados.</b><p>A p&#225;gina Recursos personalizados &#233; aberta.</p></li>
<li><b>Na p&#225;gina Recursos personalizados, clique em Novo.</b><p>Abre-se a p&#225;gina Novo recurso personalizado.</p></li>
<li><b>No campo Nome JNDI, digite um nome exclusivo.</b><p>Esse nome ser&#225; registrado no servi&#231;o de nomea&#231;&#227;o de JNDI. O nome
JNDI organiza e localiza os componentes em um ambiente de computa&#231;&#227;o distribu&#237;do,
de maneira semelhante ao cat&#225;logo de cart&#227;o que organiza e representa os
locais de livros em uma biblioteca.  Por conseguinte, o nome JNDI
se torna um m&#233;todo importante de acesso ao recurso personalizado.</p></li>
<li><b>No campo Tipo de recurso, efetue um dos procedimentos a seguir.</b><ul>
<li><b>Na lista suspensa, selecione uma defini&#231;&#227;o de tipo.</b></li>
<li><b>Selecione o segundo bot&#227;o de op&#231;&#245;es e digite uma defini&#231;&#227;o de tipo
totalmente qualificado que siga o formato <tt><i>xxx</i>.<i>xxx</i></tt>.</b></li></ul></li>
<li><b>No campo Classe de f&#225;brica, digite um nome de classe de f&#225;brica
para o recurso personalizado a ser criado.</b><p>A Classe de f&#225;brica &#233; o nome especificado de usu&#225;rio para a
classe de f&#225;brica. Essa classe implementa a interface <tt>javax.naming.spi.ObjectFactory</tt>.</p></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o breve do recurso.</b><p>Essa descri&#231;&#227;o &#233; um valor de sequ&#234;ncia e pode incluir um m&#225;ximo
de 250 caracteres.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Status ativo para ativar o recurso.</b><p>Por padr&#227;o, o recurso est&#225; ativado, significando que est&#225; dispon&#237;vel assim que
&#233; criado.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique propriedades adicionais do recurso personalizado.</b><p>O Servidor GlassFish n&#227;o define propriedades adicionais para recursos personalizados.</p><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p></li>
<li><b>Clique em OK.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-jndicustomresourceedit.html">Para editar um recurso JNDI personalizado</a></p>

</li>
<li><p><a href="task-jndicustomresourcedelete.html">Para excluir um recurso JNDI personalizado</a></p>

</li>
<li><p><a href="task-jndiexternalresourcecreate.html">Para criar um recurso JNDI externo</a></p>

</li>
<li><p><a href="task-jndiexternalresourceedit.html">Para editar um recurso JNDI externo</a></p>

</li>
<li><p><a href="task-jndiexternalresourcedelete.html">Para excluir u recurso JNDI externo</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
