<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbcontaineravailability" name="task-ejbcontaineravailability"></a><a id="GHEJB00006" name="GHEJB00006"></a></p>

<h4><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a><a id="sthref13" name="sthref13"></a>Configurare le impostazioni di disponibilit&agrave; per il contenitore EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Nell'albero di navigazione espandere il nodo Configurazione.</p>
</li>
<li>
<p>Selezionare la configurazione da modificare.</p>
</li>
<li>
<p>Nel nodo Configurazione, selezionare il nodo Servizio disponibilit&agrave;.</p>
<p>Viene visualizzata la pagina Servizio disponibilit&agrave;.</p>
</li>
<li>
<p>Nella pagina Servizio disponibilit&agrave;, fare clic sulla scheda Disponibilit&agrave; contenitore EJB.</p>
<p>Viene visualizzata la pagina Disponibilit&agrave; contenitore EJB.</p>
</li>
<li>
<p>Selezionare la casella Servizio disponibilit&agrave; abilitato per abilitare la disponibilit&agrave; per il contenitore EJB.</p>
<p>Per disabilitare la disponibilit&agrave;, rimuovere il segno di spunta dalla casella Servizio disponibilit&agrave; abilitato.</p>
</li>
<li>
<p>L'opzione Tipo di persistenza HA &egrave; impostata su <code>replicated</code>.</p>
<p>Si tratta del meccanismo di persistenza utilizzato quando la casella Servizio disponibilit&agrave; abilitato &egrave; selezionata. La persistenza si basa su failover in un cluster. Non modificare questo valore.</p>
</li>
<li>
<p>L'opzione Tipo di persistenza SFSB &egrave; impostata su <code>file</code>.</p>
<p>Si tratta del meccanismo di persistenza utilizzato quando la casella Servizio disponibilit&agrave; abilitato <i>non</i> &egrave; selezionata. La persistenza si basa sul file system. Non modificare questo valore.</p>
<p>Il campo Posizione di memorizzazione sessione determina la posizione in cui gli stati dei checkpoint SFSB vengono resi persistenti. Per impostare Posizione di memorizzazione sessione, vedere <a href="../../../ejb-lite/it/help/missingtopic.html">To Configure EJB Settings</a>.</p>
</li>
<li>
<p>Per ripristinare valori predefiniti, fare clic sul pulsante Carica impostazioni predefinite.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>In GlassFish Server non &egrave; definita alcuna propriet&agrave; aggiuntiva per la disponibilit&agrave; del contenitore EJB.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome relativo alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref14" name="sthref14"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/it/help/missingtopic.html">To Configure EJB Settings</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configurare le impostazioni del pool MDB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configurare il servizio timer EJB</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
