<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbc-properties"></a><h4>Propriedades espec&#237;ficas para conjuntos de conex&#245;es do JDBC</h4>
<a name="indexterm-26"></a><a name="indexterm-27"></a><p>A maioria dos drivers JDBC permitem o uso de listas de propriedades
padr&#227;o para especificar usu&#225;rio, senha e outras informa&#231;&#245;es de configura&#231;&#227;o de recursos.
Embora as propriedades sejam opcionais no Servidor GlassFish, algumas delas podem ser
necess&#225;rias para a maioria dos bancos de dados.  Para obter detalhes,
consulte a API JDBC 4.0 Standard Extension.</p>

<p>A altera&#231;&#227;o de propriedades do driver JDBC exige que o servidor seja
reiniciado.</p>

<p>As seguintes propriedades padr&#227;o s&#227;o comuns a muitos fornecedores de JDBC. Para
obter informa&#231;&#245;es sobre as propriedades dispon&#237;veis para o seu driver JDBC, consulte
a documenta&#231;&#227;o do fornecedor.</p>

<dl><dt><tt>user</tt></dt>
<dd><p>Especifica o nome de usu&#225;rio para conex&#227;o ao banco de dados.</p>

</dd>
<dt><tt>password</tt></dt>
<dd><p>Especifica a senha para conex&#227;o ao banco de dados.</p>

</dd>
<dt><tt>databaseName</tt></dt>
<dd><p>Especifica o banco de dados para esse conjunto de conex&#245;es.</p>

</dd>
<dt><tt>serverName</tt></dt>
<dd><p>Especifica o servidor de banco de dados para esse conjunto de conex&#245;es.</p>

</dd>
<dt><tt>port</tt></dt>
<dd><p>Especifica a porta em que o servidor de banco de dados receber&#225; as solicita&#231;&#245;es.</p>

</dd>
<dt><tt>networkProtocol</tt></dt>
<dd><p>Especifica o protocolo de comunica&#231;&#227;o.</p>

</dd>
<dt><tt>roleName</tt></dt>
<dd><p>Especifica o nome da fun&#231;&#227;o SQL inicial.</p>

</dd>
<dt><tt>datasourceName</tt></dt>
<dd><p>Especifica um <tt>XADataSource</tt> adjacentes ou um <tt>ConnectionPoolDataSource</tt> se o conjunto de conex&#245;es estiver conclu&#237;do.</p>

</dd>
<dt><tt>description</tt></dt>
<dd><p>Especifica um texto descritivo.</p>

</dd>
<dt><tt>url</tt></dt>
<dd><p>Especifica a URL para esse conjunto de conex&#245;es. Embora essa n&#227;o seja uma propriedade padr&#227;o, ela &#233; de uso comum.</p>

</dd>
</dl>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
