<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbcconnpooladvanceattrtab"></a><h4>Editar atributos avan&#231;ados do conjunto de conex&#245;es</h4>
<a name="indexterm-24"></a><p>Use a p&#225;gina Editar atributos avan&#231;ados do conjunto de conex&#245;es, para especificar
atributos que ajudam a diagnosticar vazamentos de conex&#227;o e aprimorar a facilidade
de uso.</p>

<p>A p&#225;gina Editar atributos avan&#231;ados do conjunto de conex&#245;es cont&#233;m as seguintes
op&#231;&#245;es.</p>

<dl><dt>Descarregar padr&#245;es</dt>
<dd><p>Bot&#227;o utilizado para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome do conjunto</dt>
<dd><p>O nome do conjunto de conex&#245;es. O nome &#233; um campo somente leitura. Voc&#234; s&#243; poder&#225; especificar nome do conjunto de conex&#245;es quando criar um novo conjunto de conex&#245;es do JDBC.</p>

</dd>
<dt>Tempo limite da instru&#231;&#227;o</dt>
<dd><p>Per&#237;odo em segundos, ap&#243;s o qual as consultas de execu&#231;&#227;o anormalmente longa ser&#227;o encerradas. O Servidor GlassFish configura o <tt>Tempo limite de consulta</tt> nas instru&#231;&#245;es criadas. Um valor de -1 significa que a op&#231;&#227;o est&#225; desativada. O valor padr&#227;o &#233; -1.</p>

</dd>
<dt>Tamanho do cache de declara&#231;&#227;o</dt>
<dd><p>O n&#250;mero de declara&#231;&#245;es a serem colocadas no cache usando o mecanismo de cache LRU (Least Recently Used). Um valor de 0 desativa a coloca&#231;&#227;o de declara&#231;&#245;es no cache. O valor padr&#227;o &#233; 0.</p>

</dd>
<dt>Init SQL</dt>
<dd><p>Uma sequ&#234;ncia SQL a ser executada sempre que uma conex&#227;o &#233; criada (n&#227;o reutilizada) no conjunto. A execu&#231;&#227;o dessa sequ&#234;ncia inicializa o estado da conex&#227;o.</p>

</dd>
<dt>Interpretadores de rastreamento SQL</dt>
<dd><p>Uma lista separada por v&#237;rgulas de nomes de classes de implementa&#231;&#227;o do interpretador, que especifica que as declara&#231;&#245;es SQL executadas por aplicativos ser&#227;o rastreadas. As classes do interpretador precisam implementar o <tt>org.glassfish.api.jdbc.SQLTraceListener</tt> da interface. O uso de interpretadores permite a f&#225;cil filtragem de registros de mensagens para as declara&#231;&#245;es SQL e ajuda os administradores a analisarem as declara&#231;&#245;es. </p>

</dd>
<dt>Ajustar objetos JDBC</dt>
<dd><p>Quando essa op&#231;&#227;o &#233; ativada, o aplicativos ir&#227;o obter objetos JDBC incorporados para Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Colocar no conjunto</dt>
<dd><p>Permite colocar no conjunto as conex&#245;es para o conjunto. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Validar no m&#225;ximo uma vez</dt>
<dd><p>Especifica o intervalo de tempo, em segundos, entre sucessivas solicita&#231;&#245;es para validar uma conex&#227;o no m&#225;ximo uma vez. A configura&#231;&#227;o desse atributo para um valor apropriado minimiza o n&#250;mero de solicita&#231;&#245;es de valida&#231;&#227;o feitos por uma conex&#227;o. O valor padr&#227;o &#233; 0, o que significa que o atributo n&#227;o est&#225; ativado.</p>

</dd>
<dt>Tempo limite da perda</dt>
<dd><p>Per&#237;odo em segundos para rastrear as perdas de conex&#227;o em um conjunto de conex&#245;es. Use esse campo para detectar potenciais vazamentos de conex&#227;o pelo aplicativo. Uma conex&#227;o que n&#227;o &#233; retornada para o conjunto pelo aplicativo dentro do per&#237;odo especificado &#233; assumida como sendo de potencial vazamento, e um rastreamento de pilha do chamador &#233; registrado. Um valor de 0 que o rastreamento de vazamento da conex&#227;o est&#225; desativado. O valor padr&#227;o &#233; 0.</p>

<p>Use esse campo junto com Reclamar vazamento, para evitar potenciais vazamentos de conex&#227;o pelo aplicativo.</p>

</dd>
<dt>Reclama&#231;&#227;o de perda</dt>
<dd><p>Se essa op&#231;&#227;o est&#225; ativada, as conex&#245;es com vazamento ser&#227;o restauradas no conjunto ap&#243;s a conclus&#227;o do rastreamento de vazamento da conex&#227;o. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Novas tentativas de cria&#231;&#227;o</dt>
<dd><p>O n&#250;mero de tentativas a serem feitas se houver uma falha na cria&#231;&#227;o de uma nova conex&#227;o. O valor de 0 significa que nenhuma tentativa ser&#225; feita para criar a conex&#227;o novamente. O valor padr&#227;o &#233; 0.</p>

</dd>
<dt>Intervalo de nova tentativa</dt>
<dd><p>O intervalo de tempo, em segundos, entre duas tentativas de criar uma conex&#227;o. O valor padr&#227;o &#233; 10. Esse atributo s&#243; ser&#225; usado se o valor Novas tentativas de cria&#231;&#227;o for maior que 0.</p>

</dd>
<dt>Associa&#231;&#227;o lenta</dt>
<dd><p>Se essa op&#231;&#227;o est&#225; ativada, uma conex&#227;o f&#237;sica &#233; associada &#224; cole&#231;&#227;o l&#243;gica somente quando a conex&#227;o &#233; usada. As conex&#245;es ser&#227;o desassociadas quando a transa&#231;&#227;o for conclu&#237;da e um m&#233;todo de componente for finalizado, o que ajuda a reutilizar as conex&#245;es f&#237;sicas. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Inscri&#231;&#227;o de conex&#227;o lenta</dt>
<dd><p>Se essa op&#231;&#227;o est&#225; ativada, um recurso para a transa&#231;&#227;o ser&#225; inscrito somente quando a transa&#231;&#227;o for realmente usada em um m&#233;todo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Associar com segmento</dt>
<dd><p>Se essa op&#231;&#227;o est&#225; ativada, uma associa&#231;&#227;o ser&#225; estabelecida entre uma conex&#227;o com o thread, para quando o mesmo thread for necess&#225;rio &#224; uma conex&#227;o, a conex&#227;o j&#225; associada ao thread poder&#225; ser reutilizada, n&#227;o incorrendo, portanto, na sobrecarga para obten&#231;&#227;o de uma conex&#227;o no conjunto. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Conex&#245;es correspondentes</dt>
<dd><p>Se essa op&#231;&#227;o est&#225; ativada, uma conex&#227;o que &#233; selecionada do conjunto deveria ser correspondida com as conex&#245;es que t&#234;m determinadas credenciais. Essa op&#231;&#227;o precisa ser ativada se o conjunto de conex&#245;es &#233; usado por aplicativos que t&#234;m m&#250;ltiplas credenciais de usu&#225;rio. Essa op&#231;&#227;o poder&#225; ser desativada com seguran&#231;a se o administrador souber que as conex&#245;es no conjunto ser&#227;o sempre homog&#234;neas e, portanto, uma conex&#227;o selecionada no conjunto n&#227;o precisar&#225; coincidir com o adaptador de recurso. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Uso m&#225;x. de conex&#227;o</dt>
<dd><p>O n&#250;mero de vezes que uma conex&#227;o deve ser reutilizada pelo conjunto. Depois que uma conex&#227;o &#233; reutilizada por um n&#250;mero especificado de vezes, ela &#233; fechada. Ao limitar o n&#250;mero de vezes que uma conex&#227;o pode ser reutilizada, voc&#234; pode evitar vazamentos de declara&#231;&#245;es se um aplicativo n&#227;o fecha declara&#231;&#245;es. Um valor de 0 significa que a op&#231;&#227;o est&#225; desativada. O valor padr&#227;o &#233; 0.</p>

</dd>
<dt>Valida&#231;&#227;o da conex&#227;o</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, a valida&#231;&#227;o de conex&#227;o ser&#225; necess&#225;ria, permitindo que o servidor se reconecte em caso de falha.</p>

</dd>
<dt>M&#233;todo de valida&#231;&#227;o</dt>
<dd><p>O Servidor GlassFish pode validar as conex&#245;es ao banco de dados nas seguintes formas.</p>

<dl><dt><tt>confirma&#231;&#227;o autom&#225;tica</tt> e <tt>metadados</tt></dt>
<dd><p>O Servidor GlassFish valida a conex&#227;o ao chamar o m&#233;todo <tt>con.getAutoCommit</tt> ou <tt>con.getMetaData</tt>. </p>


<hr><p><b>Observa&#231;&#227;o - </b>Muitos drivers JDBC armazenam em cache os resultados dessas chamadas. Como resultado, o uso dessas chamadas nem sempre fornece valida&#231;&#245;es confi&#225;veis. Verifique com o fornecedor do driver para determinar se essas chamadas s&#227;o ou n&#227;o armazenadas em cache.</p>


<hr>
</dd>
<dt><tt>valida&#231;&#227;o personalizada</tt></dt>
<dd><p>O Servidor GlassFish usa um mecanismo de valida&#231;&#227;o definido pelo usu&#225;rio especificado pela classe de implementa&#231;&#227;o personalizada no campo Nome da classe de valida&#231;&#227;o.</p>

</dd>
<dt><tt>tabela</tt></dt>
<dd><p>O aplicativo consulta a tabela de banco de dados especificada. A tabela deve existir e estar acess&#237;vel, mas n&#227;o precisa conter linhas. N&#227;o use uma tabela existente que tenha um n&#250;mero grande de linhas, nem uma tabela que seja acessada com frequ&#234;ncia.</p>

</dd>
</dl>
</dd>
<dt>Nome da tabela</dt>
<dd><p>Nome da tabela de banco de dados para valida&#231;&#227;o. Esse campo s&#243; ser&#225; aplic&#225;vel se o m&#233;todo de valida&#231;&#227;o tiver sido definido como <tt>tabela</tt>.</p>

</dd>
<dt>Nome da classe de valida&#231;&#227;o</dt>
<dd><p>O nome da classe de implementa&#231;&#227;o personalizada. Esse campo s&#243; ser&#225; aplic&#225;vel se o m&#233;todo de valida&#231;&#227;o tiver sido definido como <tt>valida&#231;&#227;o personalizada</tt>. O nome da classe fornecido precisa estar acess&#237;vel ao Servidor GlassFish. A classe especificada deve implementar o <tt>org.glassfish.api.jdbc.ConnectionValidation</tt> da interface. </p>

</dd>
<dt>Em qualquer falha</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, o Servidor GlassFish fechar&#225; todas as conex&#245;es do conjunto e as restabelecer&#225; quando alguma conex&#227;o falhar. Se a op&#231;&#227;o for desativada, cada conex&#227;o individual somente ser&#225; restabelecida quando for usada. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Permitir chamadores n&#227;o componentes</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, o conjunto poder&#225; ser usado pelos chamadores n&#227;o de componentes; por exemplo; filtros de servlet gerenciadores de persist&#234;ncia de terceiros. As conex&#245;es obtidas por chamadores n&#227;o de componente n&#227;o s&#227;o automaticamente fechadas no final de uma transa&#231;&#227;o pelo recipiente. Elas precisam ser explicitamente fechadas pelo chamador. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
</dl>
<a name="gkonw"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-setdbaccess.html">Para configurar o acesso ao banco de dados</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar um driver JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar as configura&#231;&#245;es gerais do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar as configura&#231;&#245;es do conjunto de conex&#245;es</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avan&#231;ados do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para excluir um conjunto de conex&#245;es do JDBC</a></p>

</li></ul>
<a name="gkoli"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=add-resources-1"><tt>add-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jdbc-connection-pool-1"><tt>create-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jdbc-connection-pool-1"><tt>delete-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jdbc-connection-pools-1"><tt>list-jdbc-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=ping-connection-pool-1"><tt>ping-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-database-1"><tt>start-database</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-database-1"><tt>stop-database</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
