<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbcresourcenew"></a><h4>Novo recurso do JDBC</h4>
<a name="indexterm-18"></a><p>Use a p&#225;gina Novo recurso do JDBC para cri&#225;-lo.</p>

<p>A p&#225;gina Novo recurso do JDBC cont&#233;m essas op&#231;&#245;es.</p>

<dl><dt>Nome JNDI</dt>
<dd><p>Um nome &#250;nico que identifica o recurso JDBC. O nome JNDI organiza e localiza os componentes em um ambiente de computa&#231;&#227;o distribu&#237;do, de maneira semelhante ao cat&#225;logo de cart&#227;o que organiza e representa os locais de livros em uma biblioteca. Consequentemente, o nome JNDI se torna um m&#233;todo importante de acesso ao recurso JDBC. Por conven&#231;&#227;o, o nome come&#231;a com a sequ&#234;ncia <tt>jdbc/</tt>; por exemplo, <tt>jdbc/payrolldb</tt>. N&#227;o se esque&#231;a da barra. O nome deve conter somente caracteres alfanum&#233;ricos, sublinhado, tra&#231;o ou ponto.</p>

</dd>
<dt>Nome do conjunto</dt>
<dd><p>O conjunto de conex&#245;es associado ao recurso do JDBC.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma breve descri&#231;&#227;o do recurso do JDBC.</p>

</dd>
<dt>Status</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, o recurso estar&#225; dispon&#237;vel no momento da execu&#231;&#227;o. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais para o recurso JDBC. O Servidor GlassFish n&#227;o define nenhuma propriedade adicional para os recursos JDBC.</p>

</dd>
<dt>Destinos</dt>
<dd><p>Clusters e inst&#226;ncias independentes do recurso JDBC. Mova os destinos desejados para a coluna Destinos selecionados utilizando os bot&#245;es Adicionar e Adicionar tudo. Mova os destinos desnecess&#225;rios para a coluna Destinos dispon&#237;veis utilizando os bot&#245;es Remover e Remover tudo.</p>

<p>Esta op&#231;&#227;o &#233; exibida somente se os clusters ou inst&#226;ncias independentes tiverem sido criados no dom&#237;nio.</p>

</dd>
</dl>
<a name="gkome"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-setdbaccess.html">Para configurar o acesso ao banco de dados</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar um driver JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Para criar um recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Para editar um recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Para excluir um recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do JDBC</a></p>

</li></ul>
<a name="gkooh"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=add-resources-1"><tt>add-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jdbc-resource-1"><tt>create-jdbc-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jdbc-resource-1"><tt>delete-jdbc-resource</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jdbc-resources-1"><tt>list-jdbc-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jdbc-connection-pool-1"><tt>create-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-database-1"><tt>start-database</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-database-1"><tt>stop-database</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
