<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbcconnectionpooledittab"></a><h4>Editar conjuntos de conex&#245;es</h4>
<a name="indexterm-23"></a><p>Use a p&#225;gina Editar conjunto de conex&#245;es para editar as propriedades gerais
de um conjunto de conex&#245;es do JDBC.</p>

<p>A p&#225;gina Editar conjunto de conex&#245;es cont&#233;m essas op&#231;&#245;es.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Descarregar</dt>
<dd><p>Bot&#227;o para reinicializar as conex&#245;es no conjunto de conex&#245;es. Clicar nesse bot&#227;o destr&#243;i quaisquer conex&#245;es existentes, recria as conex&#245;es estabelecidas para o conjunto e restaura o conjunto para seu tamanho inicial e m&#237;nimo.</p>

</dd>
<dt>Ping</dt>
<dd><p>Bot&#227;o para verificar que o conjunto de conex&#245;es &#233; utiliz&#225;vel. Se uma mensagem de erro for exibida quando voc&#234; clica nesse bot&#227;o, verifique se o servidor de banco de dados foi iniciado.</p>

</dd>
<dt>Nome do conjunto</dt>
<dd><p>O nome do conjunto de conex&#245;es. Esse &#233; um campo somente leitura. Voc&#234; s&#243; poder&#225; especificar o nome do conjunto quando criar um conjunto de conex&#245;es do JDBC.</p>

</dd>
<dt>Tipo de recurso</dt>
<dd><p>As op&#231;&#245;es incluem javax.sql.XADataSource (transa&#231;&#245;es globais), java.sql.ConnectionPoolDataSource (transa&#231;&#245;es locais, poss&#237;veis melhorias de desempenho) e javax.sql.DataSource  (somente transa&#231;&#245;es locais)<tt>java.sql.Driver</tt>.</p>

</dd>
<dt>Nome de Classe da Fonte de Dados</dt>
<dd><p>O nome de classe espec&#237;fico do fornecedor que implementa a fonte de dados.</p>

</dd>
<dt>Nome de classe do driver</dt>
<dd><p>O nome da classe do driver JDBC suprido pelo fornecedor. Se voc&#234; selecionou o tipo de recurso java.sql.Driver, normalmente esse campo &#233; automaticamente preenchido com o nome da classe associado ao driver do fornecedor de banco de dados de sua escolha. Se voc&#234; selecionou um dos tipos de recursos de origem de dados, esse campo &#233; desativado.</p>

</dd>
<dt>Ping</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, ser&#225; efetuado o ping autom&#225;tico no conjunto durante a cria&#231;&#227;o ou reconfigura&#231;&#227;o, para identificar e avisar sobre valores de atributos com erros. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma breve descri&#231;&#227;o do conjunto de conex&#245;es.</p>

</dd>
<dt>Tamanho inicial e m&#237;nimo do conjunto</dt>
<dd><p>O n&#250;mero m&#237;nimo de conex&#245;es no conjunto. Esse valor tamb&#233;m determina o n&#250;mero de conex&#245;es colocadas no conjunto quando o conjunto &#233; criado ou quando o Servidor GlassFish &#233; iniciado. O valor padr&#227;o &#233; 8.</p>

</dd>
<dt>Tamanho m&#225;ximo do conjunto</dt>
<dd><p>O n&#250;mero m&#225;ximo de conex&#245;es no conjunto. O valor padr&#227;o &#233; 32.</p>

</dd>
<dt>Quantidade de redimensionamento do conjunto</dt>
<dd><p>Quando o conjunto aumente e diminui em dire&#231;&#227;o ao tamanho m&#225;ximo e m&#237;nimo, respectivamente, o conjunto &#233; redimensionado em lotes. Esse valor determina o n&#250;mero de conex&#245;es do lote. A defini&#231;&#227;o de um valor muito alto torna demorado o processo de cria&#231;&#227;o e reciclagem de conex&#245;es; um valor muito baixo compromete a efici&#234;ncia. O valor padr&#227;o &#233; 2.</p>

</dd>
<dt>Tempo limite de inatividade</dt>
<dd><p>A quantidade m&#225;xima de tempo, em segundos, que uma conex&#227;o pode permanecer inativa no conjunto. Ap&#243;s esse per&#237;odo, a conex&#227;o ser&#225; removida do conjunto. O valor padr&#227;o &#233; 300.</p>

</dd>
<dt>Tempo m&#225;x. de espera</dt>
<dd><p>A quantidade m&#225;xima de tempo, em milissegundos, que o aplicativo solicitante da conex&#227;o aguardar&#225; at&#233; que o tempo limite da conex&#227;o seja atingido. O valor padr&#227;o &#233; 60.000.</p>

</dd>
<dt>Conex&#245;es n&#227;o transacionais</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, as conex&#245;es n&#227;o transacionais ser&#227;o retornadas. Por padr&#227;o essa op&#231;&#227;o n&#227;o &#233; especificada.</p>

</dd>
<dt>Isolamento de transa&#231;&#227;o</dt>
<dd><p>Se um n&#237;vel de isolamento de transa&#231;&#227;o for especificado, as conex&#245;es desse conjunto funcionar&#227;o no n&#237;vel especificado. Caso contr&#225;rio, as conex&#245;es funcionar&#227;o com os n&#237;veis de isolamento padr&#227;o, fornecidos pelo driver JDBC. Por padr&#227;o essa op&#231;&#227;o n&#227;o &#233; especificada.</p>

</dd>
<dt>N&#237;vel de isolamento</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Garantido for marcada, todas as conex&#245;es obtidas no conjunto ter&#227;o o mesmo n&#237;vel de isolamento. Por exemplo, se o n&#237;vel de isolamento da conex&#227;o for alterado via programa&#231;&#227;o (com <tt>con.setTransactionIsolation</tt>), durante a &#250;ltima utiliza&#231;&#227;o, esse mecanismo alterar&#225; o status para o n&#237;vel de isolamento especificado.</p>

<p>Esse campo somente &#233; aplic&#225;vel se um n&#237;vel de isolamento de transa&#231;&#227;o for especificado.</p>

</dd>
</dl>
<a name="gkomw"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-setdbaccess.html">Para configurar o acesso ao banco de dados</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar um driver JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar as configura&#231;&#245;es gerais do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar as configura&#231;&#245;es do conjunto de conex&#245;es</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avan&#231;ados do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para excluir um conjunto de conex&#245;es do JDBC</a></p>

</li></ul>
<a name="gkolc"></a><h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=add-resources-1"><tt>add-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jdbc-connection-pool-1"><tt>create-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jdbc-connection-pool-1"><tt>delete-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jdbc-connection-pools-1"><tt>list-jdbc-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=ping-connection-pool-1"><tt>ping-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-database-1"><tt>start-database</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-database-1"><tt>stop-database</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
