<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcconnectionpoolproperty"></a><h4>Para editar as propriedades do conjunto de conex&#245;es JDBC</h4><a name="indexterm-14"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Recursos.</b></li>
<li><b>No n&#243; Recursos, expanda o n&#243; JDBC.</b></li>
<li><b>No n&#243; JDBC, selecione o n&#243; Conjuntos de conex&#245;es.</b><p>A p&#225;gina Conjuntos de conex&#245;es &#233; exibida.</p></li>
<li><b>Clique no nome do conjunto de conex&#245;es a ser editado.</b><p>A p&#225;gina Editar conjunto de conex&#245;es &#233; exibida.</p></li>
<li><b>Na p&#225;gina Editar conjunto de conex&#245;es, clique na guia Propriedades adicionais.</b><p>A p&#225;gina Editar propriedades do conjunto de conex&#245;es &#233; exibida.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique essas propriedades.</b><p>Exemplos de propriedades necess&#225;rias incluem nome do banco de dados (URL), nome
de usu&#225;rio e senha. Para obter informa&#231;&#245;es sobre as propriedades dispon&#237;veis, consulte
<a href="ref-jdbc-properties.html">Propriedades espec&#237;ficas para conjuntos de conex&#245;es do JDBC</a>.</p><p>Se voc&#234; n&#227;o especifica um valor para uma propriedade, ela &#233; removida
da tabela quando termina de editar o conjunto de conex&#245;es. Caso n&#227;o
deseje definir agora um valor para uma propriedade, mas deseja que a
propriedade permane&#231;a na tabela, para que o valor possa ser definido em
outro momento, digite um conjunto de par&#234;nteses vazios no campo Valor:</p><pre>()</pre><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
brando que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-setdbaccess.html">Para configurar o acesso ao banco de dados</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar um driver JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Para criar um recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Para editar um recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Para editar destinos do recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Para excluir um recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar as configura&#231;&#245;es gerais do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avan&#231;ados do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar as configura&#231;&#245;es do conjunto de conex&#245;es</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para excluir um conjunto de conex&#245;es do JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
