<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setdbaccess"></a><h4>Para configurar o acesso ao banco de dados</h4><a name="indexterm-1"></a><a name="indexterm-2"></a><p>Para armazenar, organizar e recuperar dados, a maioria dos aplicativos usa bancos
de dados relacionais.</p>

<p>O Servidor GlassFish inclui uma c&#243;pia do banco de dados Java DB
e &#233; pr&#233;-configurado com a habilidade de acessar esse banco de dados.</p>

<ol>
<li><b>Instale um produto de banco de dados compat&#237;vel. </b><p>Para obter uma lista dos bancos de dados que possuem suporte, consulte
<a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2434&id=sjsaseern"><i>Oracle GlassFish Server 3.1 Release Notes </i></a>.</p></li>
<li><b>Instale um driver que suporte a API JDBC (driver JDBC) para o
banco de dados.</b><p>Verifique se o driver a ser utilizado para criar as conex&#245;es com
bancos de dados est&#225; instalado em todos os servidores em que a
fonte de dados ser&#225; instalada.</p></li>
<li><b>Verifique se o arquivo JAR do driver &#233; acessado na inst&#226;ncia de
servidor do dom&#237;nio. </b><p>Consulte <a href="task-integratejdbcdriver.html">Para integrar um driver JDBC</a>.</p></li>
<li><b>Crie o banco de dados. </b><p>Em geral, o fornecedor do aplicativo disponibiliza scripts para cria&#231;&#227;o e preenchimento
do banco de dados.</p></li>
<li><b>Crie um conjunto de conex&#245;es para o banco de dados. </b><p>Consulte <a href="task-jdbcconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do JDBC</a>.</p></li>
<li><b>Crie um recurso do JDBC que aponte para o conjunto de conex&#245;es.
</b><p>Consulte <a href="task-jdbcresourcenew.html">Para criar um recurso do JDBC</a>.</p></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-integratejdbcdriver.html">Para integrar um driver JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Para criar um recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Para editar um recurso JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Para excluir um recurso do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para criar um conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar as configura&#231;&#245;es gerais do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avan&#231;ados do conjunto de conex&#245;es do JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar as configura&#231;&#245;es do conjunto de conex&#245;es</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Para editar as propriedades do conjunto de conex&#245;es JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para excluir um conjunto de conex&#245;es do JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
