<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a><a id="GHJMS00009" name="GHJMS00009"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>JMS &#44032;&#50857;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS &#44032;&#50857;&#49457; &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; JMS(Java Message Service)&#50640; &#45824;&#54620; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>JMS &#44032;&#50857;&#49457; &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51060; &#51080;&#45716; &#49444;&#51221;&#51012; &#54644;&#45817; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51060; &#50630;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44032;&#50857;&#49457; &#49436;&#48708;&#49828;</dt>
<dd>
<p>GlassFish &#53364;&#47084;&#49828;&#53552;&#50640; JMS &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; &#45936; &#49324;&#50857;&#46104;&#45716; Message Queue &#53364;&#47084;&#49828;&#53552;&#51032; &#54620; &#50976;&#54805;&#51077;&#45768;&#45796;. &#49324;&#50857; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#44256;&#44553; Message Queue &#53364;&#47084;&#49828;&#53552;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51008; &#44221;&#50864; &#44592;&#51316; Message Queue &#53364;&#47084;&#49828;&#53552;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805; &#48143; &#47700;&#49884;&#51648; &#51200;&#51109;&#49548; &#50976;&#54805; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;</dt>
<dd>
<p>&#44592;&#51316; Message Queue &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#44396;&#49457; &#45936;&#51060;&#53552;&#50640; &#45824;&#54620; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548; &#50976;&#54805;&#51077;&#45768;&#45796;. <code>masterbroker</code> &#44050;&#51008; &#44396;&#49457; &#45936;&#51060;&#53552;&#47484; &#51200;&#51109; &#48143; &#44288;&#47532;&#54624; &#47560;&#49828;&#53552; &#48652;&#47196;&#52964;&#51032; &#50857;&#46020;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. <code>shareddb</code> &#44050;&#51008; &#44396;&#49457; &#45936;&#51060;&#53552;&#47484; &#51200;&#51109;&#54624; &#44277;&#50976; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#50857;&#46020;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44032;&#50857;&#49457; &#49436;&#48708;&#49828;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#45716; &#51060; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47700;&#49884;&#51648; &#51200;&#51109;&#49548; &#50976;&#54805;</dt>
<dd>
<p>&#44592;&#51316; &#53364;&#47084;&#49828;&#53552;&#51032; &#48652;&#47196;&#52964;&#50640; &#51080;&#45716; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#50640; &#45824;&#54620; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548; &#50976;&#54805;&#51077;&#45768;&#45796;. <code>file</code> &#44050;&#51008; &#54028;&#51068; &#51200;&#51109;&#49548;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. <code>jdbc</code> &#44050;&#51008; JDBC &#51200;&#51109;&#49548;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44032;&#50857;&#49457; &#49436;&#48708;&#49828;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#45716; &#51060; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088; &#51060;&#47492;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50529;&#49464;&#49828; URL</dt>
<dd>
<p>&#45796;&#51020; &#44221;&#50864;&#50640; &#49324;&#50857;&#54624; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;, &#49324;&#50857;&#51088;, &#48708;&#48128;&#48264;&#54840; &#48143; &#50529;&#49464;&#49828; URL&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44032;&#50857;&#49457; &#49436;&#48708;&#49828;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;:</p>
</li>
<li>
<p>&#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;&#51060; <code>shareddb</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
<li>
<p>&#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;&#51060; <code>jdbc</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
</ul>
<p>&#51648;&#50896;&#46104;&#45716; &#44277;&#44553;&#50629;&#52404; &#48143; &#44033; &#44277;&#44553;&#50629;&#52404;&#51032; &#50529;&#49464;&#49828; URL &#54805;&#49885;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244"><i>Oracle GlassFish Server Message Queue Administration Guide</i>&#51032; <i>JDBC-Based Persistence</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>JMS &#44032;&#50857;&#49457;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#52628;&#44032; JMS &#44032;&#50857;&#49457; &#49549;&#49457;&#51012; &#48120;&#47532; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-jmsservice.html">JMS &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
