<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbcontaineravailability" name="ref-ejbcontaineravailability"></a><a id="GHEJB00001" name="GHEJB00001"></a></p>

<h4><a id="sthref15" name="sthref15"></a><a id="sthref16" name="sthref16"></a>Disponibilidad de Contenedor EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Disponibilidad de Contenedor EJB para configurar las opciones de disponibilidad para el contenedor EJB.</p>
<p>La p&aacute;gina Disponibilidad de Contenedor EJB contiene las siguientes opciones.</p>
<dl>
<dt>Cargar valores predeterminados</dt>
<dd>
<p>Bot&oacute;n para restaurar la configuraci&oacute;n que tiene valores por defecto a estos valores. La configuraci&oacute;n que no tiene valores por defecto no se modifica.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Servicio de Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se ha activado la disponibilidad para el contenedor EJB.</p>
</dd>
<dt>Tipo de Persistencia de HA</dt>
<dd>
<p>El mecanismo de persistencia utilizado cuando la casilla de control Servicio de Disponibilidad Activado est&aacute; activada. El valor por defecto es <code>replicated</code>, que proporciona persistencia bas&aacute;ndose en el failover en un cluster. No cambie este valor.</p>
</dd>
<dt>Tipo de Persistencia de SFSB</dt>
<dd>
<p>El mecanismo de persistencia utilizado cuando la casilla de control Servicio de Disponibilidad Activado <i>no</i> est&aacute; activada. El valor por defecto es <code>file</code>, que proporciona persistencia basada en el sistema de archivos. No cambie este valor.</p>
<p>El campo Ubicaci&oacute;n del almacenamiento de sesi&oacute;n determina d&oacute;nde contin&uacute;an activos los estados del punto de control SFSB. Para definir la ubicaci&oacute;n del almac&eacute;n de sesi&oacute;n, consulte <a href="../../../ejb-lite/es/help/missingtopic.html">Definir la Configuraci&oacute;n de EJB</a>.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales de la disponibilidad de contenedor EJB.</p>
<p>GlassFish Server no define propiedades adicionales para la disponibilidad de contenedor EBJ.</p>
</dd>
</dl>
<a id="sthref17" name="sthref17"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbcontaineravailability.html">Definir la Configuraci&oacute;n de Disponibilidad para el Contenedor EJB</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/es/help/missingtopic.html">Para configurar las opciones de EJB</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
