<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbmdbpoolsettings"></a><h4>Configuraci&#243;n predeterminada de conjuntos MDB</h4>
<a name="indexterm-15"></a><a name="indexterm-16"></a><a name="indexterm-17"></a><p>Utilice la p&#225;gina Configuraci&#243;n predeterminada de conjuntos MDB para configurar el conjunto
MDB.</p>

<p>La p&#225;gina Configuraci&#243;n predeterminada de conjuntos MDB contiene las opciones siguientes.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer los valores predeterminados de todos los par&#225;metros de configuraci&#243;n.</p>

</dd>
<dt>Nombre de configuraci&#243;n</dt>
<dd><p>El nombre de configuraci&#243;n al que se aplican los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Tama&#241;o inicial y m&#237;nimo del conjunto</dt>
<dd><p>La cantidad m&#237;nima beans de mensajes que se mantendr&#225;n en el conjunto. El valor predeterminado es 0.</p>

</dd>
<dt>Tama&#241;o m&#225;ximo del conjunto</dt>
<dd><p>La cantidad m&#225;xima beans que el contenedor puede mantener en el conjunto de una vez. El valor predeterminado es 32.</p>

</dd>
<dt>Cantidad de cambio de tama&#241;o del conjunto</dt>
<dd><p>El n&#250;mero de beans que se quitan del conjunto si est&#225;n inactivos m&#225;s tiempo que el especificado en el campo Tiempo de espera de inactividad de conjunto. El valor debe ser 0 como m&#237;nimo e inferior al valor de Tama&#241;o de conjunto m&#225;ximo. El valor predeterminado es 8.</p>

</dd>
<dt>Tiempo de espera de inactividad de conjunto</dt>
<dd><p>El intervalo de tiempo, en segundos, que un bean del conjunto puede estar inactivo antes de que se quite del conjunto. Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor predeterminado es 600.</p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales del conjunto MDB. GlassFish Server no define ninguna propiedad adicional para el conjunto MDB.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-ejbmdbpoolsettings.html">Para configurar las opciones de conjuntos MDB</a></p>

</li>
<li><p><a href="../../../ejb-lite/es/help/task-ejbgeneral.html">Para configurar las opciones de EJB</a></p>

</li>
<li><p><a href="task-ejbtimerservice.html">Para configurar el servicio de temporizador EJB</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Ninguno.</p>



<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
