<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbmdbpoolsettings" name="ref-ejbmdbpoolsettings"></a><a id="GHEJB00002" name="GHEJB00002"></a></p>

<h4><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a><a id="sthref20" name="sthref20"></a>Configuraci&oacute;n del Pool por Defecto de Beans Controlados por Mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraci&oacute;n del Pool por Defecto de Beans Controlados por Mensajes para configurar el conjunto MDB.</p>
<p>La p&aacute;gina Configuraci&oacute;n del Pool por Defecto de Beans Controlados por Mensajes contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar la configuraci&oacute;n que tiene valores por defecto a estos valores. La configuraci&oacute;n que no tiene valores por defecto no se modifica.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Tama&ntilde;o de Pool Inicial y M&iacute;nimo</dt>
<dd>
<p>La cantidad m&iacute;nima beans de mensajes que se mantendr&aacute;n en el pool. El valor por defecto es 0.</p>
</dd>
<dt>Tama&ntilde;o de Pool M&aacute;ximo</dt>
<dd>
<p>La cantidad m&aacute;xima beans que el contenedor puede mantener en el pool de una vez. El valor por defecto es 32.</p>
</dd>
<dt>Cantidad de cambio de tama&ntilde;o del conjunto</dt>
<dd>
<p>El n&uacute;mero de beans que se quitan del conjunto si est&aacute;n inactivos m&aacute;s tiempo que el especificado en el campo Tiempo de espera de inactividad de conjunto. El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de conjunto m&aacute;ximo. El valor predeterminado es 8.</p>
</dd>
<dt>Tiempo de espera de inactividad de conjunto</dt>
<dd>
<p>El intervalo de tiempo, en segundos, que un bean del conjunto puede estar inactivo antes de que se quite del conjunto. Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor predeterminado es 600.</p>
</dd>
<dt>Propiedades adicionales</dt>
<dd>
<p>Propiedades adicionales del conjunto MDB. GlassFish Server no define ninguna propiedad adicional para el conjunto MDB.</p>
</dd>
</dl>
<a id="sthref21" name="sthref21"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Definir la Configuraci&oacute;n de Pools MDB</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/es/help/missingtopic.html">Para configurar las opciones de EJB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configurar el Servicio de termporizador EJB</a></p>
</li>
</ul>
<a id="sthref22" name="sthref22"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
