<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbcontaineravailability"></a><h4>Disponibilidad de contenedor EJB</h4>
<a name="indexterm-13"></a><a name="indexterm-14"></a><p>Utilice la p&#225;gina de Disponibilidad de contenedor EJB para configurar las opciones
del contenedor EJB.</p>

<p>La p&#225;gina de Disponibilidad de contenedor EJB contiene las siguientes opciones.</p>

<dl><dt>Cargar valores predeterminados</dt>
<dd><p>Bot&#243;n para restablecer los valores predeterminados de todos los par&#225;metros de configuraci&#243;n.</p>

</dd>
<dt>Nombre de configuraci&#243;n</dt>
<dd><p>El nombre de configuraci&#243;n al que se aplican los valores de esta p&#225;gina. Este campo es de s&#243;lo lectura.</p>

</dd>
<dt>Servicio de disponibilidad</dt>
<dd><p>Si selecciona la casilla de verificaci&#243;n Habilitado, activar&#225; la disponibilidad para el contenedor EJB.</p>

</dd>
<dt>Tipo de persistencia HA</dt>
<dd><p>El mecanismo de persistencia utilizado cuando el Servicio de Disponibilidad Habilitado est&#225; seleccionado. El valor predeterminado es <tt>replicated</tt>, que proporciona persistencia basada en conmutaci&#243;n por error en un cl&#250;ster. No cambie este valor.</p>

</dd>
<dt>Tipo de persistencia SFSB</dt>
<dd><p>El mecanismo de persistencia utilizado cuando el Servicio de Disponibilidad Habilitado <b>no</b> est&#225; seleccionado. El valor predeterminado es <tt>file</tt>, que proporciona persistencia basada en el sistema de archivos. No cambie este valor.</p>

<p>El campo Ubicaci&#243;n del almacenamiento de sesi&#243;n determina d&#243;nde contin&#250;an activos los estados del punto de control SFSB. Para establecer la ubicaci&#243;n del almacenamiento de sesi&#243;n, consulte <a href="../../../ejb-lite/es/help/task-ejbgeneral.html">To Configure EJB Settings</a>. </p>

</dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales para la Disponibilidad de contenedor EJB.</p>

<p>GlassFish Server no define propiedades adicionales para la Disponibilidad de contenedor EJB.</p>

</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-ejbcontaineravailability.html">C&#243;mo configurar las opciones de disponibilidad para el contenedor EJB</a></p>

</li>
<li><p><a href="../../../ejb-lite/es/help/task-ejbgeneral.html">Para configurar las opciones de EJB</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
