<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbmdbpoolsettings" name="task-ejbmdbpoolsettings"></a><a id="GHEJB00004" name="GHEJB00004"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a><a id="sthref4" name="sthref4"></a>Definir la Configuraci&oacute;n de Pools MDB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El grupo de beans controlados por mensajes es similar al de los beans de sesi&oacute;n. De forma predeterminada, el contenedor mantiene un grupo de beans controlados por mensajes.</p>
<p>Para ajustar la configuraci&oacute;n de este conjunto, lleve a cabo los pasos siguientes.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, expanda el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione el nodo Contenedor EJB.</p>
<p>Se abre la p&aacute;gina de Enterprise Java Beans (EJB).</p>
</li>
<li>
<p>Haga clic en el separador Configuraci&oacute;n de Beans Controlados por Mensajes.</p>
<p>Se abre la p&aacute;gina de Configuraci&oacute;n del conjunto predeterminada de MDB.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de conjunto inicial y m&iacute;nimo, escriba la cantidad m&iacute;nima de beans que se mantendr&aacute;n en el conjunto.</p>
<p>El valor predeterminado es 0.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de conjunto m&aacute;ximo, escriba la cantidad m&aacute;xima de beans que el contenedor puede mantener en el conjunto a la vez.</p>
<p>El valor predeterminado es 32.</p>
</li>
<li>
<p>En el campo Cantidad de cambio de tama&ntilde;o del conjunto, escriba la cantidad de beans que se quitar&aacute;n del conjunto si permanecen en estado inactivo durante un tiempo superior al especificado en el campo Tiempo de espera de inactividad de conjunto.</p>
<p>El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de conjunto m&aacute;ximo. El valor predeterminado es 8.</p>
</li>
<li>
<p>En el campo Tiempo de espera de inactividad de conjunto, escriba la cantidad de segundos que un bean del conjunto puede estar inactivo antes de que se quite del conjunto.</p>
<p>Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor predeterminado es 600.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para el conjunto MDB.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, escriba el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite su campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a los valores de configuraci&oacute;n predeterminados, haga clic en el bot&oacute;n Cargar predeterminados y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/es/help/missingtopic.html">Definir la Configuraci&oacute;n de EJB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configurar el Servicio de termporizador EJB</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">Definir la Configuraci&oacute;n de Disponibilidad para el Contenedor EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
