<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-storeproptab"></a><h4>Propriedades de armazenamento</h4>
<a name="indexterm-52"></a><a name="indexterm-53"></a><a name="indexterm-54"></a><p>Use a p&#225;gina Propriedades de Armazenamento para adicionar ou modificar propriedades da
persist&#234;ncia da sess&#227;o (armazenamento) para o recipiente da Web.</p>

<p>A p&#225;gina Propriedades de Armazenamento cont&#233;m as seguintes op&#231;&#245;es.</p>

<dl><dt>Nome da configura&#231;&#227;o</dt>
<dd><p>Nome da configura&#231;&#227;o ao qual as configura&#231;&#245;es desta p&#225;gina ser&#227;o enviadas. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Diret&#243;rio</dt>
<dd><p>O nome do caminho absoluto ou relativo do diret&#243;rio no qual os arquivos individuais da sess&#227;o s&#227;o gravados. O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/generated/jsp/j2ee-apps/</tt><i>appname</i><tt>/</tt><i>appname</i><tt>_war</tt>. Um caminho relativo para o diret&#243;rio tempor&#225;rio de trabalho para este aplicativo Web.</p>

</dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedades adicionais do armazenamento. O Servidor GlassFish n&#227;o define propriedades adicionais para o armazenamento.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-webcontainergeneral.html">Para configurar as propriedades gerais do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Para configurar as propriedades da sess&#227;o do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Para configurar as propriedades do gerenciador do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Para configurar as propriedades de armazenamento do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente da Web</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>



<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
