<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-threadpools"></a><h4>Conjunto de segmentos</h4>
<a name="indexterm-79"></a><a name="indexterm-80"></a><p>Use a p&#225;gina conjunto de segmentos para configur&#225;-los.</p>

<p>Use conjunto de segmentos para limitar um servi&#231;o a uma quantidade espec&#237;fica
de segmentos simult&#226;neos.</p>

<p>Na primeira instala&#231;&#227;o do Servidor GlassFish, existem dois conjunto de segmentos por
padr&#227;o. O conjunto de segmentos denominado <tt>http-thread-pool</tt> &#233; configurado para uso pelas
escutas de rede, enquanto o <tt>thread-pool-1</tt> &#233; configurado para uso pelo ORB
para solicita&#231;&#245;es RMI/IIOP. Pode ser necess&#225;rio criar um conjunto de segmentos com
configura&#231;&#245;es diferentes para uso por determinados tipos de aplicativos e para determinados
sistemas de hardware, ou para ajustar os conjunto de segmentos padr&#227;o para
suas necessidades.</p>

<p>A Java Virtual Machine (JVM) pode suportar muitos segmentos simult&#226;neos de execu&#231;&#227;o.
Para ajudar no desempenho, o Servidor GlassFish mant&#233;m um ou mais conjunto
de segmentos. &#201; poss&#237;vel atribuir conjunto de segmentos espec&#237;ficos a servi&#231;os espec&#237;ficos.</p>

<p>Um conjunto de segmentos pode atender v&#225;rios servi&#231;os. Os segmentos de solicita&#231;&#227;o
processam solicita&#231;&#245;es de usu&#225;rios. Quando o servidor recebe uma solicita&#231;&#227;o, ele a
atribui a um segmento livre do conjunto de segmentos. O segmento executa
a solicita&#231;&#227;o do cliente e retorna os resultados. Por exemplo, se a
solicita&#231;&#227;o precisar usar um recurso do sistema que est&#225; ocupado no momento,
o segmento esperar&#225; at&#233; que o recurso fique dispon&#237;vel para ent&#227;o permitir
que a solicita&#231;&#227;o use o recurso.</p>

<p>Especifique um n&#250;mero m&#237;nimo e m&#225;ximo de segmentos a serem reservados para
solicita&#231;&#245;es. O conjunto de segmentos &#233; dinamicamente ajustado entre esses dois valores.
O tamanho m&#237;nimo do conjunto de segmentos especificado sinaliza o servidor para
reservar pelo menos essa quantidade de segmentos para solicita&#231;&#245;es. O n&#250;mero &#233;
aumentado at&#233; o tamanho m&#225;ximo especificado para o conjunto de segmentos.</p>

<p>O aumento do n&#250;mero de segmentos dispon&#237;veis para um processo permite que
o processo responda mais solicita&#231;&#245;es simultaneamente.</p>

<p>Para cada conjunto de segmentos, as informa&#231;&#245;es a seguir s&#227;o fornecidas.</p>

<dl><dt>ID do conjunto de segmentos</dt>
<dd><p>O nome do conjunto de segmentos.</p>

</dd>
<dt>Tamanho m&#225;x. do conjunto de segmentos</dt>
<dd><p>O n&#250;mero m&#225;ximo de segmentos no conjunto do segmentos.</p>

</dd>
<dt>Tamanho m&#237;n. do conjunto de segmentos</dt>
<dd><p>O n&#250;mero m&#237;nimo de segmentos no conjunto do segmentos. Esses conjuntos s&#227;o criados quando o conjunto de segmentos &#233; instanciado.</p>

</dd>
<dt>Tamanho m&#225;x. da fila</dt>
<dd><p>O n&#250;mero m&#225;ximo de mensagens que podem ser colocadas na fila at&#233; que segmentos estejam dispon&#237;veis para process&#225;-las.</p>

</dd>
<dt>Tempo limite do segmento ocioso</dt>
<dd><p>O per&#237;odo de tempo em segundos ap&#243;s o qual os segmentos inativos s&#227;o removidos do conjunto.</p>

</dd>
</dl>
<p>A tabela Conjunto de segmentos tamb&#233;m cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Novo</dt>
<dd><p>Bot&#227;o utilizado para criar um novo conjunto de segmentos.</p>

</dd>
<dt>Excluir</dt>
<dd><p>Bot&#227;o utilizado para excluir um ou mais conjunto de segmentos selecionados.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-threadpoolnew.html">Para criar um conjunto de segmentos</a></p>

</li>
<li><p><a href="task-threadpooledit.html">Para editar um conjunto de segmentos</a></p>

</li>
<li><p><a href="task-threadpooldelete.html">Para excluir um conjunto de segmentos.</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-threadpool-1"><tt>create-threadpool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-threadpools-1"><tt>list-threadpools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-threadpool-1"><tt>delete-threadpool</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
