<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-networklisteneredit"></a><h4>Editar escuta de rede</h4>
<a name="indexterm-66"></a><p>Utilize a p&#225;gina Editar escuta de rede para modificar uma escuta de
rede existente.</p>

<p>Quando voc&#234; edita uma escuta de rede, as abas SSL, HTTP e
Arquivo de cache para o protocolo associado, tamb&#233;m est&#227;o dispon&#237;veis para edi&#231;&#227;o.</p>

<p>A p&#225;gina Editar escuta de rede cont&#233;m essas op&#231;&#245;es.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome da configura&#231;&#227;o</dt>
<dd><p>Nome da configura&#231;&#227;o ao qual as configura&#231;&#245;es desta p&#225;gina ser&#227;o enviadas. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Nome</dt>
<dd><p>O nome &#250;nico da escuta. O campo Nome &#233; de somente leitura. Voc&#234; pode especificar o nome somente quando cria uma nova escuta de rede.</p>

</dd>
<dt>Protocolo</dt>
<dd><p>O protocolo associado &#224; escuta de rede. O campo Protocolo &#233; de somente leitura. Voc&#234; pode criar ou especificar um protocolo somente ao criar uma nova escuta de rede.</p>

</dd>
<dt>Status</dt>
<dd><p>O status da escuta de rede. A escuta pode ser ativada ou desativada. Por padr&#227;o, a op&#231;&#227;o est&#225; ativa. Se o interpretador estiver desativado, qualquer tentativa de se conectar &#224; escuta resulta em uma exce&#231;&#227;o de soquete (<tt>java.net.ConnectException</tt>).</p>

<p>Nas vers&#245;es do Servidor GlassFish anteriores a 9.1, uma escuta cujo atributo ativo estava definido como falso retornava um c&#243;digo de resposta 404, para quaisquer solicita&#231;&#245;es enviadas ao mesmo. Para obter esse comportamento na vers&#227;o atual do Servidor GlassFish, defina o status da escuta como ativo e cada estado de servidor virtual associado como DESATIVADO. Um servidor virtual lista suas escutas associadas na sua lista suspensa Escutas de rede.</p>

</dd>
<dt>Seguran&#231;a</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, ela ser&#225; ativada para o protocolo utilizado para a escuta de rede. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Escuta JK</dt>
<dd><p>Se essa op&#231;&#227;o estiver selecionada, a escuta suporta o protocolo <tt> mod-jk</tt> do Apache. O protocolo <tt>mod-jk</tt> &#233; um protocolo propriet&#225;rio de comunica&#231;&#227;o/rede entre o <tt>httpd</tt> (servidor da Web) da Apache e uma inst&#226;ncia back-end do Servidor GlassFish. Se a escuta oferece suporte a esse protocolo, o <tt>httpd</tt> deveria manipular todo o conte&#250;do est&#225;tico, enquanto quaisquer solicita&#231;&#245;es por recursos din&#226;micos (ou seja, Servlets e JSPs) s&#227;o roteadas para a escuta <tt>mod-jk</tt> ativado para a rede do Servidor GlassFish, utilizando o protocolo <tt>mod-jk</tt>. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Porta</dt>
<dd><p>O n&#250;mero da porta em que a escuta ser&#225; efetuada. Os valores v&#225;lidos s&#227;o 1 a 65.535. Em sistemas UNIX, a cria&#231;&#227;o de soquetes que escutam nas portas 1 a 1024 requer privil&#233;gios de superusu&#225;rio.</p>

</dd>
<dt>Endere&#231;o</dt>
<dd><p>O endere&#231;o IP em que a escuta de rede atuar&#225;. O endere&#231;o pode estar na nota&#231;&#227;o de par de pontos ou IPv6. Ele pode ser <tt>qualquer</tt> (para <tt>INADDR_ANY</tt>) para escutar todos s endere&#231;os de IP. Ele pode ser um nome de host.</p>

</dd>
<dt>Conjunto de segmentos</dt>
<dd><p>O conjunto de segmentos associado &#224; escuta de rede.</p>

</dd>
<dt>Transporte</dt>
<dd><p>O tipo de transporte da escuta de rede. Por padr&#227;o, o &#250;nico transporte &#233; o <tt>tcp</tt>.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-networklistenernew.html">Para criar uma escuta de rede</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">Para editar uma escuta de rede</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">Para excluir uma escuta de rede</a></p>

</li>
<li><p><a href="task-protocolnew.html">Para criar um protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">Para editar um protocolo</a></p>

</li>
<li><p><a href="task-protocolssledit.html">Para editar as configura&#231;&#245;es SSL para um protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">Para editar as configura&#231;&#245;es HTTP para um protocolo</a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">Para editar as configura&#231;&#245;es de um arquivo de cache para um protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">Para excluir um protocolo</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-network-listener-1"><tt>create-network-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-network-listeners-1"><tt>list-network-listeners</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-network-listener-1"><tt>delete-network-listener</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
