<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-virtualserveredit"></a><h3>Editar um servidor virtual</h3><a name="indexterm-19"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>No n&#243; Configura&#231;&#227;o, selecione o n&#243; Servidores Virtuais.</b><p>A p&#225;gina Servidores Virtuais &#233; aberta.</p></li>
<li><b>NA p&#225;gina Servidores Virtuais, clique no nome do servidor virtual a ser
editado.</b><p>&#201; aberta a p&#225;gina Editar Servidor Virtual.</p></li>
<li><b>No campo Hosts, digite os nomes de host ou endere&#231;os IP da
m&#225;quina na qual o servidor est&#225; sendo executado.</b><p>Use nomes de host reais ou virtuais, registrados no servidor de DNS
da sua rede (e, no sistema UNIX, no arquivo <tt>/etc/hosts </tt>). O valor
padr&#227;o &#233; a propriedade do sistema <tt>${com.sun.aas.hostName}</tt>.</p></li>
<li><b>Selecione uma op&#231;&#227;o de Estado para o servidor virtual.</b><p>O valor pode ser um dos seguintes:</p><dl><dt>Ligado</dt>
<dd><p>O servidor virtual est&#225; ativo. Esse &#233; o valor padr&#227;o.</p>

</dd>
<dt>Desligado</dt>
<dd><p>O servidor virtual est&#225; inativo. As tentativas de acessar o servidor retornam o c&#243;digo de erro 404 (recurso indispon&#237;vel).</p>

</dd>
<dt>Desativado</dt>
<dd><p>O servidor virtual est&#225; desativado. As tentativas de acessar o servidor retornam o c&#243;digo de erro 403 (execu&#231;&#227;o da solicita&#231;&#227;o recusada).</p>

</dd>
</dl>
</li>
<li><b>Selecione uma op&#231;&#227;o SSO para o novo servidor virtual.</b><p>Por padr&#227;o, um servidor virtual herda a configura&#231;&#227;o de logon &#250;nico (SSO)
do servi&#231;o HTTP. Selecione Ativado ou Desativado para sobrepor a configura&#231;&#227;o do
servi&#231;o HTTP ao ativar ou desativar o logon &#250;nico para este servidor
virtual.</p><p>O logon &#250;nico em aplicativos no Servidor GlassFish tem suporte de servlets
e arquivos JSP.  Esse recurso permite o compartilhamento dessa informa&#231;&#227;o pelos
v&#225;rios aplicativos que exigem as mesmas informa&#231;&#245;es de logon de usu&#225;rio, em
vez de exigir que o usu&#225;rio fa&#231;a logon separado em cada aplicativo.
</p></li>
<li><b>Na lista suspensa Escutas de rede, selecione um ou mais escutas de
rede ou deixe o campo em branco.</b></li>
<li><b>Na lista suspensa M&#243;dulo da Web Padr&#227;o, selecione o m&#243;dulo que deve
responder a todas as solicita&#231;&#245;es que n&#227;o podem ser mapeadas para outros
m&#243;dulos da Web usados para o servidor virtual.</b><p>Se n&#227;o for especificado um m&#243;dulo da Web padr&#227;o, ser&#225; usado o
m&#243;dulo da Web que tenha uma raiz de contexto vazia. Se n&#227;o
houver nenhum m&#243;dulo da Web com raiz de contexto vazia, um m&#243;dulo
da Web padr&#227;o do sistema ser&#225; criado e utilizado.</p></li>
<li><b>No campo Arquivo de Log, digite o nome do caminho do arquivo
no qual ser&#227;o exibidas as mensagens de log desse servidor virtual.</b><p>Por padr&#227;o, as mensagens de log ser&#227;o enviadas para o log do
servidor padr&#227;o, <tt></tt><i>domain-dir</i><tt>/logs/server.log </tt>.</p></li>
<li><b>No campo Docroot, digite o caminho absoluto para o diret&#243;rio do documento
raiz do servidor.</b><p>O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/docroot</tt>.</p></li>
<li><b>Para ativar ou desativar o log de acesso, selecione a op&#231;&#227;o Log
de Acesso.</b><p>Por padr&#227;o, um servidor virtual herda a configura&#231;&#227;o de registro de acesso
do servi&#231;o HTTP. Selecione Ativado ou Desativado para sobrepor a configura&#231;&#227;o do
servi&#231;o HTTP ao ativar ou desativar o registro de acesso para este
servidor virtual.</p></li>
<li><b>No campo Diret&#243;rio, digite o caminho absoluto do diret&#243;rio para os logs
de acesso do servidor.</b><p>O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/logs/access </tt>.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique propriedades adicionais do servidor virtual.</b><p>Para obter informa&#231;&#245;es sobre as propriedades dispon&#237;veis, consulte <a href="ref-virtualserverprops.html">Propriedades espec&#237;ficas de servidores virtuais</a>.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
brando que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-virtualservercreate.html">Para criar um servidor virtual</a></p>

</li>
<li><p><a href="task-virtualserverdelete.html">Excluir um servidor virtual</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
