<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-protocolfilecacheedit"></a><h3>Para editar as configura&#231;&#245;es de um arquivo de cache para um protocolo</h3><a name="indexterm-30"></a><a name="indexterm-31"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>No n&#243; Configura&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o da Rede.</b></li>
<li><b>No n&#243; Config da rede, selecione o n&#243; Protocolos.</b><p>&#201; aberta a p&#225;gina Protocolos.</p></li>
<li><b>Na p&#225;gina Protocolos, clique no nome do protocolo a ser editado.</b><p>&#201; aberta a p&#225;gina Editar Protocolo.</p></li>
<li><b>Na p&#225;gina Editar Protocolo, clique na guia Arquivo de cache.</b><p>&#201; aberta a p&#225;gina Cache de Arquivo.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Status Ativado para habilitar o cache do
arquivo.</b><p>Por padr&#227;o, essa op&#231;&#227;o est&#225; selecionada.</p></li>
<li><b>No campo Tempo M&#225;ximo, digite o tempo m&#225;ximo, em segundos, de uma
entrada de cache v&#225;lida.</b><p>Esse par&#226;metro controla a quantidade de informa&#231;&#245;es armazenadas em cache que ser&#225;
utilizada ap&#243;s o armazenamento de um arquivo no cache. Uma entrada mais
antiga do que a dura&#231;&#227;o m&#225;xima ser&#225; substitu&#237;da pela nova entrada do
mesmo arquivo. Se o conte&#250;do n&#227;o for alterado com frequ&#234;ncia, aumente esse
valor para melhorar o desempenho.</p><p>A dura&#231;&#227;o m&#225;xima mais eficiente depende da regularidade com que os arquivos
existentes s&#227;o modificados. Por exemplo, se os arquivos forem modificados quatro vezes
ao dia, em intervalos regulares, considere a possibilidade de definir a dura&#231;&#227;o
m&#225;xima em 21600 segundos (6 horas). Ou ent&#227;o, defina a dura&#231;&#227;o m&#225;xima
como sendo o tempo mais longo desejado para a exibi&#231;&#227;o da vers&#227;o
anterior de um arquivo ap&#243;s a modifica&#231;&#227;o.</p><p>O valor padr&#227;o &#233; 30.</p></li>
<li><b>No campo Tamanho M&#225;ximo de Cache, digite o tamanho total m&#225;ximo (em
bytes) do cache do arquivo em disco.</b><p>O valor padr&#227;o &#233; 10485760.</p></li>
<li><b>No campo Contagem M&#225;xima de Arquivos, digite o n&#250;mero m&#225;ximo de arquivos
que pode ser armazenado no cache do arquivo.</b><p>Se o valor for muito alto, o servidor armazenar&#225; em cache os
arquivos pouco necess&#225;rios, o que consome mem&#243;ria. Se o valor for muito
baixo, os benef&#237;cios do armazenamento em cache n&#227;o ser&#225; obtidos. Tente diferentes
valores desse atributo para encontrar a solu&#231;&#227;o mais eficiente para aplicativos espec&#237;ficos.</p><p>O valor padr&#227;o &#233; 1024.</p></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-networklistenernew.html">Para criar uma escuta de rede</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">Para editar uma escuta de rede</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">Para excluir uma escuta de rede</a></p>

</li>
<li><p><a href="task-protocolnew.html">Para criar um protocolo</a></p>

</li>
<li><p><a href="task-protocoledit.html">Para editar um protocolo</a></p>

</li>
<li><p><a href="task-protocolssledit.html">Para editar as configura&#231;&#245;es SSL para um protocolo</a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">Para editar as configura&#231;&#245;es HTTP para um protocolo</a></p>

</li>
<li><p><a href="task-protocoldelete.html">Para excluir um protocolo</a></p>

</li>
<li><p><a href="task-transportnew.html">Para criar um transporte</a></p>

</li>
<li><p><a href="task-transportedit.html">Para editar um transporte</a></p>

</li>
<li><p><a href="task-transportdelete.html">Para excluir um transporte</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
