<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-webcontaineravailability"></a><h3>Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente da Web</h3><a name="indexterm-12"></a><a name="indexterm-13"></a><a name="indexterm-14"></a><a name="indexterm-15"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Selecione a configura&#231;&#227;o que est&#225; sendo alterada.</b></li>
<li><b>No n&#243; da configura&#231;&#227;o, selecione o n&#243; Servi&#231;o de disponibilidade.</b><p>A p&#225;gina Servi&#231;o de disponibilidade &#233; exibida.</p></li>
<li><b>Na p&#225;gina Servi&#231;o de disponibilidade, clique a guia Disponibilidade de recipiente da
Web.</b><p>A p&#225;gina Disponibilidade de recipiente da Web &#233; exibida.</p></li>
<li><b>No campo Servi&#231;o de disponibilidade, marque a caixa Ativo para ativar a
disponibilidade do recipiente da Web.</b><p>Para desativar a disponibilidade, desmarque a caixa Ativo do Servi&#231;o de disponibilidade.</p></li>
<li><b>Na lista suspensa Tipo de persist&#234;ncia, selecione o mecanismo de persist&#234;ncia.</b><ul>
<li><b>Se a op&#231;&#227;o Servi&#231;o de disponibilidade ativado <b>n&#227;o</b> estiver marcada, selecione uma
das seguintes op&#231;&#245;es:</b>
<ul><li><p><tt>memory</tt> para nenhuma persist&#234;ncia de sess&#227;o</p>

</li>
<li><p><tt>file</tt> para persist&#234;ncia de sess&#227;o com base no sistema de arquivos que n&#227;o est&#225; altamente dispon&#237;vel</p>

</li></ul>
</li>
<li><b>Se a op&#231;&#227;o Servi&#231;o de disponibilidade ativado estiver marcada, selecione <tt>replicated</tt> para
persist&#234;ncia de sess&#227;o com base no failover do cluster que est&#225; altamente
dispon&#237;vel.</b></li></ul></li>
<li><b>Na lista suspensa Frequ&#234;ncia da persist&#234;ncia, selecione a frequ&#234;ncia na qual a
sess&#227;o HTTP &#233; armazenada:</b>
<ul><li><p><tt>web-method</tt> &#8212; O estado da sess&#227;o &#233; armazenado no final de cada solicita&#231;&#227;o, antes do envio de uma resposta de volta para o cliente. Este modo oferece a melhor garantia de que o estado da sess&#227;o estar&#225; totalmente atualizado em caso de falha. Esse &#233; o padr&#227;o.</p>

</li></ul>
<p>A frequ&#234;ncia da persist&#234;ncia se aplica somente se o tipo de persist&#234;ncia
for <tt> replicated</tt>.</p></li>
<li><b>Na lista suspensa Escopo da persist&#234;ncia, selecione as altera&#231;&#245;es do escopo da
sess&#227;o HTTP necess&#225;rias para que o armazenamento ocorra:</b>
<ul><li><p><tt>session</tt> &#8212; Todo o estado da sess&#227;o &#233; armazenado a cada instante. Este modo oferece a melhor garantia de que os dados da sess&#227;o sejam corretamente armazenados em qualquer aplicativo da Web distribu&#237;vel.</p>

</li>
<li><p><tt>modified-session</tt> &#8212; Todo o estado da sess&#227;o &#233; armazenado se ela tiver sido modificada. Uma sess&#227;o &#233; considerada modificada caso <tt>HttpSession.setAttribute()</tt> ou <tt> HttpSession.removeAttribute()</tt> tenha sido chamado. Certifique-se de chamar <tt>setAttribute()</tt> sempre que um atributo for alterado. N&#227;o se trata de um requisito da especifica&#231;&#227;o Java EE, mas sim uma necessidade para que este modo funcione corretamente.</p>

</li>
<li><p><tt>modified-attribute</tt> &#8212; Somente os atributos modificados da sess&#227;o s&#227;o armazenados. Para que este modo funcione corretamente, &#233; necess&#225;rio seguir estas diretrizes:</p>


<ul><li><p>Chame <tt>setAttribute()</tt> sempre que o estado da sess&#227;o for modificado.</p>

</li>
<li><p>Certifique-se de que n&#227;o haja refer&#234;ncias cruzadas entre os atributos. O gr&#225;fico do objeto em cada chave de atributo diferente &#233; serializado e armazenado separadamente. Se houver quaisquer refer&#234;ncias cruzadas do objeto entre os objetos em cada chave diferente, eles n&#227;o s&#227;o serializados e desserializados corretamente.</p>

</li>
<li><p>Distribua o estado da sess&#227;o em muitos atributos ou, pelo menos, entre um atributo somente leitura e um atributo modific&#225;vel.</p>

</li></ul>
</li></ul>
<p>O escopo da persist&#234;ncia se aplica somente se o tipo de persist&#234;ncia
for <tt> replicated</tt>.</p></li>
<li><b>No campo Estado de logon &#250;nico, marque a caixa Ativo para tornar
o estado de logon &#250;nico dispon&#237;vel para failover.</b><p>Para que o estado de logon &#250;nico n&#227;o esteja dispon&#237;vel para failover,
remova a marca da caixa Estado de logon &#250;nico.</p></li>
<li><b>Para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es, clique no bot&#227;o
Carregar padr&#245;es.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique essas propriedades.</b><p>O Servidor GlassFish n&#227;o define nenhuma propriedade adicional da disponibilidade do recipiente
da Web.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-webcontainergeneral.html">Para configurar as propriedades gerais do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Para configurar as propriedades da sess&#227;o do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Para configurar as propriedades do gerenciador do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Para configurar as propriedades de armazenamento do recipiente da Web</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
