<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-webcontainerstoreprops"></a><h4>Para configurar as propriedades de armazenamento do recipiente da Web</h4><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Selecione a configura&#231;&#227;o que est&#225; sendo alterada.</b></li>
<li><b>No n&#243; da configura&#231;&#227;o, selecione o n&#243; Recipiente da Web.</b><p>A p&#225;gina Propriedades Gerais &#233; exibida.</p></li>
<li><b>Na p&#225;gina Propriedades Gerais, clique na guia  Propriedades de Armazenamento.</b><p>A p&#225;gina Propriedades de Armazenamento &#233; exibida.</p></li>
<li><b>No campo Diret&#243;rio, digite o nome do caminho absoluto ou relativo do
diret&#243;rio no qual os arquivos individuais da sess&#227;o s&#227;o gravados.</b><p>O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/generated/jsp/j2ee-apps/</tt><i>appname</i><tt>/</tt><i>appname</i><tt>_war</tt>. </p><p>Um caminho relativo para o diret&#243;rio tempor&#225;rio de trabalho para este aplicativo
Web.</p><p>Esta configura&#231;&#227;o se aplica somente se o tipo de persist&#234;ncia for <tt>file</tt>.
Para definir o tipo de persist&#234;ncia, consulte <a href="task-webcontaineravailability.html">Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente da Web</a>.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique essas propriedades.</b><p>O Servidor GlassFish n&#227;o define propriedades adicionais para o armazenamento.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-webcontainergeneral.html">Para configurar as propriedades gerais do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Para configurar as propriedades da sess&#227;o do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Para configurar as propriedades do gerenciador do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente da Web</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
