<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-accesslog"></a><h3>Para configurar o servi&#231;o HTTP</h3><a name="indexterm-16"></a><a name="indexterm-17"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>No n&#243; Configura&#231;&#227;o, selecione o n&#243; Servi&#231;o HTTP.</b><p>A p&#225;gina Servi&#231;o HTTP &#233; exibida.</p></li>
<li><b>Selecione a caixa de sele&#231;&#227;o SSO ativado, para ativar o logon &#250;nico
por padr&#227;o para todos os aplicativos da Web em todos os servidores
virtuais neste servidor que est&#227;o configurados para o mesmo dom&#237;nio.</b><p>Voc&#234; pode sobrepor esta configura&#231;&#227;o para um servidor virtual individual. Por padr&#227;o,
a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Log de Acesso Ativado para ativar o
log de acesso para todos os subelementos de servidor virtual que n&#227;o
especificarem essa propriedade. </b><p>Se a caixa de sele&#231;&#227;o Log de Acesso Ativado for desmarcada, o
log de acesso ser&#225; desativado para todos os subelementos de servidor virtual
que n&#227;o especificarem essa propriedade. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Rota&#231;&#227;o Ativada para ativar a circula&#231;&#227;o do
arquivo de registro.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>Na lista suspensa Pol&#237;tica de Rota&#231;&#227;o, selecione uma pol&#237;tica.</b><p>A &#250;nica pol&#237;tica de rota&#231;&#227;o dispon&#237;vel &#233; <tt>tempo</tt>.</p></li>
<li><b>No campo Intervalo de Rota&#231;&#227;o, digite o n&#250;mero de minutos entre as
rota&#231;&#245;es do log de acesso. </b><p>Esse campo s&#243; ser&#225; v&#225;lido se a Pol&#237;tica de Rota&#231;&#227;o for <tt>tempo</tt>.
O valor padr&#227;o &#233; 1.440 minutos (24 horas).</p></li>
<li><b>No campo Sufixo de Rota&#231;&#227;o, digite o valor de sequ&#234;ncia a ser
adicionado ao final do nome do arquivo de log, ap&#243;s a rota&#231;&#227;o.</b><p>O valor padr&#227;o &#233; <tt>dd-MM-yyyy</tt>.</p><p>Verifique se o sufixo de rota&#231;&#227;o cont&#233;m valores suficientes para criar um
sufixo exclusivo para cada rota&#231;&#227;o de log. Por exemplo, se o log
de acesso for circulado mais de uma vez ao dia, inclua a
hora do dia no sufixo de rota&#231;&#227;o.</p><p>Um sufixo exclusivo &#233; necess&#225;rio para assegurar que o arquivo de log
de acesso seja circulado sempre que o intervalo de rota&#231;&#227;o for cumprido.
Se o sufixo de rota&#231;&#227;o do novo arquivo de log de acesso
for igual ao sufixo de rota&#231;&#227;o do arquivo de log existente, o
arquivo n&#227;o ser&#225; circulado.</p></li>
<li><b>No campo Contagem m&#225;xima de arquivos, digite o n&#250;mero m&#225;ximo de arquivos
de registro de acesso rotacionado a serem mantidos.</b><p>Um valor negativo indica que n&#227;o h&#225; limite para a contagem de
arquivos. O valor padr&#227;o &#233; -1.</p></li>
<li><b>No campo Tamanho do buffer, digite o tamanho em bytes, do buffer
de registros de acesso.</b><p>Um valor menor que ou igual a 0 desativa o armazenamento em
buffer de registros de acesso. O valor padr&#227;o &#233; 32.768.</p></li>
<li><b>No campo Intervalo de grava&#231;&#227;o, digite o n&#250;mero de segundos que antecede
a grava&#231;&#227;o do registro em disco.</b><p>O log de acesso &#233; gravado quando o buffer est&#225; cheio ou
quando o intervalo expira. Se o valor for menor que ou igual
a 0, o buffer ser&#225; sempre gravado, mesmo que n&#227;o esteja cheio. 
Isso significa que, a cada vez que o servidor &#233; acessado, a
mensagem de log &#233; armazenada diretamente no arquivo. O valor padr&#227;o &#233;
300.</p></li>
<li><b>No campo Formato, digite o valor de sequ&#234;ncia para especificar as seguintes
propriedades do registro de acesso:</b>
<ul><li><p>As informa&#231;&#245;es a serem capturadas no log de acesso</p>

</li>
<li><p>A ordem em que as informa&#231;&#245;es ser&#227;o capturadas</p>

</li></ul>
<p>O valor padr&#227;o &#233; o seguinte:</p><pre>%client.name% %auth-user-name% %datetime% %request% %status% %response.length%</pre><p>Esses valores est&#227;o dispon&#237;veis para inclus&#227;o na sequ&#234;ncia de formato:</p><dl><dt><tt>%attribute.<i>name</i>%</tt></dt>
<dd><p>Registra o valor (ao chamar seu m&#233;todo <tt>toString</tt>) do atributo de solicita&#231;&#227;o com o determinado <i>nome</i></p>

</dd>
<dt><tt>%auth-user-name%</tt></dt>
<dd><p>Nome do usu&#225;rio autorizado</p>

</dd>
<dt><tt>%client.name%</tt></dt>
<dd><p>Nome do host cliente</p>

</dd>
<dt><tt>%client.dns%</tt></dt>
<dd><p>DNS Cliente</p>

</dd>
<dt><tt>%cookie.<i>name</i>%</tt></dt>
<dd><p>O valor do cookie solicitado com o <i>nome</i> determinado</p>

</dd>
<dt><tt>%cookie.value%</tt></dt>
<dd><p>O valor do primeiro cookie encontrado na solicita&#231;&#227;o</p>

</dd>
<dt><tt>%datetime%</tt></dt>
<dd><p>Data do sistema</p>

</dd>
<dt><tt>%request%</tt></dt>
<dd><p>Linha de solicita&#231;&#227;o de HTTP completo</p>

</dd>
<dt><tt>%status%</tt></dt>
<dd><p>Status</p>

</dd>
<dt><tt>%response.length%</tt></dt>
<dd><p>Tamanho do conte&#250;do da resposta</p>

</dd>
<dt><tt>%header.referer%</tt></dt>
<dd><p>Cabe&#231;alho do referenciador</p>

</dd>
<dt><tt>%header.user-agent%</tt></dt>
<dd><p>Cabe&#231;alho de agente do usu&#225;rio</p>

</dd>
<dt><tt>%http-method%</tt></dt>
<dd><p>M&#233;todo HTTP</p>

</dd>
<dt><tt>%http-uri%</tt></dt>
<dd><p>URI HTTP</p>

</dd>
<dt><tt>%query-str%</tt></dt>
<dd><p>Sequ&#234;ncia de consulta HTTP</p>

</dd>
<dt><tt>%http-version%</tt></dt>
<dd><p>Vers&#227;o do protocolo HTTP</p>

</dd>
<dt><tt>%header.accept%</tt></dt>
<dd><p>Cabe&#231;alho da aceita&#231;&#227;o</p>

</dd>
<dt><tt>%header.date%</tt></dt>
<dd><p>Cabe&#231;alho de data</p>

</dd>
<dt><tt>%header.if-mod-since%</tt></dt>
<dd><p>Cabe&#231;alho Se modificado desde</p>

</dd>
<dt><tt>%header.auth%</tt></dt>
<dd><p>Cabe&#231;alho da autoriza&#231;&#227;o</p>

</dd>
<dt><tt>%header.<i>any</i>%</tt></dt>
<dd><p>Um valor de cabe&#231;alho HTTP v&#225;lido em RFC 2616 (<tt>qualquer</tt> tamb&#233;m &#233; um valor de cabe&#231;alho v&#225;lido; est&#225; especificado como vari&#225;vel, aqui)</p>

</dd>
<dt><tt>%session.<i>name</i>%</tt></dt>
<dd><p>O valor do atributo da sess&#227;o com o nome <i>nome</i>, <tt>NULL-SESSION-ATTRIBUTE-<i>nome</i></tt> se o atributo nomeado n&#227;o existe na sess&#227;o ou <tt>NULL-SESSION</tt> se nenhuma sess&#227;o existe</p>

</dd>
<dt><tt>%time-taken%</tt></dt>
<dd><p>Tempo (em milissegundos) que levou para efetuar o servi&#231;o de cada solicita&#231;&#227;o</p>

</dd>
<dt><tt>%vs.id%</tt></dt>
<dd><p>ID do servidor virtual</p>

</dd>
</dl>
</li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para obter uma descri&#231;&#227;o das propriedades dispon&#237;veis, consulte <a href="ref-httpserviceprops.html">Propriedades espec&#237;ficas do servi&#231;o HTTP</a>.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
brando que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol>

<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
