<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-webcontainersessiontimeout"></a><h3>Para configurar as propriedades da sess&#227;o do recipiente da Web</h3><a name="indexterm-3"></a><a name="indexterm-4"></a><a name="indexterm-5"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Selecione a configura&#231;&#227;o que est&#225; sendo alterada.</b></li>
<li><b>No n&#243; da configura&#231;&#227;o, selecione o n&#243; Recipiente da Web.</b><p>A p&#225;gina Propriedades Gerais &#233; exibida.</p></li>
<li><b>Na p&#225;gina Propriedades Gerais, clique na guia  Propriedades de Sess&#227;o.</b><p>A p&#225;gina Propriedades de Sess&#227;o &#233; exibida.</p></li>
<li><b>No campo Tempo limite da sess&#227;o, digite o n&#250;mero m&#225;ximo de segundos
durante o qual uma sess&#227;o inativa permanece v&#225;lida.</b><p>O valor padr&#227;o &#233; 1.800. Se o valor &#233; definido como 0,
a sess&#227;o nunca expira.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para obter uma descri&#231;&#227;o das propriedades dispon&#237;veis, consulte <a href="ref-websessionproperties.html">Propriedades espec&#237;ficas para sess&#245;es de recipiente da Web</a>.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-webcontainergeneral.html">Para configurar as propriedades gerais do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Para configurar as propriedades do gerenciador do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Para configurar as propriedades de armazenamento do recipiente da Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente da Web</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
