<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-threadpooledit"></a><h3>Para editar um conjunto de segmentos</h3><a name="indexterm-37"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>No n&#243; Configura&#231;&#227;o, selecione o n&#243; conjunto de segmentos.</b><p>&#201; aberta a p&#225;gina conjunto de segmentos.</p></li>
<li><b>Na p&#225;gina conjunto de segmentos, clique no nome do conjunto de segmentos
a ser editado.</b><p>&#201; aberta a p&#225;gina Editar conjunto de segmentos.</p></li>
<li><b>Na p&#225;gina Editar conjunto de segmentos, No campo Nome da classe, digite
o nome totalmente qualificado da classe de implementa&#231;&#227;o do conjunto de segmentos.</b><p>O valor padr&#227;o &#233; <tt>com.sun.grizzly.http.StatsThreadPool</tt>.</p></li>
<li><b>No campo Tamanho m&#225;ximo da fila, digite o n&#250;mero m&#225;ximo de mensagens
que podem ser colocadas na fila at&#233; que os segmentos estejam dispon&#237;veis
para process&#225;-las.</b><p>Um valor de -1 indica que n&#227;o h&#225; limite para o tamanho
da fila. O valor padr&#227;o &#233; 4096.</p></li>
<li><b>No campo Tamanho M&#225;ximo do conjunto de segmentos, digite a quantidade m&#225;xima
de segmentos que pode haver no conjunto de segmentos.</b><p>O valor padr&#227;o &#233; 5. Esse &#233; o valor recomendado para conjunto
de segmentos de escuta de rede.</p></li>
<li><b>No campo Tamanho M&#237;nimo do conjunto de segmentos, digite a quantidade m&#237;nima
de segmentos que pode haver no conjunto de segmentos.</b><p>Esses segmentos s&#227;o criados quando o conjunto do segmentos &#233; instanciado. O
valor padr&#227;o &#233; 2.</p></li>
<li><b>No campo Tempo limite de segmentos inativos, digite a quantidade m&#225;xima de
tempo, em segundos, que um segmento pode permanecer ocioso no conjunto.</b><p>Ap&#243;s esse per&#237;odo, o segmento ser&#225; removido do conjunto.  O valor
padr&#227;o &#233; 900.</p></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>


<hr>
</li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-threadpoolnew.html">Para criar um conjunto de segmentos</a></p>

</li>
<li><p><a href="task-threadpooldelete.html">Para excluir um conjunto de segmentos.</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
