<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-configtransrecovery"></a><h4>C&#243;mo configurar la forma en que GlassFish Server recupera transacciones</h4><a name="indexterm-2"></a><p>Las transacciones pueden estar incompletas porque ha fallado el servidor o un
administrador de recursos. Es esencial completar estas transacciones encalladas y solucionar el
error. GlassFish Server est&#225; dise&#241;ado para recuperarse de estos errores y completar
la transacci&#243;n al iniciar el servidor.</p>

<p>Mientras se realiza la recuperaci&#243;n, si algunos de los recursos no son
accesibles, el reinicio del servidor puede demorarse mientras intenta recuperar las transacciones.</p>

<p>Cuando la transacci&#243;n ocupa varios servidores, el servidor que inici&#243; la transacci&#243;n
puede contactar los dem&#225;s servidores para obtener el resultado de las transacciones.
Si los dem&#225;s servidores no son accesibles, la transacci&#243;n utilizar&#225; el campo
Decisi&#243;n heur&#237;stica para determinar el resultado.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Configuraci&#243;n.</b></li>
<li><b>Seleccione la instancia que va a configurar:</b><ul>
<li><b>Para configurar una instancia determinada, seleccione el nodo de configuraci&#243;n de la
instancia. Por ejemplo para la instancia predeterminada <tt>server</tt>, seleccione el nodo <tt>server-config</tt>.</b></li>
<li><b>Para configurar los ajustes predeterminados para todas las instancias, seleccione el nodo
<tt>default-config</tt>.</b></li></ul></li>
<li><b>Seleccione el nodo Servicio de transacciones.</b><p>Se abrir&#225; la p&#225;gina Servicio de transacciones.</p></li>
<li><b>En la p&#225;gina Servicio de transacciones, seleccione la casilla de verificaci&#243;n Habilitado
en el reinicio para habilitar la recuperaci&#243;n de transacciones incompletas. </b><p>De forma predeterminada, no se selecciona la casilla de verificaci&#243;n Habilitado.</p></li>
<li><b>En el campo Tiempo de espera de reintento, introduzca el n&#250;mero de
segundos que GlassFish Server intenta conectarse a un servidor inaccesible.</b><p>El valor predeterminado es 600 (10 minutos).</p></li>
<li><b>En la lista desplegable Decisi&#243;n heur&#237;stica, seleccione la pol&#237;tica de servidores inaccesibles
de una transacci&#243;n.</b><p>A menos que exista una buena raz&#243;n para seleccionar Confirmar, deje la
opci&#243;n Decisi&#243;n heur&#237;stica en Anulaci&#243;n (el modo predeterminado). Enviar transacciones indeterminadas puede
poner en peligro la integridad de los datos de su aplicaci&#243;n.</p></li>
<li><b>Haga clic en Guardar.</b></li>
<li><b>Reinicie GlassFish Server.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-configtransservice.html">C&#243;mo configurar el servicio de transacciones</a></p>

</li>
<li><p><a href="task-settranstimeout.html">C&#243;mo establecer un valor de tiempo de espera para las transacciones</a></p>

</li>
<li><p><a href="task-settranslog.html">C&#243;mo establecer la ubicaci&#243;n de los registros de transacciones</a></p>

</li>
<li><p><a href="task-setkeyptinterval.html">C&#243;mo establecer el intervalo de puntos clave</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
