<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setkeyptinterval"></a><h4>C&#243;mo establecer el intervalo de puntos clave</h4><a name="indexterm-6"></a><a name="indexterm-7"></a><p>Las operaciones de puntos clave comprimen el archivo de registro de transacciones.
El intervalo de puntos clave es el n&#250;mero de transacciones entre las
operaciones de puntos clave en el registro. Las operaciones de puntos clave
pueden reducir el tama&#241;o de los archivos de registro de transacciones. Un
n&#250;mero elevado de intervalos de puntos clave puede tener como resultado archivos
de registro de transacciones mayores pero menos operaciones de puntos clave y
potencialmente un rendimiento mejor. Un intervalo de puntos clave m&#225;s peque&#241;o (por
ejemplo, 256) originar&#225; archivos de registro m&#225;s peque&#241;os, pero se ver&#225; afectado
el rendimiento debido a la mayor frecuencia de operaciones de puntos clave.</p>

<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, ampl&#237;e el nodo Configuraci&#243;n.</b></li>
<li><b>Seleccione la instancia que va a configurar:</b><ul>
<li><b>Para configurar una instancia determinada, seleccione el nodo de configuraci&#243;n de la
instancia. Por ejemplo para la instancia predeterminada <tt>server</tt>, seleccione el nodo <tt>server-config</tt>.</b></li>
<li><b>Para configurar los ajustes predeterminados para todas las instancias, seleccione el nodo
<tt>default-config</tt>.</b></li></ul></li>
<li><b>Seleccione el nodo Servicio de transacciones.</b><p>Se abrir&#225; la p&#225;gina Servicio de transacciones.</p></li>
<li><b>En el campo del intervalo de puntos clave, escriba el n&#250;mero de
transacciones entre las operaciones de puntos clave.</b><p>El valor predeterminado es 65536.</p></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-configtransservice.html">C&#243;mo configurar el servicio de transacciones</a></p>

</li>
<li><p><a href="task-configtransrecovery.html">C&#243;mo configurar la forma en que GlassFish Server recupera transacciones</a></p>

</li>
<li><p><a href="task-settranstimeout.html">C&#243;mo establecer un valor de tiempo de espera para las transacciones</a></p>

</li>
<li><p><a href="task-settranslog.html">C&#243;mo establecer la ubicaci&#243;n de los registros de transacciones</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados. <a href="docinfo.html">Advertencia legal</a></small>
