<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransrecovery" name="task-configtransrecovery"></a><a id="GHJTS00005" name="GHJTS00005"></a></p>

<h4><a id="sthref4" name="sthref4"></a>Configurar el Modo en el que Servidor GlassFish Recupera Transacciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las transacciones pueden estar incompletas porque ha fallado el servidor o un administrador de recursos. Es esencial completar estas transacciones encalladas y solucionar el error. Servidor GlassFish est&aacute; dise&ntilde;ado para recuperarse de estos errores y completar la transacci&oacute;n al iniciar el servidor.</p>
<p>Mientras se realiza la recuperaci&oacute;n, si algunos de los recursos no son accesibles, el reinicio del servidor puede demorarse mientras intenta recuperar las transacciones.</p>
<p>Cuando la transacci&oacute;n ocupa varios servidores, el servidor que inici&oacute; la transacci&oacute;n puede contactar con los dem&aacute;s servidores para obtener el resultado de las transacciones. Si los dem&aacute;s servidores no son accesibles, la transacci&oacute;n utilizar&aacute; el campo Decisi&oacute;n Heur&iacute;stica para determinar el resultado.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la instancia que va a configurar:</p>
<ul>
<li>
<p>Para configurar una instancia determinada, seleccione el nodo de configuraci&oacute;n de la instancia. Por ejemplo, para la instancia por defecto <code>server</code>, seleccione el nodo <code>server-config</code>.</p>
</li>
<li>
<p>Para configurar los ajustes por defecto para todas las instancias, seleccione el nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Seleccione el nodo Servicio de Transacci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de Transacci&oacute;n.</p>
</li>
<li>
<p>En la p&aacute;gina Servicio de Transacci&oacute;n, seleccione la casilla de verificaci&oacute;n de activaci&oacute;n de Al Reiniciar para activar la recuperaci&oacute;n de transacciones incompletas.</p>
<p>Por defecto, no se selecciona la casilla de verificaci&oacute;n Activado.</p>
</li>
<li>
<p>En el campo Timeout de Reintentos, introduzca el n&uacute;mero de segundos que Servidor GlassFish intenta conectarse a un servidor inaccesible.</p>
<p>El valor por defecto es 600 (10 minutos).</p>
</li>
<li>
<p>En la lista desplegable Decisi&oacute;n Heur&iacute;stica, seleccione la pol&iacute;tica de servidores inaccesibles de una transacci&oacute;n.</p>
<p>A menos que exista una buena raz&oacute;n para seleccionar Confirmar, deje la opci&oacute;n Decisi&oacute;n Heur&iacute;stica en Realizar Rollback (el modo por defecto). Enviar transacciones indeterminadas puede poner en peligro la integridad de los datos de su aplicaci&oacute;n.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
<li>
<p>Reinicie Servidor GlassFish.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Configurar el Servicio de Transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Definir un Valor de Timeout de Transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Definir la Ubicaci&oacute;n de los Logs de Transacciones</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Definir Intervalo de Punto Clave</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
