<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmsservice"></a><h4>JMS-Dienst</h4>
<a name="indexterm-43"></a><p>Auf der Seite "JMS-Dienst" k&#246;nnen Sie Einstellungen konfigurieren, die von allen JMS-Verbindungen
verwendet werden sollen.</p>

<p>Weitere Informationen zum Konfigurieren des JMS-Dienstes finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2418&id=beaob">Kapitel 17, Using the Java Message Service in <i>Oracle GlassFish Server 3.1 Application Development Guide</i></a>.</p>

<p>Die Seite "JMS-Dienst" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r alle Einstellungen.</p>

</dd>
<dt>Ping</dt>
<dd><p>Schaltfl&#228;che zur &#220;berpr&#252;fung, ob der JMS-Dienst auf dem standardm&#228;&#223;igen JMS-Host ausgef&#252;hrt wird. Wenn der JMS-Dienst gegenw&#228;rtig ausgef&#252;hrt wird, wird die Meldung ausgegeben, dass der Ping-Test erfolgreich war.</p>

</dd>
<dt>Konfigurationsname</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Typ</dt>
<dd><p>Der Zugriffstyp f&#252;r den JMS-Dienst. Zur Auswahl stehen:</p>

<dl><dt>EMBEDDED</dt>
<dd><p>Es wird auf den JMS-Dienst auf dem lokalen Host zugegriffen. Der JMS-Dienst wird in derselben JVM gestartet wie GlassFish-Server. Bei tr&#228;ger Initialisierung wird der eingebettete Standard-Broker nicht beim Start von GlassFish-Server, sondern beim ersten Zugriff auf JMS-Dienste gestartet. Dies ist der standardm&#228;&#223;ige JMS-Diensttyp.</p>

</dd>
<dt>LOCAL</dt>
<dd><p>Es wird auf den JMS-Dienst auf dem lokalen Host zugegriffen. Der JMS-Provider wird gleichzeitig mit GlassFish-Server gestartet.</p>

</dd>
<dt>REMOTE</dt>
<dd><p>Es wird auf einen JMS-Dienst auf einem anderen System zugegriffen. Bei Auswahl von REMOTE wird der JMS-Dienst beim n&#228;chsten Serverstart nicht durch GlassFish-Server gestartet. Stattdessen wird der JMS-Dienst &#252;ber Message Queue gestartet und verwaltet, sodass der Message Queue-Broker separat gestartet werden muss. Weitere Informationen zum Starten des Brokers finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2438&id=aeoby">Starting Brokers in <i>Oracle GlassFish Message Queue 4.5 Administration Guide</i></a>. Wenn Sie diesen Wert w&#228;hlen und einen Remotehost verwenden, befolgen Sie die Anweisungen unter <a href="task-jmshostedit.html">So bearbeiten Sie einen JMS-Host</a>, um den Namen des Remotehosts anzugeben.</p>

</dd>
</dl>
</dd>
<dt>Zeit&#252;berschreitung beim Starten</dt>
<dd><p>Die Anzahl Sekunden, die GlassFish-Server auf das Starten des JMS-Diensts wartet, bevor der Startvorgang abgebrochen wird. Auf einem langsamen oder &#252;berlasteten System sollten Sie den Standardwert erh&#246;hen. Der Standardwert ist 60.</p>

</dd>
<dt>Startargumente</dt>
<dd><p>Argumente zum Anpassen des Startvorgangs f&#252;r den JMS-Dienst. Verwenden Sie beliebige Argumente, die &#252;ber den Befehl <tt><i>as-install-parent</i>/mq/bin/imqbrokerd</tt> verf&#252;gbar sind.</p>

</dd>
<dt>Neu verbinden</dt>
<dd><p>Wenn das Kontrollk&#228;stchen "Neu verbinden" aktiviert ist, versucht der JMS-Dienst, die Verbindung mit einem Nachrichtenserver (oder der Liste von Adressen im Attribut "AddressList") wiederherzustellen, wenn eine Verbindung unterbrochen wird. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Intervall f&#252;r erneute Verbindung</dt>
<dd><p>Die Anzahl Sekunden zwischen zwei Versuchen zur Verbindungswiederherstellung. Dieses Intervall gilt f&#252;r Versuche mit den einzelnen Adressen im Attribut "AddressList" sowie f&#252;r nachfolgende Adressen in der Liste. Falls dieses Intervall zu kurz ist, verf&#252;gt ein Broker nicht &#252;ber gen&#252;gend Zeit zur Wiederherstellung. Wenn das Intervall zu lang ist, erf&#228;hrt die Verbindungsherstellung m&#246;glicherweise eine nicht akzeptable Verz&#246;gerung. Der Standardwert betr&#228;gt 5 Sekunden.</p>

</dd>
<dt>Versuche f&#252;r erneute Verbindung</dt>
<dd><p>Die Anzahl an Versuchen f&#252;r die (erneute) Verbindungsherstellung f&#252;r jede Adresse im Attribut "AddressList", bevor die Clientlaufzeit mit der n&#228;chsten Adresse der Liste fortf&#228;hrt. Der Wert -1 zeigt an, dass die Anzahl von Versuchen zum erneuten Herstellen einer Verbindung unbegrenzt ist (die Clientlaufzeit versucht, eine Verbindung mit der ersten Adresse herzustellen, bis dieser Vorgang erfolgreich ausgef&#252;hrt werden kann). Der Standardwert ist 3.</p>

</dd>
<dt>Standardm&#228;&#223;iger JMS-Host</dt>
<dd><p>Der Name des standardm&#228;&#223;igen JMS-Hosts. Der Standardwert lautet <tt>default_JMS_host</tt>.</p>

</dd>
<dt>Adresslistenverhalten</dt>
<dd><p>Die Reihenfolge der Verbindungsversuche. Zur Auswahl stehen:</p>

<dl><dt><tt>random</tt></dt>
<dd><p>Es wird nach dem Zufallsprinzip eine Adresse aus "AddressList" ausgew&#228;hlt. Wenn eine Vielzahl von Clients versuchen, eine Verbindung &#252;ber dieselbe Verbindungsfactory herzustellen, geben Sie <tt>random</tt> an, um zu verhindern, dass diese Verbindungen alle &#252;ber dieselbe Adresse erfolgen. Dies ist die Standardeinstellung.</p>

</dd>
<dt><tt>priority</tt></dt>
<dd><p>Der Versuch zur Verbindungswiederherstellung wird immer f&#252;r die erste Serveradresse in "AddressList" durchgef&#252;hrt; eine andere Adresse wird nur dann verwendet, wenn der erste Broker nicht verf&#252;gbar ist.</p>

</dd>
</dl>
</dd>
<dt>Adresslisteniterationen</dt>
<dd><p>Die Anzahl von AddressList-Durchl&#228;ufen, die der JMS-Dienst durchf&#252;hrt, um (erneut) eine Verbindung herzustellen. Der Wert -1 gibt an, dass die Anzahl der Versuche unbegrenzt ist. Der Standardwert ist 3.</p>

</dd>
<dt>MQ-Schema und MQ-Dienst</dt>
<dd><p>Der Name des Message Queue-Adressenschemas und des Message Queue-Verbindungsdiensts, wenn nicht das Standardschema bzw. der Standarddienst verwendet werden soll. Informationen zur Syntax finden Sie unter <a href="ref-mqschemeservice.html">Syntax von MQ-Schema und MQ-Dienstadresse</a>.</p>

</dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>Weitere Eigenschaften f&#252;r den JMS-Dienst.</p>

<p>Information zu verf&#252;gbaren Eigenschaften finden Sie unter <a href="ref-jmsservice-additional-props.html">Spezifische Eigenschaften des JMS-Diensts</a>.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-jmsservice.html">So konfigurieren Sie den JMS-Dienst</a></p>

</li>
<li><p><a href="task-jmshostnew.html">So erstellen Sie einen JMS-Host</a></p>

</li>
<li><p><a href="task-jmshostedit.html">So bearbeiten Sie einen JMS-Host</a></p>

</li>
<li><p><a href="task-jmshostdelete.html">So l&#246;schen Sie einen JMS-Host</a></p>

</li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=jms-ping-1"><tt>jms-ping</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
