<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-transactionservice"></a><h4>Servi&#231;o de transa&#231;&#227;o</h4>
<a name="indexterm-8"></a><p>Utilize a p&#225;gina Servi&#231;o de transa&#231;&#227;o para configurar recupera&#231;&#227;o, tempo limite e
log de transa&#231;&#227;o.</p>

<p>A p&#225;gina Servi&#231;o de transa&#231;&#227;o cont&#233;m estas op&#231;&#245;es:</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar com os valores padr&#227;o as configura&#231;&#245;es que apresentam valores padr&#227;o. As configura&#231;&#245;es que n&#227;o apresentam valores padr&#227;o n&#227;o s&#227;o alteradas.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>O nome da configura&#231;&#227;o para a qual as defini&#231;&#245;es nesta p&#225;gina se aplicam. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Ao reinicializar</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Ativo estiver marcada, o Servidor GlassFish tentar&#225; recuperar as transa&#231;&#245;es incompletas quando o servidor for reiniciado. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Tempo limite de transa&#231;&#227;o</dt>
<dd><p>N&#250;mero de segundos que o servidor aguarda antes de reverter uma transa&#231;&#227;o n&#227;o conclu&#237;da. O valor padr&#227;o &#233; 0, significando que o servidor aguarda indefinidamente que uma transa&#231;&#227;o seja conclu&#237;da.</p>

</dd>
<dt>Tempo limite da nova tentativa</dt>
<dd><p>N&#250;mero de segundos em que o Servidor GlassFish tenta se conectar a um servidor inacess&#237;vel. O valor padr&#227;o &#233; 600 (10 minutos).</p>

</dd>
<dt>Local do log de transa&#231;&#227;o</dt>
<dd><p>O diret&#243;rio onde os logs do servidor s&#227;o mantidos. Os logs de transa&#231;&#227;o s&#227;o mantidos no subdiret&#243;rio <tt>tx</tt> do diret&#243;rio especificado neste campo. O valor padr&#227;o &#233; o diret&#243;rio especificado pelo campo Raiz de log da p&#225;gina Atributos de dom&#237;nio, que est&#225; localizada na guia Avan&#231;ado do n&#243; do Servidor GlassFish.</p>

</dd>
<dt>Decis&#227;o heur&#237;stica</dt>
<dd><p>Define se as transa&#231;&#245;es envolvendo servidores inacess&#237;veis devem ser confirmadas ou revertidas. O valor padr&#227;o Reverter. A confirma&#231;&#227;o de transa&#231;&#245;es indeterminadas pode comprometer a integridade dos dados do aplicativo.</p>

</dd>
<dt>Intervalo de pontos principais</dt>
<dd><p>O n&#250;mero de transa&#231;&#245;es entre as opera&#231;&#245;es de ponto-chave, que compacta o arquivo de log de transa&#231;&#227;o. O valor padr&#227;o &#233; 65536.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>As propriedades adicionais do servi&#231;o de transa&#231;&#227;o.</p>

<p>Para obter uma descri&#231;&#227;o das propriedades dispon&#237;veis, consulte <a href="ref-transactionsvcproperties.html">Propriedades espec&#237;ficas do servi&#231;o de transa&#231;&#227;o</a>.</p>

</dd>
</dl>
<a name="ginkt"></a><h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-configtransservice.html">Para configurar o servi&#231;o de transa&#231;&#227;o</a></p>

</li>
<li><p><a href="task-configtransrecovery.html">Para configurar como o Servidor GlassFish deve recuperar transa&#231;&#245;es</a></p>

</li>
<li><p><a href="task-settranstimeout.html">Para definir um valor de tempo limite de transa&#231;&#227;o</a></p>

</li>
<li><p><a href="task-settranslog.html">Para definir o local dos logs da transa&#231;&#227;o</a></p>

</li>
<li><p><a href="task-setkeyptinterval.html">Para definir o intervalo do ponto-chave</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
