<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-configtransrecovery"></a><h3>Para configurar como o Servidor GlassFish deve recuperar transa&#231;&#245;es</h3><a name="indexterm-2"></a><p>As transa&#231;&#245;es podem ficar incompletas porque o servidor travou ou porque um
gerenciador de recurso travou. &#201; essencial concluir essas transa&#231;&#245;es retidas e se
recuperar das falhas. O Servidor GlassFish &#233; projetado para se recuperar dessas
falhas e concluir as transa&#231;&#245;es na inicializa&#231;&#227;o do servidor.</p>

<p>Durante a realiza&#231;&#227;o da recupera&#231;&#227;o, se alguns dos recursos forem inacess&#237;veis, a
reinicializa&#231;&#227;o do servidor pode ser retardada enquanto ele tenta recuperar as transa&#231;&#245;es.</p>

<p>Quando a transa&#231;&#227;o se espalha pelos servidores, o servidor que iniciou a
transa&#231;&#227;o pode contatar os demais servidores para obter o resultado das transa&#231;&#245;es.
Se os demais servidores forem inacess&#237;veis, a transa&#231;&#227;o utiliza o campo Decis&#227;o
heur&#237;stica para determinar o resultado.</p>

<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Selecione a inst&#226;ncia que ser&#225; configurada:</b><ul>
<li><b>Para configurar uma determinada inst&#226;ncia, selecione o n&#243; de configura&#231;&#227;o da inst&#226;ncia.
Por exemplo, na inst&#226;ncia padr&#227;o, <tt>server</tt>, selecione o n&#243; <tt>server-config</tt>.</b></li>
<li><b>Para definir as configura&#231;&#245;es padr&#227;o de todas as inst&#226;ncias, selecione o n&#243;
<tt>default-config</tt>.</b></li></ul></li>
<li><b>Selecione o n&#243; Servi&#231;o de transa&#231;&#227;o.</b><p>A p&#225;gina Servi&#231;o de transa&#231;&#227;o &#233; aberta.</p></li>
<li><b>Para ativar a recupera&#231;&#227;o de transa&#231;&#245;es incompletas, na p&#225;gina Servi&#231;o de transa&#231;&#227;o,
marque a caixa de sele&#231;&#227;o Habilitado ao reiniciar.</b><p>Por padr&#227;o, a caixa de sele&#231;&#227;o Habilitado n&#227;o &#233; selecionada.</p></li>
<li><b>No campo Tempo limite de tentativa, digite o n&#250;mero de segundos que
o Servidor GlassFish tenta se conectar a um servidor inacess&#237;vel.</b><p>O valor padr&#227;o &#233; 600 (10 minutos).</p></li>
<li><b>Na lista suspensa Decis&#227;o heur&#237;stica, selecione a diretiva para servidores inacess&#237;veis em
uma transa&#231;&#227;o.</b><p>A menos que haja um bom motivo para selecionar Confirmar, deixe a
Decis&#227;o heur&#237;stica definida como Revers&#227;o (o padr&#227;o). A confirma&#231;&#227;o de transa&#231;&#245;es indeterminadas
pode comprometer a integridade dos dados do aplicativo.</p></li>
<li><b>Clique em Salvar.</b></li>
<li><b>Reinicie o Servidor GlassFish.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-configtransservice.html">Para configurar o servi&#231;o de transa&#231;&#227;o</a></p>

</li>
<li><p><a href="task-settranstimeout.html">Para definir um valor de tempo limite de transa&#231;&#227;o</a></p>

</li>
<li><p><a href="task-settranslog.html">Para definir o local dos logs da transa&#231;&#227;o</a></p>

</li>
<li><p><a href="task-setkeyptinterval.html">Para definir o intervalo do ponto-chave</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
