<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionnew" name="ref-jmsconnectionnew"></a><a id="GHJMS00003" name="GHJMS00003"></a></p>

<h4><a id="sthref49" name="sthref49"></a><a id="sthref50" name="sthref50"></a>Nuova Connection Factory JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina Nuova Connection Factory JMS &egrave; possibile creare una nuova Connection Factory JMS.</p>
<p>La pagina Nuova Connection Factory JMS include le opzioni riportate di seguito.</p>
<dl>
<dt>Nome pool</dt>
<dd>
<p>Nome univoco che identifica la Connection Factory. GlassFish Server imposta il nome JNDI della Connection Factory su questo valore.</p>
</dd>
<dt>Tipo di risorsa</dt>
<dd>
<p>Tipo di Connection Factory. Le opzioni disponibili sono <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> e <code>javax.jms.TopicConnectionFactory</code>.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>Descrizione della Connection Factory.</p>
</dd>
<dt>Stato</dt>
<dd>
<p>Stato della Connection Factory. La Connection Factory pu&ograve; essere abilitata o disabilitata. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Dimensione pool iniziale e minima</dt>
<dd>
<p>Numero minimo di connessioni nel pool per la Connection Factory. Il valore predefinito &egrave; 8.</p>
</dd>
<dt>Dimensione massima pool</dt>
<dd>
<p>Numero massimo di connessioni nel pool per la Connection Factory. Il valore predefinito &egrave; 32.</p>
</dd>
<dt>Quantit&agrave; di ridimensionamento pool</dt>
<dd>
<p>Numero di connessioni da rimuovere allo scadere del timeout di inattivit&agrave; del pool. Il valore predefinito &egrave; 2.</p>
</dd>
<dt>Timeout inattivit&agrave;</dt>
<dd>
<p>Tempo massimo, in secondi, durante il quale una connessione pu&ograve; rimanere inattiva nel pool. Il valore predefinito &egrave; 300.</p>
</dd>
<dt>Tempo massimo di attesa</dt>
<dd>
<p>Quantit&agrave; di tempo che l'applicazione che richiede la connessione attende prima che si verifichi il timeout della connessione. Il valore predefinito &egrave; 60000.</p>
</dd>
<dt>In caso di qualsiasi errore</dt>
<dd>
<p>Se la casella di controllo Chiudi tutte le connessioni &egrave; selezionata, GlassFish Server chiude tutte le connessioni nel pool e le ristabilisce se una singola connessione non riesce. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Supporto transazioni</dt>
<dd>
<p>Il supporto delle transazioni scelto sostituisce l'attributo relativo al supporto delle transazioni nel Resource Adapter associato a questo connection pool in modo compatibile verso il basso. In altre parole, pu&ograve; supportare un livello di transazione inferiore o uguale a quello specificato nel Resource Adapter, ma non un livello superiore.</p>
<p>Il valore pu&ograve; essere uno dei seguenti:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&Egrave; possibile utilizzare la risorsa per le transazioni che implicano l'uso di pi&ugrave; risorse nell'ambito della transazione. Questo &egrave; il valore predefinito per una Connection Factory JMS.</p>
<p>Ad esempio, &egrave; possibile che le transazioni implichino l'uso di questa risorsa insieme a una risorsa JDBC, una risorsa connettore o un'altra risorsa Connection Factory JMS. Questo valore offre la massima flessibilit&agrave;. Una risorsa configurata come XATransaction verr&agrave; utilizzata in operazioni di commit a due fasi.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&Egrave; possibile utilizzare la risorsa per le transazioni che implicano l'uso di una sola risorsa nell'ambito della transazione o come ultimo agente in una transazione distribuita che prevede l'uso di pi&ugrave; risorse XA.</p>
<p>Questo valore consente prestazioni decisamente migliori. Una risorsa configurata come LocalTransaction non verr&agrave; utilizzata in operazioni di commit a due fasi.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>La risorsa non pu&ograve; mai essere utilizzata nelle transazioni. Questa impostazione &egrave; di uso limitato nelle applicazioni JMS.</p>
</dd>
</dl>
</dd>
<dt>Convalida connessione</dt>
<dd>
<p>Se la casella di controllo Obbligatorio &egrave; selezionata, le connessioni vengono convalidate prima di essere fornite all'applicazione. Se la convalida di una risorsa non riesce, la risorsa viene eliminata e viene creata e restituita una nuova risorsa. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Propriet&agrave; aggiuntive per la Connection Factory.</p>
<p>Per informazioni sulle propriet&agrave; disponibili, vedere <a href="ref-jmsconnectionproperties.html">Propriet&agrave; specifiche delle Connection Factory JMS</a>.</p>
</dd>
<dt>Destinazioni</dt>
<dd>
<p>Cluster e istanze standalone per la Connection Factory. Per spostare le destinazioni desiderate nella colonna Destinazioni selezionate, utilizzare i pulsanti Aggiungi e Aggiungi tutto. Per spostare le destinazioni non necessarie nella colonna Destinazioni disponibili, utilizzare i pulsanti Rimuovi e Rimuovi tutto.</p>
<p>Questa opzione viene visualizzata solo se nel dominio sono stati creati cluster o istanze standalone.</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Creare una risorsa Connection Factory JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Modificare una risorsa Connection Factory JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Eliminare una risorsa Connection Factory JMS</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
