<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a><a id="GHJMS00030" name="GHJMS00030"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>Creare una destinazione fisica JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Di norma non &egrave; necessario creare destinazioni fisiche in quanto al momento della creazione di una risorsa di destinazione JMS &egrave; necessario specificare il nome di una destinazione fisica. Se necessaria, la destinazione fisica viene creata automaticamente.</p>
<ol>
<li>
<p>Nell'albero di navigazione espandere il nodo Configurazione.</p>
</li>
<li>
<p>Select the instance to configure:</p>
<ul>
<li>
<p>To configure a particular instance, select the instance's config node. For example, for the default instance, <code>server</code>, select the <code>server-config</code> node.</p>
</li>
<li>
<p>To configure the default settings for future instances that use a copy of <code>default-config</code>, select the <code>default-config</code> node.</p>
</li>
</ul>
</li>
<li>
<p>Nel nodo Configurazione, espandere il nodo Java Message Service.</p>
</li>
<li>
<p>Nel nodo Java Message Service, selezionare il nodo Destinazioni fisiche.</p>
<p>Viene visualizzata la pagina Destinazioni fisiche.</p>
</li>
<li>
<p>Nella pagina Destinazioni fisiche, fare clic su Nuovo.</p>
<p>Viene visualizzata la pagina Nuova destinazione fisica.</p>
</li>
<li>
<p>Nel campo Nome digitare il nome della destinazione fisica.</p>
</li>
<li>
<p>Nell'elenco a discesa Tipo, selezionare <code>javax.jms.Topic</code> o <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>Nel campo Numero massimo di messaggi non utilizzati, digitare il numero massimo di messaggi non utilizzati consentiti per la destinazione.</p>
<p>Un valore pari a -1 indica un numero illimitato di messaggi non utilizzati. Il valore predefinito &egrave; -1.</p>
</li>
<li>
<p>Nel campo Dimensione massima messaggio, digitare la dimensione massima, in byte, di ogni singolo messaggio.</p>
<p>Un valore pari a -1 indica una dimensione illimitata del messaggio. Il valore predefinito &egrave; -1.</p>
</li>
<li>
<p>Nel campo Memoria totale massima, digitare la memoria totale massima, in byte, per i messaggi non utilizzati.</p>
<p>Un valore pari a -1 indica una dimensione illimitata di memoria per messaggi non utilizzati. Il valore predefinito &egrave; -1.</p>
</li>
<li>
<p>Nell'elenco a discesa Funzionamento limite soglia, selezionare il comportamento desiderato per il broker quando viene raggiunta la soglia del limite di memoria.</p>
<ul>
<li>
<p><code>Rifiuta i messaggi pi&ugrave; recenti</code> indica che il broker rifiuter&agrave; i messaggi pi&ugrave; recenti e notifica un'eccezione al client di produzione solo se il messaggio &egrave; persistente.</p>
<p><code>Rifiuta i messaggi pi&ugrave; recenti</code> &egrave; il valore predefinito.</p>
</li>
<li>
<p><code>Rallenta producer</code> indica che il broker ridurr&agrave; la velocit&agrave; con cui i produttori inviano i messaggi.</p>
</li>
<li>
<p><code>Elimina i meno recenti</code> indica che il broker deve ignorare i messaggi pi&ugrave; vecchi.</p>
</li>
<li>
<p><code>Elimina i messaggi con la priorit&agrave; pi&ugrave; bassa</code> indica che il broker deve ignorare i messaggi con la priorit&agrave; pi&ugrave; bassa.</p>
</li>
</ul>
<p>Se il valore &egrave; <code>Elimina i meno recenti</code> o <code>Elimina i messaggi con la priorit&agrave; pi&ugrave; bassa</code> e Usa coda dei messaggi bloccati &egrave; impostato su True, i messaggi in eccesso vengono spostati nella coda dei messaggi bloccati.</p>
</li>
<li>
<p>Nel campo Numero massimo di producer, digitare il numero massimo di produttori di messaggi che possono essere associati alla destinazione fisica.</p>
<p>Una volta raggiunto il limite, non &egrave; possibile creare nuovi produttori. Un valore pari a -1 indica un numero illimitato di produttori. Il valore predefinito &egrave; 100.</p>
</li>
<li>
<p>Nel campo Numero massimo messaggi per consegna batch, digitare il numero massimo di messaggi che &egrave; possibile inviare ai consumatori in un solo batch.</p>
<p>Un valore pari a -1 indica un numero illimitato di messaggi. Il valore predefinito &egrave; 1000.</p>
</li>
<li>
<p>Nell'elenco a discesa Usa coda dei messaggi bloccati, selezionare True per posizionare i messaggi bloccati nella coda di messaggi bloccati.</p>
<p>Se il valore &egrave; impostato su False, i messaggi bloccati vengono ignorati. L'impostazione predefinita per questa opzione &egrave; True.</p>
</li>
<li>
<p>Nell'elenco a discesa Convalida schema XML abilitata, selezionare True per abilitare la convalida dello schema XML per la destinazione.</p>
<p>Se il valore &egrave; impostato su True, prima dell'invio di un messaggio XML al broker, la fase di esecuzione del client Message Queue tenter&agrave; di convalidarlo in base alle XSD (XML Schema Definition) specificate o, se non &egrave; specificata nessuna XSD, in base al DTD. Se non &egrave; possibile individuare lo schema specificato o convalidare il messaggio, quest'ultimo non viene inviato e viene generata un'eccezione. L'impostazione predefinita per questa opzione &egrave; False.</p>
</li>
<li>
<p>Nel campo Lista URI schema XML, digitare una lista separata da spazi di stringhe URI per XSD (XML Schema Definition).</p>
<p>Se &egrave; abilitata la convalida dello schema XML, gli URI fanno riferimento alla posizione di una o pi&ugrave; XSD da utilizzare per tale convalida.</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Configurare il servizio JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Creare un host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Modificare un host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Eliminare un host JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Modificare una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Eliminare una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Rimuovere i messaggi da una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Visualizzare le statistiche per una destinazione fisica JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
