<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionservice" name="ref-transactionservice"></a><a id="GHJTS00002" name="GHJTS00002"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Service de transaction</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Service de transaction permet de configurer la r&eacute;cup&eacute;ration, les temporisations et la journalisation des transactions.</p>
<p>Elle contient les options suivantes.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton de restauration des valeurs par d&eacute;faut des param&egrave;tres qui ont des valeurs par d&eacute;faut. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Au red&eacute;marrage</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, GlassFish&nbsp;Server tente de r&eacute;cup&eacute;rer les transactions incompl&egrave;tes au red&eacute;marrage du serveur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Temporisation de transaction</dt>
<dd>
<p>D&eacute;lai d'attente, en secondes, du serveur au-del&agrave; duquel ce dernier annule une transaction qui n'est pas termin&eacute;e. La valeur par d&eacute;faut est&nbsp;0. Elle signifie que le serveur attend la fin d'une transaction pendant une dur&eacute;e ind&eacute;termin&eacute;e.</p>
</dd>
<dt>Temporisation de tentative</dt>
<dd>
<p>Dur&eacute;e, en secondes, pendant laquelle GlassFish&nbsp;Server tente de se connecter &agrave; un serveur inaccessible. La valeur par d&eacute;faut est&nbsp;600 (10&nbsp;minutes).</p>
</dd>
<dt>Emplacement des journaux des transactions</dt>
<dd>
<p>R&eacute;pertoire dans lequel sont conserv&eacute;s les journaux du serveur. Les journaux de transaction sont conserv&eacute;s dans le sous-r&eacute;pertoire <code>tx</code> du r&eacute;pertoire sp&eacute;cifi&eacute; dans ce champ. La valeur par d&eacute;faut correspond au r&eacute;pertoire sp&eacute;cifi&eacute; dans le champ Racine journal de la page Attributs de domaine, qui se trouve dans l'onglet Avanc&eacute; du noeud GlassFish&nbsp;Server.</p>
</dd>
<dt>D&eacute;cision heuristique</dt>
<dd>
<p>Indique si les transactions qui impliquent des serveurs inaccessibles doivent &ecirc;tre valid&eacute;es ou annul&eacute;es. La valeur par d&eacute;faut est Annuler. Valider les transactions ind&eacute;termin&eacute;es risque de compromettre l'int&eacute;grit&eacute; des donn&eacute;es dans votre application.</p>
</dd>
<dt>Intervalle entre points cl&eacute;s</dt>
<dd>
<p>Nombre de transactions effectu&eacute;es entre des op&eacute;rations de point cl&eacute; qui compriment le fichier journal de transactions. La valeur par d&eacute;faut est&nbsp;65&nbsp;536.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires du service de transaction.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-transactionsvcproperties.html">Propri&eacute;t&eacute;s propres au service de transaction</a>.</p>
</dd>
</dl>
<a id="sthref15" name="sthref15"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Configurer le service de transaction</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Configuration de la r&eacute;cup&eacute;ration des transactions par GlassFish&nbsp;Server</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">D&eacute;finir une valeur de temporisation des transactions</a></p>
</li>
<li>
<p><a href="task-settranslog.html">D&eacute;finir l'emplacement des journaux des transactions</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">D&eacute;finir l'intervalle entre les points cl&eacute;s</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
