<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-transactionservice"></a><h4>Service de transaction</h4>
<a name="indexterm-8"></a><p>La page Service de transaction vous permet de configurer la r&#233;cup&#233;ration de
transaction, les d&#233;lais d&#8217;attente et la journalisation.</p>

<p>La page Service de transaction contient les options suivantes&#160;:</p>

<dl><dt>Charger les valeurs par d&#233;faut</dt>
<dd><p>Bouton permettant de restaurer les valeurs par d&#233;faut de tous les param&#232;tres.</p>

</dd>
<dt>Nom de configuration</dt>
<dd><p>Le nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Au red&#233;marrage</dt>
<dd><p>Si la case Activ&#233; est coch&#233;e, le GlassFish Server essaie de r&#233;cup&#233;rer les transactions incompl&#232;tes au red&#233;marrage du serveur. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>D&#233;lai d&#8217;attente de transaction</dt>
<dd><p>Dur&#233;e d&#8217;attente, en secondes, du serveur avant d&#8217;annuler une transaction qui ne s&#8217;est pas termin&#233;e. La valeur par d&#233;faut est z&#233;ro qui signifie que le serveur attend la fin d&#8217;une transaction pendant une dur&#233;e ind&#233;termin&#233;e.</p>

</dd>
<dt>D&#233;lai d&#8217;attente d&#8217;essai</dt>
<dd><p>Dur&#233;e, en secondes, pendant laquelle le GlassFish Server essaie de se connecter &#224; un serveur inaccessible. La valeur par d&#233;faut est de 600 (10 minutes).</p>

</dd>
<dt>Emplacement du journal des transactions</dt>
<dd><p>R&#233;pertoire o&#249; sont conserv&#233;s les journaux du serveur. Les journaux de transaction sont conserv&#233;s dans le sous-r&#233;pertoire <tt>tx</tt> du r&#233;pertoire sp&#233;cifi&#233; par ce champ. La valeur par d&#233;faut est le r&#233;pertoire sp&#233;cifi&#233; dans le champ Racine journal de la page Attributs de domaine, qui se trouve dans l&#8217;onglet Avanc&#233; du n&#339;ud GlassFish Server.</p>

</dd>
<dt>D&#233;cision heuristique</dt>
<dd><p>Indique si les transactions qui impliquent des serveurs inaccessibles doivent &#234;tre valid&#233;es ou annul&#233;es. La valeur par d&#233;faut est Annulation. Valider les transactions ind&#233;termin&#233;es risque de compromettre l&#8217;int&#233;grit&#233; des donn&#233;es dans votre application.</p>

</dd>
<dt>Intervalle de point cl&#233;</dt>
<dd><p>Nombre de transactions effectu&#233;es entre des op&#233;rations de point cl&#233; qui compriment le fichier journal de transactions. La valeur par d&#233;faut est 65&#160;536.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s du service de transaction.</p>

<p>Pour obtenir une description des propri&#233;t&#233;s disponibles, consultez <a href="ref-transactionsvcproperties.html">Propri&#233;t&#233;s sp&#233;cifiques au service de transaction</a>.</p>

</dd>
</dl>
<a name="ginkt"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-configtransservice.html">Configuration du service de transaction</a></p>

</li>
<li><p><a href="task-configtransrecovery.html">Configuration de la r&#233;cup&#233;ration des transactions par le GlassFish Server</a></p>

</li>
<li><p><a href="task-settranstimeout.html">D&#233;finition du d&#233;lai d'attente d'une transaction</a></p>

</li>
<li><p><a href="task-settranslog.html">D&#233;finition de l'emplacement des journaux des transactions</a></p>

</li>
<li><p><a href="task-setkeyptinterval.html">D&#233;finition de l'intervalle entre points cl&#233;s</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
