<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-settranslog"></a><h4>D&#233;finition de l&#8217;emplacement des journaux des transactions</h4><a name="indexterm-4"></a><a name="indexterm-5"></a><p>Les journaux de transaction consignent les informations sur chaque transaction afin de
garantir l&#8217;int&#233;grit&#233; des donn&#233;es des ressources impliqu&#233;es et de r&#233;cup&#233;rer les donn&#233;es
en cas de panne. Les journaux de transaction sont conserv&#233;s dans le
sous-r&#233;pertoire <tt>tx</tt> du r&#233;pertoire sp&#233;cifi&#233; dans le champ Emplacement du journal des
transactions. Ces journaux ne sont pas lisibles par l&#8217;homme.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez l&#8217;instance &#224; configurer :</b><ul>
<li><b>Pour configurer une instance en particulier, s&#233;lectionnez le n&#339;ud de configuration de
l&#8217;instance. Par exemple, pour l&#8217;instance par d&#233;faut, <tt>server</tt>, s&#233;lectionnez le n&#339;ud <tt>server-config</tt>.</b></li>
<li><b>Pour configurer les r&#233;glages par d&#233;faut pour toutes les instances, s&#233;lectionnez le
n&#339;ud <tt>default-config</tt>.</b></li></ul></li>
<li><b>S&#233;lectionnez le n&#339;ud Service de transaction.</b><p>La page Service de transaction s&#8217;affiche.</p></li>
<li><b>Dans le champ Emplacement du journal des transactions, saisissez l&#8217;emplacement des journaux
des transactions.</b><p>Un sous-r&#233;pertoire <tt>tx</tt> est cr&#233;&#233; pour y conserver les journaux des transactions.</p></li>
<li><b>Cliquez sur Enregistrer. </b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-configtransservice.html">Configuration du service de transaction</a></p>

</li>
<li><p><a href="task-configtransrecovery.html">Configuration de la r&#233;cup&#233;ration des transactions par le GlassFish Server</a></p>

</li>
<li><p><a href="task-settranstimeout.html">D&#233;finition du d&#233;lai d'attente d'une transaction</a></p>

</li>
<li><p><a href="task-setkeyptinterval.html">D&#233;finition de l'intervalle entre points cl&#233;s</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
