<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-settranstimeout"></a><h3>D&#233;finition du d&#233;lai d&#8217;attente d&#8217;une transaction</h3><a name="indexterm-3"></a><p>Par d&#233;faut, le serveur n&#8217;applique aucun d&#233;lai d&#8217;expiration aux transactions. Le serveur
attend ind&#233;finiment la r&#233;alisation de la transaction. Si vous avez d&#233;fini un
d&#233;lai d&#8217;expiration pour les transactions et qu&#8217;une transaction n&#8217;est pas termin&#233;e dans
le d&#233;lai configur&#233;, celle-ci est annul&#233;e par GlassFish Server.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez l&#8217;instance &#224; configurer :</b><ul>
<li><b>Pour configurer une instance en particulier, s&#233;lectionnez le n&#339;ud de configuration de
l&#8217;instance. Par exemple, pour l&#8217;instance par d&#233;faut, <tt>server</tt>, s&#233;lectionnez le n&#339;ud <tt>server-config</tt>.</b></li>
<li><b>Pour configurer les r&#233;glages par d&#233;faut pour toutes les instances, s&#233;lectionnez le
n&#339;ud <tt>default-config</tt>.</b></li></ul></li>
<li><b>S&#233;lectionnez le n&#339;ud Service de transaction.</b><p>La page Service de transaction s&#8217;affiche.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;attente de transaction, saisissez le nombre de secondes
devant s&#8217;&#233;couler avant expiration de la transaction.</b><p>La valeur par d&#233;faut est 0. ce qui d&#233;sactive le d&#233;lai d&#8217;attente
des transactions.</p></li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Red&#233;marrez GlassFish Server.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-configtransservice.html">Configuration du service de transaction</a></p>

</li>
<li><p><a href="task-configtransrecovery.html">Configuration de la r&#233;cup&#233;ration des transactions par le GlassFish Server</a></p>

</li>
<li><p><a href="task-settranslog.html">D&#233;finition de l'emplacement des journaux des transactions</a></p>

</li>
<li><p><a href="task-setkeyptinterval.html">D&#233;finition de l'intervalle entre points cl&#233;s</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
