<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-webcontaineravailability" name="ref-webcontaineravailability"></a><a id="GHWEB00001" name="GHWEB00001"></a></p>

<h4><a id="sthref79" name="sthref79"></a><a id="sthref80" name="sthref80"></a>Disponibilit&agrave; contenitore Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina Disponibilit&agrave; contenitore Web &egrave; possibile configurare le impostazioni di disponibilit&agrave; per il contenitore Web.</p>
<p>La pagina Disponibilit&agrave; contenitore Web contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante che consente di ripristinare i valori predefiniti delle impostazioni che dispongono di tali valori. Le impostazioni prive di valori predefiniti restano invariate.</p>
</dd>
<dt>Nome configurazione</dt>
<dd>
<p>Nome della configurazione a cui vengono applicate le impostazioni definite in questa pagina. Questo campo &egrave; di sola lettura.</p>
</dd>
<dt>Servizio disponibilit&agrave;</dt>
<dd>
<p>Se la casella di controllo Abilitato &egrave; selezionata, la disponibilit&agrave; &egrave; abilitata per il contenitore Web.</p>
</dd>
<dt>Tipo di persistenza</dt>
<dd>
<p>Meccanismo di persistenza usato.</p>
<ul>
<li>
<p>Se l'opzione Servizio disponibilit&agrave; abilitato <i>non</i> &egrave; selezionata, scegliere una delle opzioni riportate di seguito.</p>
<ul>
<li>
<p><code>memory</code> per nessuna persistenza della sessione.</p>
</li>
<li>
<p><code>file</code> per la persistenza della sessione basata sul file system, che non &egrave; ad alta disponibilit&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Se l'opzione Servizio disponibilit&agrave; abilitato &egrave; selezionata, selezionare <code>replicated</code> per la persistenza della sessione basata su failover del cluster, che &egrave; ad alta disponibilit&agrave;.</p>
</li>
</ul>
</dd>
<dt>Frequenza di persistenza</dt>
<dd>
<p>Frequenza di memorizzazione della sessione HTTP:</p>
<ul>
<li>
<p><code>web-method</code>: lo stato della sessione viene memorizzato al termine di ogni richiesta Web prima dell'invio di una risposta al client. Questa modalit&agrave; rappresenta la migliore garanzia che lo stato della sessione sia aggiornato completamente in caso di errore. Questo &egrave; il valore predefinito.</p>
</li>
</ul>
</dd>
<dt>Ambito persistenza</dt>
<dd>
<p>Ambito delle modifiche della sessione HTTP necessarie per consentire la memorizzazione:</p>
<ul>
<li>
<p><code>session</code>: viene ogni volta memorizzato lo stato dell'intera sessione. Questa modalit&agrave; rappresenta la migliore garanzia che i dati della sessione vengano memorizzati correttamente per ogni applicazione Web distribuibile.</p>
</li>
<li>
<p><code>modified-session</code>: viene memorizzato lo stato dell'intera sessione se &egrave; stato modificato. Una sessione viene considerata modificata se &egrave; stato chiamato un metodo <code>HttpSession.setAttribute()</code> o <code>HttpSession.removeAttribute()</code>. &Egrave; necessario quindi garantire che venga chiamato <code>setAttribute()</code> ogni volta che un attributo viene modificato. Non si tratta di un requisito delle specifiche Java EE, ma &egrave; necessario per il corretto funzionamento di questa modalit&agrave;.</p>
</li>
<li>
<p><code>modified-attribute</code>: vengono memorizzati solo gli attributi di sessione modificati. Affinch&eacute; questa modalit&agrave; funzioni correttamente, &egrave; necessario attenersi alle istruzioni riportate di seguito.</p>
<ul>
<li>
<p>Chiamare <code>setAttribute()</code> ogni volta che lo stato della sessione viene modificato.</p>
</li>
<li>
<p>Accertarsi che non ci siano riferimenti incrociati tra gli attributi. Il grafico degli oggetti sotto ciascuna chiave di attributo viene serializzato e memorizzato separatamente. Se esistono riferimenti incrociati tra gli oggetti sotto ciascuna chiave separata, essi non verranno serializzati e deserializzati correttamente.</p>
</li>
<li>
<p>Distribuire lo stato della sessione tra pi&ugrave; attributi o almeno tra un attributo di sola lettura e un attributo modificabile.</p>
</li>
</ul>
</li>
</ul>
</dd>
<dt>Stato Single Sign-On</dt>
<dd>
<p>Se la casella di controllo Abilitato &egrave; selezionata, lo stato Single Sign-On &egrave; disponibile per il failover.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Propriet&agrave; aggiuntive per la disponibilit&agrave; del contenitore Web.</p>
<p>In GlassFish Server non &egrave; definita alcuna propriet&agrave; aggiuntiva per la disponibilit&agrave; del contenitore Web.</p>
</dd>
</dl>
<a id="sthref81" name="sthref81"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configurare le propriet&agrave; generali per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configurare le propriet&agrave; di sessione per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configurare le propriet&agrave; manager per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configurare le propriet&agrave; dell'area di memorizzazione per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configurare le impostazioni di disponibilit&agrave; per il contenitore Web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
