<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolhttpedit" name="ref-protocolhttpedit"></a><a id="GHWEB00022" name="GHWEB00022"></a></p>

<h4><a id="sthref152" name="sthref152"></a><a id="sthref153" name="sthref153"></a>HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina HTTP &egrave; possibile modificare le impostazioni HTTP di un protocollo di rete.</p>
<p>La pagina HTTP contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante che consente di ripristinare i valori predefiniti delle impostazioni che dispongono di tali valori. Le impostazioni prive di valori predefiniti restano invariate.</p>
</dd>
<dt>Nome configurazione</dt>
<dd>
<p>Nome della configurazione a cui vengono applicate le impostazioni definite in questa pagina. Questo campo &egrave; di sola lettura.</p>
</dd>
<dt>Nome protocollo</dt>
<dd>
<p>Nome del protocollo. Il campo Nome protocollo &egrave; di sola lettura. &Egrave; possibile specificare il nome solo quando si crea un nuovo protocollo.</p>
</dd>
<dt>Nome server</dt>
<dd>
<p>Nome host da utilizzare negli URL che il server invia al client. Se il server utilizza un alias, questo nome corrisponde al nome alias. Se il server non utilizza un alias, lasciare vuoto questo campo.</p>
</dd>
<dt>Server virtuale predefinito</dt>
<dd>
<p>Server virtuale da associare al protocollo. Nella pagina Server virtuali &egrave; possibile definire server virtuali.</p>
</dd>
<dt>Porta di reindirizzamento</dt>
<dd>
<p>Valore della porta che reindirizza una richiesta a un'altra porta. GlassFish Server reindirizza automaticamente la richiesta se si verificano le due condizioni riportate di seguito.</p>
<ul>
<li>
<p>Questo protocollo supporta richieste non SSL.</p>
</li>
<li>
<p>Viene ricevuta una richiesta per la quale un vincolo di sicurezza corrispondente richiede il trasporto SSL.</p>
</li>
</ul>
<p>Se non si specifica una porta di reindirizzamento, GlassFish Server utilizza il numero di porta specificato nella richiesta originale.</p>
</dd>
<dt>Numero massimo di connessioni</dt>
<dd>
<p>Numero massimo di connessioni persistenti da mantenere in modalit&agrave; controllo attivit&agrave;. Il sottosistema di controllo attivit&agrave; esegue periodicamente il polling delle connessioni inattive. Il valore predefinito &egrave; 256.</p>
</dd>
<dt>Timeout</dt>
<dd>
<p>Numero massimo di secondi durante i quali una connessione pu&ograve; essere considerata inattiva e mantenuta nello stato di controllo attivit&agrave;. Un valore inferiore o pari a 0 indica che le connessioni di controllo attivit&agrave; sono mantenute aperte a tempo indeterminato. Il valore predefinito &egrave; 30 secondi.</p>
</dd>
<dt>Timeout di caricamento</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, la connessione per un servlet che legge byte lentamente viene chiusa dopo il raggiungimento del timeout di caricamento della connessione. Se questa opzione &egrave; disabilitata, non si verifica il timeout per le connessioni del servlet. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Timeout di caricamento connessione</dt>
<dd>
<p>Timeout relativo ai caricamenti, espresso in millisecondi. Questo campo &egrave; valido solo se la casella di controllo Timeout di caricamento abilitato &egrave; selezionata. Il valore predefinito &egrave; 300000 millisecondi.</p>
</dd>
<dt>Timeout richieste</dt>
<dd>
<p>Numero di secondi prima del timeout di una richiesta. Se la richiesta non viene elaborata prima del raggiungimento del valore di timeout, la richiesta viene ignorata. Il valore predefinito &egrave; 30 secondi.</p>
</dd>
<dt>Dimensione buffer di invio</dt>
<dd>
<p>Dimensione in byte del buffer di invio. Il valore predefinito &egrave; 8192 byte.</p>
</dd>
<dt>Lunghezza buffer intestazione</dt>
<dd>
<p>Dimensione in byte del buffer utilizzato dai thread di elaborazione delle richieste per la lettura dei dati delle richieste. Il valore predefinito &egrave; 8192 byte.</p>
</dd>
<dt>Dimensione massima POST</dt>
<dd>
<p>Dimensione massima in byte delle azioni POST. Il valore predefinito &egrave; 2097152 byte.</p>
</dd>
<dt>Codifica URI</dt>
<dd>
<p>Nome del set di caratteri utilizzato per decodificare gli URI delle richieste ricevuti. Il valore deve essere un nome di set di caratteri IANA valido. Il valore predefinito &egrave; UTF-8.</p>
</dd>
<dt>Versione</dt>
<dd>
<p>Versione del protocollo HTTP in uso. Il valore predefinito &egrave; HTTP/1.1.</p>
</dd>
<dt>Compressione</dt>
<dd>
<p>Specifica l'uso della compressione GZIP HTTP/ 1.1 per risparmiare l'ampiezza di banda del server. Sono disponibili le opzioni riportate di seguito.</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Comprime i dati.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>Disabilita la compressione.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>Forza la compressione dei dati in tutti i casi.</p>
</dd>
</dl>
<p>Il valore predefinito &egrave; <code>off</code>.</p>
</dd>
<dt>Tipi MIME comprimibili</dt>
<dd>
<p>Lista di valori separati da virgole di tipi MIME per i quali si utilizza la compressione HTTP. Il valore predefinito &egrave; <code>text/html,text/xml,text/plain</code>.</p>
</dd>
<dt>Dimensione minima di compressione</dt>
<dd>
<p>Dimensione minima di un file quando vi si applica la compressione. &Egrave; necessario impostare questo valore se la compressione &egrave; impostata su <code>on</code> o su <code>force</code> . Il valore predefinito &egrave; 2048 byte.</p>
</dd>
<dt>User Agent senza compressione</dt>
<dd>
<p>Lista di valori separati da virgole di espressioni regolari corrispondenti agli User Agent dei client HTTP per i quali non &egrave; consigliabile usare la compressione. Per impostazione predefinita, questo valore &egrave; una stringa vuota.</p>
</dd>
<dt>User Agent con limitazioni</dt>
<dd>
<p>Lista di User Agent con limitazioni su cui &egrave; applicata la compressione HTTP. Se non vengono specificati User Agent, la compressione HTTP viene applicata a tutti gli User Agent. Per impostazione predefinita, non vengono specificati User Agent.</p>
</dd>
<dt>Tipo di risposta predefinito</dt>
<dd>
<p>Stringa che specifica il tipo di risposta predefinito. Il formato &egrave; una stringa delimitata da punto e virgola e costituita da content-type, codifica, lingua e set di caratteri. Il valore predefinito &egrave; <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Tipo di risposta forzata</dt>
<dd>
<p>Stringa che specifica il tipo di richiesta utilizzato se non &egrave; disponibile un mapping MIME con la stessa estensione del file. Il formato &egrave; una stringa delimitata da punto e virgola e costituita da content-type, codifica, lingua e set di caratteri. Il valore predefinito &egrave; <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Adattatore</dt>
<dd>
<p>Nome classe del Resource Adapter statico. Il valore predefinito &egrave; <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</dd>
<dt>Supporto Comet</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, il supporto Comet &egrave; abilitato per il protocollo. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Ricerca DNS</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, viene abilitata la ricerca DNS (Domain Name System). Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Supporto RCM</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, viene abilitato il supporto RCM (Resource Configuration Management). Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Trace</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, viene abilitata l'operazione TRACE. Se questa opzione &egrave; disabilitata, GlassFish Server &egrave; meno soggetto ad attacchi di tipo XSS (Cross-Site Scripting). Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Autenticazione pass-through</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, indica che il listener di rete che utilizza questo protocollo riceve il traffico da un server proxy con terminazione SSL. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Creazione chunk</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, viene abilitata la creazione di chunk di risposta HTTP. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>XPowered By</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, GlassFish Server utilizza le intestazioni <code>X-Powered-By</code> in base alle specifiche Java Servlet 3.0 e Java Server Pages 2.0. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Barra codificata</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, gli URL possono contenere barre codificate. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Supporto socket Web</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, il protocollo WebSockets &egrave; supportato. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
</dl>
<a id="sthref154" name="sthref154"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Creare un protocollo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Modificare un protocollo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Modificare le impostazioni SSL per un protocollo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modificare le impostazioni HTTP per un protocollo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Modificare le impostazioni della cache di file per un protocollo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Eliminare un protocollo</a></p>
</li>
</ul>
<a id="sthref155" name="sthref155"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
