<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-standaloneinstancegeneral"></a><h4>Allgemeine Informationen</h4>
<a name="indexterm-205"></a><a name="indexterm-206"></a><a name="indexterm-207"></a><p>Die Seite "Allgemeine Informationen" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Starten</dt>
<dd><p>Schaltfl&#228;che zum Starten der Instanz. Wenn die Instanz ausgef&#252;hrt wird, ist diese Schaltfl&#228;che deaktiviert.</p>

</dd>
<dt>Anhalten</dt>
<dd><p>Schaltfl&#228;che zum Anhalten der Instanz. Wenn die Instanz angehalten wird, ist diese Schaltfl&#228;che deaktiviert.</p>

</dd>
<dt>Neustart</dt>
<dd><p>Schaltfl&#228;che zum erneuten Starten der Instanz. Wenn die Instanz angehalten wird, ist diese Schaltfl&#228;che deaktiviert.</p>

</dd>
<dt>Protokolldateien anzeigen</dt>
<dd><p>Schaltfl&#228;che zum Anzeigen von Protokolldateien f&#252;r die Instanz.</p>

</dd>
<dt>Protokoll rotieren</dt>
<dd><p>Schaltfl&#228;che zum Rotieren der Protokolldatei f&#252;r die Instanz. Beim Rotieren der Protokolldatei wird die Datei mit einem Zeitstempelnamen im Format <tt>server.log_</tt><i> date-and-time</i><tt></tt> umbenannt und eine leere Protokolldatei wird f&#252;r neue Protokollmeldungen erstellt. Die &#196;nderungen werden dynamisch angewendet. Ein Neustarten des Servers ist nicht erforderlich.</p>

</dd>
<dt>Wiederherstellungsvorg&#228;nge</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen von Vorg&#228;ngen f&#252;r die Instanz.</p>

</dd>
<dt>Name</dt>
<dd><p>Der Name, der der Instanz bei der Erstellung zugewiesen wurde. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>JVM</dt>
<dd><p>Wenn Sie auf einen JVM-Bericht klicken, wird ein separates Fenster ge&#246;ffnet, das Berichte &#252;ber die Java Virtual Machine anzeigt, einschlie&#223;lich eines zusammenfassenden Berichts, Speichermanagement- und Aufr&#228;umbericht, Klassenladungsbericht und einem aktuellen Thread-Abbild.</p>

</dd>
<dt>Status</dt>
<dd><p>Gibt an, ob die Instanz ausgef&#252;hrt wird. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Knoten</dt>
<dd><p>Der Name des Knotens, auf dem sich die Instanz befindet. Wenn Sie auf den Namen klicken, wird die Seite "Knoten bearbeiten" f&#252;r den Knoten ge&#246;ffnet (siehe <a href="ref-nodeedit.html">Knoten bearbeiten</a>).</p>

</dd>
<dt>Konfiguration</dt>
<dd><p>Die Konfiguration, auf die die Instanz verweist. Durch Klicken auf die Konfiguration wird die Seite <a href="../../../common/de/help/ref-configuration.html">Konfigurationen</a> f&#252;r die Instanz ge&#246;ffnet.</p>

</dd>
<dt>Debugging (Fehlersuche)</dt>
<dd><p>Gibt an, ob das <a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">Java Platform Debugger Architecture (JPDA)</a>-Debugging f&#252;r die Instanz aktiviert ist. Dieses Feld ist schreibgesch&#252;tzt.</p>

<p>Wenn eine Instanz &#252;ber die Administration Console gestartet wird, wird das JPDA-Debugging f&#252;r die Instanz nicht aktiviert. Um eine Instanz mit aktiviertem JPDA-Debugging zu starten, verwenden Sie den Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a>.</p>

</dd>
<dt>HTTP-Ports</dt>
<dd><p>Eine durch Kommata getrennte Liste der Nummern von Ports, die die Instanz auf die folgenden Anforderungstypen &#252;berwacht:</p>


<ul><li><p>Administrationsanforderungen</p>

</li>
<li><p>HTTP-Anforderungen</p>

</li>
<li><p>HTTPS-Anforderungen</p>

</li></ul>
<p>Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>IIOP-Ports</dt>
<dd><p>Eine durch Kommata getrennte Liste der Nummern von Ports, die die Instanz f&#252;r die folgenden Verbindungstypen verwendet:</p>


<ul><li><p>Sichere IIOP-Verbindung</p>

</li>
<li><p>Sichere IIOP-Verbindungen mit Client-Authentifizierung</p>

</li>
<li><p>IIOP-Verbindungen</p>

</li></ul>
<p>Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-start-standalone-instances.html">So starten Sie eigenst&#228;ndige GlassFish-Server-Instanzen</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">So halten Sie eigenst&#228;ndige GlassFish-Server-Instanzen an</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">So zeigen Sie Protokolldateien f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">So stellen Sie Vorg&#228;nge f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz wieder her</a></p>

</li></ul>
<h5>Entsprechende <tt>asadmin</tt>-Unterbefehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-instance-1"><tt>start-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-instance-1"><tt>stop-instance</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=rotate-log-1"><tt>rotate-log</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
