<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-clustergeneral"></a><h4>Allgemeine Informationen</h4>
<a name="indexterm-164"></a><a name="indexterm-165"></a><a name="indexterm-166"></a><a name="indexterm-167"></a><p>Die Seite "Allgemeine Informationen" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Cluster starten</dt>
<dd><p>Schaltfl&#228;che zum Starten des Clusters. Wenn alle Instanzen im Cluster ausgef&#252;hrt werden, ist diese Schaltfl&#228;che deaktiviert.</p>

</dd>
<dt>Cluster anhalten</dt>
<dd><p>Schaltfl&#228;che zum Anhalten des Clusters. Wenn alle Instanzen im Cluster angehalten werden, ist diese Schaltfl&#228;che deaktiviert.</p>

</dd>
<dt>EJB-Zeitgeber migrieren</dt>
<dd><p>Schaltfl&#228;che zum Migrieren von Zeitgebern der Enterprise JavaBeans (EJB)-Technologie von einer angehaltenen GlassFish-Server-Instanz auf eine ausgef&#252;hrte Instanz im Cluster. Wenn Sie auf diese Schaltfl&#228;che klicken, wird die Seite <a href="ref-migrateejbtimers.html">EJB-Zeitgeber migrieren</a> ge&#246;ffnet. Wenn alle Instanzen im Cluster ausgef&#252;hrt werden, ist diese Schaltfl&#228;che deaktiviert.</p>

</dd>
<dt>Protokoll rotieren</dt>
<dd><p>Schaltfl&#228;che zum Rotieren der Protokolldatei f&#252;r den Cluster. Beim Rotieren der Protokolldatei wird die Datei mit einem Zeitstempelnamen im Format <tt>server.log_</tt><i> date-and-time</i><tt></tt> umbenannt und eine leere Protokolldatei wird f&#252;r neue Protokollmeldungen erstellt. Die &#196;nderungen werden dynamisch angewendet. Ein Neustarten des Servers ist nicht erforderlich.</p>

</dd>
<dt>Clustername</dt>
<dd><p>Der Name, der dem Cluster bei der Erstellung zugewiesen wurde. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>JVM</dt>
<dd><p>Wenn Sie auf einen JVM-Bericht klicken, wird ein separates Fenster ge&#246;ffnet, das Berichte &#252;ber die Java Virtual Machine anzeigt, einschlie&#223;lich eines zusammenfassenden Berichts, Speichermanagement- und Aufr&#228;umbericht, Klassenladungsbericht und einem aktuellen Thread-Abbild.</p>

</dd>
<dt>Konfiguration</dt>
<dd><p>Die Konfiguration, die f&#252;r den Cluster bei der Erstellung ausgew&#228;hlt wurde. Durch Klicken auf die Konfiguration wird die Seite <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-3027&id=ref-configuration">Konfigurationen</a> f&#252;r den Cluster ge&#246;ffnet. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>GMS</dt>
<dd><p>Wenn diese Option aktiviert ist, wird der Gruppenverwaltungsdienst (GMS, Group Management Service) in jeder GlassFish-Server-Instanz im Cluster und im Dom&#228;nenadministrationsserver (DAS, Domain Administration Server) gestartet. Der DAS ist an jedem Cluster beteiligt, f&#252;r den GMS aktiviert ist. GMS bietet Dienste f&#252;r Cluster&#252;berwachung, Clustermitgliedschaft und Gruppenkommunikation. Diese Option ist standardm&#228;&#223;ig aktiviert.</p>

</dd>
<dt>Multicast-Anschluss</dt>
<dd><p>Die Portnummer des Kommunikationsports, den GMS auf Gruppenereignisse &#252;berwacht. Bei dieser Option muss eine g&#252;ltige Portnummer im Bereich 2048&#8211;32000 angegeben sein. Der Standardwert wird automatisch in diesem Bereich generiert.</p>

</dd>
<dt>Multicast-Adresse</dt>
<dd><p>Die Adresse, den GMS auf Gruppenereignisse &#252;berwacht. Bei dieser Option muss eine Multicast-Adresse im Bereich von 224.0.0.0 und 239.255.255.255 angegeben werden. Der Standardwert lautet 228.9.<i>XX</i>.<i>YY</i>, wobei <i>XX</i> und <i>YY</i> f&#252;r automatisch generierte, unabh&#228;ngige Werte zwischen 0 und 255 stehen.</p>

</dd>
<dt>Schnittstellenadresse binden</dt>
<dd><p>Die IP-Adresse (Internet Protocol) der Netzwerkschnittstelle, zu der der GMS eine Verbindung herstellt. Bei dieser Option muss die IP-Adresse einer lokalen Netzwerkschnittstelle angegeben werden. Standardm&#228;&#223;ig werden alle &#246;ffentlichen Netzwerkschnittstellenadressen angegeben.</p>

<p>Bei mehrfach vernetzten (Multihomed) Rechnern wird durch diese Option die Netzwerkschnittstelle konfiguriert, die f&#252;r den GMS verwendet wird. Ein mehrfach vernetzter Rechner verf&#252;gt &#252;ber mindestens zwei Netzwerkschnittstellen.</p>

<p>Um eine Adresse anzugeben, die f&#252;r alle GlassFish-Server-Instanzen im Cluster g&#252;ltig ist, verwenden Sie eine Systemeigenschaft, mit der die Adresse einzeln f&#252;r jede Instanz festgelegt werden kann.</p>

<p>Verwenden Sie beispielsweise die Seite <a href="ref-clustersystemproperties.html">Cluster-Systemeigenschaften</a>, um die Systemeigenschaft <tt>GMS-BIND-INTERFACE-ADDRESS-<i>cluster-name</i></tt> zu erstellen. Setzen Sie anschlie&#223;end die Option f&#252;r die Verbindungsadresse auf dieser Seite auf <tt>${GMS-BIND-INTERFACE-ADDRESS-<i> cluster-name</i>}</tt>, um die Systemeigenschaft anzugeben. Setzen Sie abschlie&#223;end f&#252;r jede Instanz im Cluster die Systemeigenschaft <tt>GMS-BIND-INTERFACE-ADDRESS-<i> cluster-name</i></tt> auf die erforderliche Netzwerkschnittstellenadresse im Rechner der Instanz.</p>

</dd>
<dt>Status</dt>
<dd><p>Gibt die Anzahl der Instanzen im Cluster an, die ausgef&#252;hrt und nicht ausgef&#252;hrt werden. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-gmscluster.html">So konfigurieren Sie GMS-Einstellungen f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-migrate-ejb-timers.html">So migrieren Sie EJB-Zeitgeber</a></p>

</li></ul>
<h5>Entsprechende <tt>asadmin</tt>-Unterbefehle</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=generate-jvm-report-1"><tt>generate-jvm-report</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=migrate-timers-1"><tt>migrate-timers</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=rotate-log-1"><tt>rotate-log</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
