<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-gms"></a><h4>Gruppenverwaltungsdienst bearbeiten </h4>
<a name="indexterm-220"></a><p>Auf der Seite "Gruppenverwaltungsdienst" k&#246;nnen Sie die GMS-Einstellungen &#228;ndern.</p>

<p>Der Gruppenverwaltungsdienst (GMS, Group Management Service) ist ein prozessinterner Dienst, der Dienste
f&#252;r Cluster&#252;berwachung, Clustermitgliedschaft und Gruppenkommunikation bereitstellt. Der GMS baut auf einem konfigurierbaren
Stapel von Protokollen zu Gruppenmitgliedschaftserkennung und Zustands&#252;berwachung auf. Der GMS f&#252;hrt folgende
Funktionen aus:</p>


<ul><li><p>Benachrichtigt registrierte Module in einer GlassFish-Server-Instanz, wenn mindestens eine Mitgliedsinstanz zum Cluster hinzugef&#252;gt bzw. aus dem Cluster entfernt wurde oder bei denen Fehler vermutet bzw. best&#228;tigt wurden.</p>

</li>
<li><p>Erm&#246;glicht das Senden und Erhalten von Meldungen zwischen einer Gruppe von Prozessen.</p>

</li></ul>
<p>Die Seite "Gruppenverwaltungsdienst" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r alle Einstellungen.</p>

</dd>
<dt>Konfigurationsname</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Maximum Missed Heartbeats (Maximale Anzahl nicht ausgel&#246;ster Heartbeats)</dt>
<dd><p>Die Anzahl der &#220;berwachungsversuche, nach denen ein Fehler bei der Serverinstanz vermutet wird. Der Standardwert betr&#228;gt 3.</p>

</dd>
<dt>Heartbeat Frequency (Heartbeat-H&#228;ufigkeit)</dt>
<dd><p>Der Zeitraum zwischen den &#220;berwachungsversuchen. Der Standardwert betr&#228;gt 2000 Millisekunden.</p>

</dd>
<dt>Group Discovery Timeout (Zeit&#252;berschreitung f&#252;r Gruppenerkennung)</dt>
<dd><p>Der Zeitraum, den der GMS wartet, bis die Erkennung anderer Clustermitglieder fortgesetzt wird. Der Standardwert betr&#228;gt 5000 Millisekunden.</p>

</dd>
<dt>Failure Verification Wait Time (Wartezeit f&#252;r Fehler&#252;berpr&#252;fung)</dt>
<dd><p>Der Zeitraum, nach dem ein vermuteter Fehler als best&#228;tigt markiert wird. Der Standardwert betr&#228;gt 1500 Millisekunden.</p>

</dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>Eine Tabelle mit weiteren Eigenschaften f&#252;r den Gruppenverwaltungsdienst.</p>

<p>Bei GlassFish-Server sind keine weiteren Eigenschaften f&#252;r den Gruppenverwaltungsdienst definiert.</p>

<p>F&#252;r jede Instanz werden folgende Informationen angezeigt:</p>

<dl><dt>Name</dt>
<dd><p>Der Name der Eigenschaft.</p>

</dd>
<dt>Wert</dt>
<dd><p>Der Wert der Eigenschaft, der f&#252;r die ausgew&#228;hlte Instanz festgelegt ist.</p>

</dd>
<dt>Beschreibung</dt>
<dd><p>Eine Textbeschreibung mit weiteren Informationen zur Eigenschaft.</p>

</dd>
</dl>
<p>Die Tabelle "Weitere Eigenschaften" enth&#228;lt dar&#252;ber hinaus die folgenden Optionen.</p>

<dl><dt>Eigenschaft hinzuf&#252;gen</dt>
<dd><p>Schaltfl&#228;che zum Hinzuf&#252;gen einer Eigenschaft. Durch Klicken auf diese Schaltfl&#228;che wird eine Zeile zur Tabelle "Weitere Eigenschaften" hinzugef&#252;gt.</p>

</dd>
<dt>Eigenschaften l&#246;schen</dt>
<dd><p>Schaltfl&#228;che zum L&#246;schen einer oder mehrerer ausgew&#228;hlter Eigenschaften. Eine gel&#246;schte Eigenschaft wird auf den Standardwert zur&#252;ckgesetzt oder, falls kein Standardwert vorhanden ist, nicht definiert.</p>

</dd>
</dl>
</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-gmsenable.html">So aktivieren Sie den Gruppenverwaltungsdienst</a></p>

</li>
<li><p><a href="task-gms.html">So konfigurieren Sie den Gruppenverwaltungsdienst</a></p>

</li>
<li><p><a href="task-gmscluster.html">So konfigurieren Sie GMS-Einstellungen f&#252;r einen Cluster</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
