<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-availabilityservice"></a><h3>So konfigurieren Sie Verf&#252;gbarkeitseinstellungen f&#252;r einen Cluster</h3><a name="indexterm-4"></a><a name="indexterm-5"></a><a name="indexterm-6"></a><a name="indexterm-7"></a><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Knoten "Konfiguration".</b></li>
<li><b>W&#228;hlen Sie die Konfiguration f&#252;r den zu &#228;ndernden Cluster.</b></li>
<li><b>W&#228;hlen Sie unter dem Konfigurationsknoten den Verf&#252;gbarkeitsdienst-Knoten aus.</b><p>Die Seite "Verf&#252;gbarkeitsdienst" wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie im Feld "Verf&#252;gbarkeitsdienst" das Kontrollk&#228;stchen "Aktiviert", um die Verf&#252;gbarkeit f&#252;r
den Cluster mit der ausgew&#228;hlten Konfiguration zu aktivieren.</b><p>Um die Verf&#252;gbarkeit aufzuheben, deaktivieren Sie das Kontrollk&#228;stchen "Aktiviert" f&#252;r den Verf&#252;gbarkeitsdienst.</p></li>
<li>(Optional) <b>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</b><p>GlassFish-Server definiert keine weiteren Eigenschaften f&#252;r die Clusterverf&#252;gbarkeit.</p><ul>
<li><b>Um eine Eigenschaft hinzuzuf&#252;gen, klicken Sie auf die Schaltfl&#228;che "Eigenschaft hinzuf&#252;gen". Geben
Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld
"Name" und den Eigenschaftswert in das Feld "Wert" ein.</b></li>
<li><b>Um eine Eigenschaft zu &#228;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</b></li>
<li><b>Um eine Eigenschaft zu l&#246;schen, aktivieren Sie das Kontrollk&#228;stchen links neben dem
Feld "Name" der zu l&#246;schenden Eigenschaft und klicken Sie anschlie&#223;end auf die
Schaltfl&#228;che "Eigenschaften l&#246;schen".</b></li></ul></li>
<li><b>Klicken Sie auf "Speichern".</b></li></ol><p></b>Siehe auch</b></p>
<ul><li><p><a href="task-create-cluster.html">So erstellen Sie einen Cluster</a></p>

</li>
<li><p><a href="task-delete-cluster.html">So l&#246;schen Sie einen Cluster</a></p>

</li>
<li><p><a href="task-start-cluster.html">So starten Sie einen Cluster</a></p>

</li>
<li><p><a href="task-stop-cluster.html">So halten Sie einen Cluster an</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">So &#228;ndern Sie die Konfiguration eines Clusters</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">So stellen Sie eine Anwendung f&#252;r einen Cluster bereit</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">So listen Sie die f&#252;r einen Cluster bereitgestellten Anwendungen auf</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">So heben Sie die Bereitstellung von Anwendungen f&#252;r einen Cluster auf</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">So entfernen Sie Anwendungen aus einem Cluster</a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">So bearbeiten Sie die f&#252;r einen Cluster bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">So aktivieren oder deaktivieren Sie die f&#252;r einen Cluster bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">So aktivieren oder deaktivieren Sie den Lastenausgleich der f&#252;r einen Cluster bereitgestellten Anwendung</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">So erstellen Sie eine Ressource f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">So listen Sie Ressourcen f&#252;r einen Cluster auf</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">So aktivieren oder deaktivieren Sie global eine Ressource</a></p>

</li>
<li><p><a href="task-cluster-resource-edit.html">So bearbeiten Sie eine Ressource f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-upgrade-components.html">So aktualisieren Sie Komponenten ohne eine Dienstunterbrechung</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
