<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-start-cluster"></a><h3>So starten Sie einen Cluster</h3><a name="indexterm-8"></a><p>Durch Starten eines Clusters werden alle GlassFish-Server-Instanzen im Cluster gestartet, die noch
nicht ausgef&#252;hrt werden. </p>

<p><b>Bevor Sie beginnen</b></p><p>Stellen Sie sicher, dass die folgenden Voraussetzungen erf&#252;llt sind:</p>


<ul><li><p>Alle Knoten, auf denen sich Instanzen im Cluster befinden, werden f&#252;r die Remote-Kommunikation aktiviert.</p>

</li>
<li><p>Der Benutzer des Dom&#228;nenadministrationsservers (DAS, Domain Administration Server) kann sich &#252;ber Secure Shell (SSH) am Host f&#252;r alle Knoten anmelden, auf denen sich Instanzen im Cluster befinden.</p>

</li></ul>
<p>Wenn eine dieser Voraussetzungen nicht erf&#252;llt ist, starten Sie den Cluster, indem
Sie jede Instanz einzeln &#252;ber die Befehlszeile mit dem Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-local-instance-1"><tt>start-local-instance</tt>(1)</a> starten.</p>

<ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Knoten "Cluster".</b><p>Die Seite "Cluster" wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie auf der Seite "Cluster" das Kontrollk&#228;stchen neben dem Namen des
Clusters.</b></li>
<li><b>Klicken Sie auf "Cluster starten".</b><p>Sie m&#252;ssen das Starten des Clusters best&#228;tigen.</p></li>
<li><b>Best&#228;tigen Sie das Starten des Clusters.</b><p>Der Cluster wird gestartet. Der Status jeder Instanz im Cluster wird auf
der Seite "Cluster" aktualisiert, wenn die Instanz gestartet wird.</p></li></ol><p></b>Siehe auch</b></p>
<ul><li><p><a href="task-create-cluster.html">So erstellen Sie einen Cluster</a></p>

</li>
<li><p><a href="task-delete-cluster.html">So l&#246;schen Sie einen Cluster</a></p>

</li>
<li><p><a href="task-availabilityservice.html">So konfigurieren Sie Verf&#252;gbarkeitseinstellungen f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-stop-cluster.html">So halten Sie einen Cluster an</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">So &#228;ndern Sie die Konfiguration eines Clusters</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">So stellen Sie eine Anwendung f&#252;r einen Cluster bereit</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">So listen Sie die f&#252;r einen Cluster bereitgestellten Anwendungen auf</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">So heben Sie die Bereitstellung von Anwendungen f&#252;r einen Cluster auf</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">So entfernen Sie Anwendungen aus einem Cluster</a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">So bearbeiten Sie die f&#252;r einen Cluster bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">So aktivieren oder deaktivieren Sie die f&#252;r einen Cluster bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">So aktivieren oder deaktivieren Sie den Lastenausgleich der f&#252;r einen Cluster bereitgestellten Anwendung</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">So erstellen Sie eine Ressource f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">So listen Sie Ressourcen f&#252;r einen Cluster auf</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">So aktivieren oder deaktivieren Sie global eine Ressource</a></p>

</li>
<li><p><a href="task-cluster-resource-edit.html">So bearbeiten Sie eine Ressource f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-upgrade-components.html">So aktualisieren Sie Komponenten ohne eine Dienstunterbrechung</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
