<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-set-props-standalone-instance"></a><h4>So geben Sie instanzenbezogene Eigenschaften f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</h4><a name="indexterm-134"></a><a name="indexterm-135"></a><a name="indexterm-136"></a><p>Die Eigenschaften einer GlassFish-Server-Instanz enthalten optionale Konfigurationsinformationen zur Instanz.</p>

<ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Knoten "Eigenst&#228;ndige Instanzen".</b><p>Die Seite "Eigenst&#228;ndige Serverinstanz" wird ge&#246;ffnet.</p></li>
<li><b>W&#228;hlen Sie die Instanz, f&#252;r die instanzenbezogene Eigenschaften ge&#228;ndert werden sollen.</b><p>Die Seite "Allgemeine Informationen" f&#252;r die Instanz wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Allgemeine Informationen" auf die Registerkarte "Eigenschaften".</b></li>
<li><b>Klicken Sie, falls erforderlich, auf die Registerkarte "Instanzeigenschaften".</b><p>Die Seite "Instanzeigenschaften" wird ge&#246;ffnet.</p><p>Auf dieser Seite werden die Eigenschaften aufgelistet, die f&#252;r die ausgew&#228;hlte GlassFish-Server-Instanz
festgelegt sind.</p></li>
<li><b>Geben Sie f&#252;r jede vorhandene Eigenschaft, die Sie &#228;ndern m&#246;chten, den neuen
Wert im Feld "Wert" f&#252;r die Eigenschaft ein.</b></li>
<li><b>Geben Sie Werte f&#252;r alle zus&#228;tzlichen Eigenschaften ein, die Sie ben&#246;tigen.</b><ol style="list-style-type: lower-alpha">
<li><b>Klicken Sie in der Tabelle "Weitere Eigenschaften" auf "Eigenschaft hinzuf&#252;gen".</b><p>Eine Zeile wird zur Tabelle "Weitere Eigenschaften" hinzugef&#252;gt.</p></li>
<li><b>Geben Sie im Feld "Name" den Eigenschaftsnamen ein.</b></li>
<li><b>Geben Sie im Feld "Wert" den Wert ein.</b></li>
<li><b>Geben Sie im Feld "Beschreibung" eine kurze Beschreibung der Eigenschaft ein.</b></li></ol></li>
<li><b>Klicken Sie auf "Speichern".</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-create-standalone-instance.html">So erstellen Sie eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">So l&#246;schen Sie eigenst&#228;ndige GlassFish-Server-Instanzen</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">So starten Sie eigenst&#228;ndige GlassFish-Server-Instanzen</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">So halten Sie eigenst&#228;ndige GlassFish-Server-Instanzen an</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">So zeigen Sie Protokolldateien f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-recovertransactions-standalone-instance.html">So stellen Sie Vorg&#228;nge f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz wieder her</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">So stellen Sie eine Anwendung f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereit</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">So listen Sie die f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellten Anwendungen auf</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">So heben Sie die Bereitstellung von Anwendungen f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz auf</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">So entfernen Sie Anwendungen aus einer eigenst&#228;ndigen GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">So bearbeiten Sie die f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">So aktivieren oder deaktivieren Sie die f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">So aktivieren oder deaktivieren Sie den Lastenausgleich der f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellten Anwendung</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">So erstellen Sie eine Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">So listen Sie Ressourcen f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz auf</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">So aktivieren oder deaktivieren Sie eine Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">So bearbeiten Sie eine Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">So &#228;ndern Sie die Portnummern einer eigenst&#228;ndigen GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">So zeigen Sie &#220;berwachungsdaten der Anwendung f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">So zeigen Sie &#220;berwachungsdaten des virtuellen Servers f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">So zeigen Sie &#220;berwachungsdaten der Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
