<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-recovertransactions-standalone-instance"></a><h3>So stellen Sie Vorg&#228;nge f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz wieder her</h3><a name="indexterm-99"></a><a name="indexterm-100"></a><a name="indexterm-101"></a><ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Knoten "Eigenst&#228;ndige Instanzen".</b><p>Die Seite "Eigenst&#228;ndige Serverinstanz" wird ge&#246;ffnet.</p></li>
<li><b>W&#228;hlen Sie die Instanz, f&#252;r die Wiederherstellung von Vorg&#228;ngen erforderlich ist.</b><p>Die Seite "Allgemeine Informationen" f&#252;r die Instanz wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Allgemeine Informationen" auf "Wiederherstellungsvorg&#228;nge".</b><p>Die Seite "Wiederherstellungsvorg&#228;nge" wird angezeigt.</p><p>Der Inhalt der Seite h&#228;ngt davon ab, ob die Instanz ausgef&#252;hrt wird.</p>
<ul><li><p>Wenn die Instanz ausgef&#252;hrt wird, enth&#228;lt die Seite "Wiederherstellungsvorg&#228;nge" nur den Text <b>Recovery is performed by the running server itself</b> (Die Wiederherstellung wird vom Server selbst durchgef&#252;hrt) und die Schaltfl&#228;che "OK".</p>

</li>
<li><p>Wenn die Instanz nicht ausgef&#252;hrt wird, enth&#228;lt die Seite "Wiederherstellungsvorg&#228;nge" zus&#228;tzliche Optionen.</p>

</li></ul>
</li>
<li><b>W&#228;hlen Sie in der Dropdown-Liste "Zielserver" eine andere Instanz, die die Vorg&#228;nge
in der aktuellen Instanz wiederherstellen kann.</b><p>W&#228;hlen Sie bei einer eigenst&#228;ndigen Instanz die Instanz namens <tt>server</tt>, die den
Dom&#228;nenadministrationsserver (DAS) repr&#228;sentiert.</p></li>
<li><b>Geben Sie im Feld "Transaktionsprotokollverzeichnis" das Verzeichnis ein, in dem Transaktionsprotokolle gespeichert
sind.</b><p>Standardm&#228;&#223;ig handelt es sich um <tt>/logs/tx</tt> im Dom&#228;nenverzeichnis. Transaktionsprotokolle werden im Unterverzeichnis
<tt>tx</tt> des Verzeichnisses gespeichert, das durch die Einstellung "Verzeichnis des Transaktionsprotokolls" des
Transaktionsdienstes f&#252;r die Clusterkonfiguration angegeben ist. Der Standardwert f&#252;r "Verzeichnis des Transaktionsprotokolls"
ist das Verzeichnis, das auf der Seite "Dom&#228;nenattribute" im Feld "Protokollstamm" angegeben
ist, das sich im Knoten GlassFish-Server auf der Registerkarte "Erweitert" befindet.</p></li>
<li><b>Klicken Sie auf "OK".</b></li></ol><p></b>Siehe auch</b></p>
<ul><li><p><a href="task-create-standalone-instance.html">So erstellen Sie eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-delete-standalone-instances.html">So l&#246;schen Sie eigenst&#228;ndige GlassFish-Server-Instanzen</a></p>

</li>
<li><p><a href="task-start-standalone-instances.html">So starten Sie eigenst&#228;ndige GlassFish-Server-Instanzen</a></p>

</li>
<li><p><a href="task-stop-standalone-instances.html">So halten Sie eigenst&#228;ndige GlassFish-Server-Instanzen an</a></p>

</li>
<li><p><a href="task-view-logs-standalone-instance.html">So zeigen Sie Protokolldateien f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-standalone-instance-app-deploy.html">So stellen Sie eine Anwendung f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereit</a></p>

</li>
<li><p><a href="task-standalone-instance-app-list.html">So listen Sie die f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellten Anwendungen auf</a></p>

</li>
<li><p><a href="task-standalone-instance-app-undeploy.html">So heben Sie die Bereitstellung von Anwendungen f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz auf</a></p>

</li>
<li><p><a href="task-standalone-instance-app-remove.html">So entfernen Sie Anwendungen aus einer eigenst&#228;ndigen GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-standalone-instance-app-edit.html">So bearbeiten Sie die f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-standalone-instance-app-enable-disable.html">So aktivieren oder deaktivieren Sie die f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-standalone-instance-app-lb-enable-disable.html">So aktivieren oder deaktivieren Sie den Lastenausgleich der f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz bereitgestellten Anwendung</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-create.html">So erstellen Sie eine Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-display.html">So listen Sie Ressourcen f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz auf</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-enable-disable.html">So aktivieren oder deaktivieren Sie eine Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-standalone-instance-resource-edit.html">So bearbeiten Sie eine Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-change-standalone-instance-ports.html">So &#228;ndern Sie die Portnummern einer eigenst&#228;ndigen GlassFish-Server-Instanz</a></p>

</li>
<li><p><a href="task-set-props-standalone-instance.html">So geben Sie instanzenbezogene Eigenschaften f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-mon-app-standalone-instance.html">So zeigen Sie &#220;berwachungsdaten der Anwendung f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-mon-server-standalone-instance.html">So zeigen Sie &#220;berwachungsdaten des virtuellen Servers f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li>
<li><p><a href="task-mon-resource-standalone-instance.html">So zeigen Sie &#220;berwachungsdaten der Ressource f&#252;r eine eigenst&#228;ndige GlassFish-Server-Instanz an</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
