<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-change-clustered-instance-ports"></a><h4>So &#228;ndern Sie die Portnummern einer GlassFish-Server-Cluster-Instanz</h4><a name="indexterm-64"></a><a name="indexterm-65"></a><a name="indexterm-66"></a><p>Die Portnummern einer GlassFish-Server-Cluster-Instanz werden urspr&#252;nglich in der Konfiguration festgelegt, die die
Instanz vom &#252;bergeordneten Cluster &#252;bernimmt. Sie m&#252;ssen diese Portnummern &#228;ndern, wenn sich
beispielsweise zwei Cluster-Instanzen auf demselben Host befinden. In diesem Fall m&#252;ssen die
Portnummern f&#252;r eine Instanz ge&#228;ndert werden, da beide Instanzen dieselbe Konfiguration verwenden.</p>

<p>Die Portnummern einer Instanz werden als Java-Systemeigenschaften gespeichert. Diese Eigenschaften werden an
das Java-Anwendungsstarttool &#252;ber die Option <tt>-D</tt> des Java-Anwendungsstarttools weitergeleitet, wenn GlassFish-Server gestartet
wird. </p>

<ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Knoten "Cluster".</b></li>
<li><b>W&#228;hlen Sie unter dem erweiterten Knoten "Cluster" den Knoten f&#252;r den Cluster.</b><p>Die Seite "Allgemeine Informationen" f&#252;r den Cluster wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Allgemeine Informationen" auf die Registerkarte "Instanzen". </b><p>Die Seite "Cluster-Serverinstanzen" wird f&#252;r den Cluster ge&#246;ffnet.</p></li>
<li><b>W&#228;hlen Sie die Instanz, f&#252;r die Portnummern ge&#228;ndert werden sollen.</b><p>Die Seite "Allgemeine Informationen" f&#252;r die Instanz wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Allgemeine Informationen" auf die Registerkarte "Eigenschaften".</b><p>Die Seite "Instance System Properties" (Instanz-Systemeigenschaften) wird ge&#246;ffnet.</p><p>Auf dieser Seite werden die aktuellen Werte der folgenden Systemeigenschaften f&#252;r die
Instanz angezeigt:</p>
<ul><li><p><a href="../../../common/de/help/ref-predefinedconfigsysproperties.html">Portnummern, die in der Konfiguration der Instanz vordefiniert sind</a></p>

</li>
<li><p>Benutzerdefinierte Eigenschaften, die f&#252;r die Instanz definiert sind (falls vorhanden)</p>

</li></ul>
</li>
<li><b>Geben Sie f&#252;r jede vorhandene Eigenschaft, die Sie &#228;ndern m&#246;chten, den neuen
Wert im Feld "Wert &#252;bergehen" f&#252;r die Eigenschaft ein.</b></li>
<li><b>Geben Sie Werte f&#252;r alle zus&#228;tzlichen Eigenschaften ein, die Sie ben&#246;tigen.</b><ol style="list-style-type: lower-alpha">
<li><b>Klicken Sie in der Tabelle "Weitere Eigenschaften" auf "Eigenschaft hinzuf&#252;gen".</b><p>Eine Zeile wird zur Tabelle "Weitere Eigenschaften" hinzugef&#252;gt.</p></li>
<li><b>Geben Sie im Feld "Name der Instanzenvariablen" den Eigenschaftsnamen ein.</b></li>
<li><b>Geben Sie im Feld "Wert &#252;bergehen" den Wert ein.</b></li></ol></li>
<li><b>Klicken Sie auf "Speichern".</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-create-clustered-instance.html">So f&#252;gen Sie eine GlassFish-Server-Instanz zu einem Cluster hinzu</a></p>

</li>
<li><p><a href="task-delete-clustered-instances.html">So l&#246;schen Sie GlassFish-Server-Cluster-Instanzen</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">So starten Sie GlassFish-Server-Cluster-Instanzen</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">So halten Sie GlassFish-Server-Cluster-Instanzen an</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">So zeigen Sie Protokolldateien f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-recovertransactions.html">So stellen Sie Vorg&#228;nge f&#252;r eine GlassFish-Server-Cluster-Instanz wieder her</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">So geben Sie instanzenbezogene Eigenschaften f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">So zeigen Sie &#220;berwachungsdaten der Anwendung f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">So zeigen Sie &#220;berwachungsdaten des virtuellen Servers f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">So zeigen Sie &#220;berwachungsdaten der Ressource f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
