<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-create-clustered-instance"></a><h4>So f&#252;gen Sie eine GlassFish-Server-Instanz zu einem Cluster hinzu</h4><a name="indexterm-45"></a><a name="indexterm-46"></a><a name="indexterm-47"></a><p>GlassFish-Server-Instanzen bilden die Basis einer Anwendungsbereitstellung. Eine Cluster-Instanz ist in einem Cluster
enthalten. Jede Instanz geh&#246;rt einer einzelnen Dom&#228;ne an und weist eine eigene
Verzeichnisstruktur, Konfiguration sowie bereitgestellte Anwendungen auf. Jede Instanz enth&#228;lt au&#223;erdem die Java-Plattform,
Webcontainer f&#252;r Enterprise Edition (Java EE) und Container f&#252;r Enterprise JavaBeans-Technologie (EJB-Technologie).
Alle neuen Instanzen m&#252;ssen einen Verweis auf einen Knoten enthalten, der den
Host definiert, auf dem sich die Instanz befinden soll.</p>


<hr><p><b>Hinweis - </b>Um eine Instanz auf einem Knotentyp KONFIGURATION zu erstellen, der einen Remote-Host
darstellt, m&#252;ssen Sie den Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-local-instance-1"><tt>create-local-instance</tt>(1)</a> verwenden. Zu diesem Zweck k&#246;nnen Sie
nicht die Administration Console verwenden.</p>


<hr>
<h6>Bevor Sie beginnen</h6><p>Vergewissern Sie sich, dass folgende Komponenten vorhanden sind:</p>


<ul><li><p><a href="task-create-cluster.html">Cluster, zu dem Sie die Instanz hinzuf&#252;gen</a></p>

</li>
<li><p><a href="task-createnode.html">Knoten, auf dem sich die Instanz befinden soll</a></p>

</li></ul>
<ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Knoten "Cluster".</b></li>
<li><b>W&#228;hlen Sie unter dem erweiterten Knoten "Cluster" den Knoten f&#252;r den Cluster.</b><p>Die Seite "Allgemeine Informationen" f&#252;r den Cluster wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Allgemeine Informationen" auf die Registerkarte "Instanzen". </b><p>Die Seite "Cluster-Serverinstanzen" wird f&#252;r den Cluster ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Cluster-Serverinstanzen" auf "Neu".</b><p>Die Seite "Neue Clusterserverinstanz" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie im Feld "Name" einen Namen f&#252;r die Instanz ein.</b><p>Der Name muss den folgenden Anforderungen entsprechen:</p>
<ul><li><p>Der Name muss mit einem Buchstaben, einer Ziffer oder einem Unterstrich beginnen.</p>

</li>
<li><p>Der Name darf nur die folgenden Zeichen enthalten:</p>


<ul><li><p>Kleinbuchstaben</p>

</li>
<li><p>Gro&#223;buchstaben</p>

</li>
<li><p>Ziffern</p>

</li>
<li><p>Bindestriche</p>

</li>
<li><p>Punkte</p>

</li>
<li><p>Unterstriche</p>

</li></ul>
</li>
<li><p>Der Name in der Dom&#228;ne muss eindeutig sein und darf nicht der Name einer anderen GlassFish-Server-Instanz, eines Clusters, einer benannten Konfiguration oder eines Knotens sein.</p>

</li>
<li><p>Bei dem Namen darf es sich nicht um <tt>domain</tt>, <tt>server</tt> oder ein anderes Schl&#252;sselwort handeln, das von GlassFish-Server reserviert ist.</p>

</li></ul>
</li>
<li><b>W&#228;hlen Sie in der Dropdown-Liste "Knoten" den Knoten, auf dem die Instanz
sich befinden soll.</b></li>
<li><b>Klicken Sie auf "OK".</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-delete-clustered-instances.html">So l&#246;schen Sie GlassFish-Server-Cluster-Instanzen</a></p>

</li>
<li><p><a href="task-start-clustered-instances.html">So starten Sie GlassFish-Server-Cluster-Instanzen</a></p>

</li>
<li><p><a href="task-stop-clustered-instances.html">So halten Sie GlassFish-Server-Cluster-Instanzen an</a></p>

</li>
<li><p><a href="task-view-logs-clustered-instance.html">So zeigen Sie Protokolldateien f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-recovertransactions.html">So stellen Sie Vorg&#228;nge f&#252;r eine GlassFish-Server-Cluster-Instanz wieder her</a></p>

</li>
<li><p><a href="task-change-clustered-instance-ports.html">So &#228;ndern Sie die Portnummern einer GlassFish-Server-Cluster-Instanz</a></p>

</li>
<li><p><a href="task-set-props-clustered-instance.html">So geben Sie instanzenbezogene Eigenschaften f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-mon-app-clustered-instance.html">So zeigen Sie &#220;berwachungsdaten der Anwendung f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-mon-server-clustered-instance.html">So zeigen Sie &#220;berwachungsdaten des virtuellen Servers f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li>
<li><p><a href="task-mon-resource-clustered-instance.html">So zeigen Sie &#220;berwachungsdaten der Ressource f&#252;r eine GlassFish-Server-Cluster-Instanz an</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
