<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-delete-cluster"></a><h3>So l&#246;schen Sie einen Cluster</h3><a name="indexterm-3"></a><p>Durch L&#246;schen eines Clusters werden der Cluster und alle GlassFish-Server-Instanzen im Cluster
gel&#246;scht. Sie brauchen die Instanzen im Cluster nicht zu l&#246;schen, bevor Sie
den Cluster l&#246;schen.</p>

<p>Wenn die vom Cluster verwendete Konfiguration nicht gemeinsam genutzt wird, wird die
Konfiguration ebenfalls gel&#246;scht.</p>

<p><b>Bevor Sie beginnen</b></p><p>Vergewissern Sie sich, dass der zu l&#246;schende Cluster angehalten ist (weitere Informationen
erhalten Sie <a href="task-stop-cluster.html">hier</a>).</p>

<ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Knoten "Cluster".</b><p>Die Seite "Cluster" wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie auf der Seite "Cluster" das Kontrollk&#228;stchen neben dem Namen des
Clusters.</b></li>
<li><b>Klicken Sie auf "L&#246;schen".</b><p>Sie m&#252;ssen das L&#246;schen des Clusters und aller Instanzen im Cluster best&#228;tigen.</p></li>
<li><b>Best&#228;tigen Sie das L&#246;schen des Clusters und aller Instanzen im Cluster.</b><p>Der Cluster wird gel&#246;scht und aus der Tabelle der Cluster auf der
Seite "Cluster" entfernt.</p></li></ol><p></b>Siehe auch</b></p>
<ul><li><p><a href="task-create-cluster.html">So erstellen Sie einen Cluster</a></p>

</li>
<li><p><a href="task-availabilityservice.html">So konfigurieren Sie Verf&#252;gbarkeitseinstellungen f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-start-cluster.html">So starten Sie einen Cluster</a></p>

</li>
<li><p><a href="task-stop-cluster.html">So halten Sie einen Cluster an</a></p>

</li>
<li><p><a href="task-modify-cluster-config.html">So &#228;ndern Sie die Konfiguration eines Clusters</a></p>

</li>
<li><p><a href="task-cluster-app-deploy.html">So stellen Sie eine Anwendung f&#252;r einen Cluster bereit</a></p>

</li>
<li><p><a href="task-cluster-app-list.html">So listen Sie die f&#252;r einen Cluster bereitgestellten Anwendungen auf</a></p>

</li>
<li><p><a href="task-cluster-app-undeploy.html">So heben Sie die Bereitstellung von Anwendungen f&#252;r einen Cluster auf</a></p>

</li>
<li><p><a href="task-cluster-app-remove.html">So entfernen Sie Anwendungen aus einem Cluster</a></p>

</li>
<li><p><a href="task-cluster-app-edit.html">So bearbeiten Sie die f&#252;r einen Cluster bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-cluster-app-enable-disable.html">So aktivieren oder deaktivieren Sie die f&#252;r einen Cluster bereitgestellte Anwendung</a></p>

</li>
<li><p><a href="task-cluster-app-lb-enable-disable.html">So aktivieren oder deaktivieren Sie den Lastenausgleich der f&#252;r einen Cluster bereitgestellten Anwendung</a></p>

</li>
<li><p><a href="task-cluster-resource-create.html">So erstellen Sie eine Ressource f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-cluster-resource-display.html">So listen Sie Ressourcen f&#252;r einen Cluster auf</a></p>

</li>
<li><p><a href="task-cluster-resource-enable-disable.html">So aktivieren oder deaktivieren Sie global eine Ressource</a></p>

</li>
<li><p><a href="task-cluster-resource-edit.html">So bearbeiten Sie eine Ressource f&#252;r einen Cluster</a></p>

</li>
<li><p><a href="task-upgrade-components.html">So aktualisieren Sie Komponenten ohne eine Dienstunterbrechung</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
