<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a><a id="GHEJL00001" name="GHEJL00001"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina de Enterprise Java Beans (EJB) para configurar las opciones del contenedor EJB.</p>
<p>Aparte de la configuraci&oacute;n general de Enterprise Beans, puede configurar las opciones de conjuntos y de cach&eacute;.</p>
<ul>
<li>
<p>La configuraci&oacute;n del conjunto se aplica s&oacute;lo a los beans de sesi&oacute;n sin estado. De forma predeterminada, el contenedor mantiene un conjunto de Enterprise Beans para responder a solicitudes de clientes sin repercutir en el rendimiento debido al proceso de creaci&oacute;n de beans.</p>
<p>Si una aplicaci&oacute;n que utiliza Enterprise Beans implementados tiene problemas de rendimiento, dicho rendimiento puede mejorarse creando un conjunto o aumentando la cantidad de beans mantenidos por un conjunto ya creado.</p>
</li>
<li>
<p>La configuraci&oacute;n de la memoria cach&eacute; se aplica &uacute;nicamente a los beans de sesi&oacute;n con estado. El contenedor mantiene una memoria cach&eacute; de datos de Enterprise Bean para los Enterprise Beans m&aacute;s utilizados. De este modo, el contenedor responde con m&aacute;s rapidez a las solicitudes de otros m&oacute;dulos de aplicaciones para datos desde los Enterprise Beans.</p>
<p>Los Enterprise Beans almacenados en memoria cach&eacute; tienen uno de los tres estados siguientes: activo, inactivo y pasivo. Si un Enterprise Bean est&aacute; activo, significa que los clientes est&aacute;n obteniendo acceso a &eacute;l. Los datos de un bean de empresa inactivo est&aacute;n en la memoria cach&eacute;, pero no hay clientes que intenten obtener acceso al bean. Los datos de un bean de empresa pasivo se almacenan temporalmente y se vuelven a leer en la memoria cach&eacute; si un cliente solicita el bean.</p>
</li>
</ul>
<p>La p&aacute;gina de Enterprise Java Beans (EJB) contiene las opciones siguientes.</p>
<dl>
<dt>Cargar valores predeterminados</dt>
<dd>
<p>Bot&oacute;n para restaurar la configuraci&oacute;n que tiene valores por defecto a estos valores. La configuraci&oacute;n que no tiene valores por defecto no se modifica.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Ubicaci&oacute;n del almacenamiento de sesi&oacute;n</dt>
<dd>
<p>El directorio en el que las sesiones de beans pasivos y las sesiones de HTTP que siguen activas se almacenan en el sistema de archivos. El valor por defecto es <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Los beans en estado pasivo son beans de sesi&oacute;n cuyo estado se ha escrito en un archivo del sistema de archivos. En general, los beans pasivos han estado inactivos durante un periodo de tiempo y en la actualidad los clientes no tienen acceso a ellos. Asimismo, las sesiones de HTTP que contin&uacute;an activas son sesiones web individuales cuyo estado se ha escrito en un archivo del sistema de archivos.</p>
</dd>
<dt>Opci&oacute;n de confirmaci&oacute;n</dt>
<dd>
<p>Especifica el modo en que el contenedor almacena en cach&eacute; instancias de beans pasivos entre transacciones. Si selecciona la Opci&oacute;n B (valor predeterminado), el contenedor almacena en cach&eacute; una instancia preparada entre transacciones. Si selecciona la Opci&oacute;n C, el contenedor no almacena en cach&eacute; una instancia preparada entre transacciones.</p>
</dd>
<dt>Tama&ntilde;o inicial y m&iacute;nimo del conjunto</dt>
<dd>
<p>El n&uacute;mero m&iacute;nimo de beans que se mantendr&aacute;n en el conjunto. El valor predeterminado es 0.</p>
</dd>
<dt>Tama&ntilde;o m&aacute;ximo del conjunto</dt>
<dd>
<p>La cantidad m&aacute;xima beans que el contenedor puede mantener en el conjunto de una vez. El valor predeterminado es 32.</p>
</dd>
<dt>Cantidad de cambio de tama&ntilde;o del conjunto</dt>
<dd>
<p>El n&uacute;mero de beans que se quitan del conjunto si est&aacute;n inactivos m&aacute;s tiempo que el especificado en el campo Tiempo de espera de inactividad de conjunto. El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de conjunto m&aacute;ximo. El valor predeterminado es 8.</p>
</dd>
<dt>Tiempo de espera de inactividad de conjunto</dt>
<dd>
<p>El intervalo de tiempo, en segundos, que un bean del conjunto puede estar inactivo antes de que se quite del conjunto. Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor predeterminado es 600.</p>
</dd>
<dt>Tama&ntilde;o de cach&eacute; m&aacute;ximo</dt>
<dd>
<p>El n&uacute;mero m&aacute;ximo de beans que puede haber en la memoria cach&eacute;. Incremente la cantidad m&aacute;xima de beans que puede haber en la memoria cach&eacute; para eliminar la carga indirecta de crear y destruir. Ahora bien, si la memoria cach&eacute; se incrementa, el servidor consume m&aacute;s memoria y recursos. Compruebe que el sistema operativo admita esa configuraci&oacute;n de cach&eacute;. El valor 0 indica una memoria cach&eacute; ilimitada. El valor predeterminado es 512.</p>
</dd>
<dt>Cantidad de cambio de tama&ntilde;o de cach&eacute;</dt>
<dd>
<p>El n&uacute;mero de beans que se deben colocar en estado pasivo cuando la memoria cach&eacute; est&aacute; llena. Si se llega al n&uacute;mero m&aacute;ximo de beans en cach&eacute;, el contenedor quita del almac&eacute;n de copia de seguridad una determinada cantidad de beans en estado pasivo. Este valor especifica tambi&eacute;n el n&uacute;mero de beans que se deben crear si llega una solicitud y en ese momento el conjunto no dispone de beans. El valor debe ser mayor que 1 y menor que el valor de Tama&ntilde;o de cach&eacute; m&aacute;ximo. El valor predeterminado es 32.</p>
</dd>
<dt>Tiempo de espera de eliminaci&oacute;n</dt>
<dd>
<p>El n&uacute;mero de segundos despu&eacute;s de los cuales un bean en estado pasivo se quita del almac&eacute;n de la sesi&oacute;n. Un valor de 0 significa que el contenedor no quita los beans inactivos autom&aacute;ticamente. Si el valor de Tiempo de espera de eliminaci&oacute;n es menor o igual al de Tiempo de espera de inactividad de cach&eacute;, los beans se quitan inmediatamente sin ponerse en estado pasivo. El valor predeterminado es 5400.</p>
</dd>
<dt>Directiva de selecci&oacute;n de eliminaci&oacute;n</dt>
<dd>
<p>Directiva que el contenedor aplica para quitar beans de sesi&oacute;n con estado de la memoria cach&eacute;. Las opciones son las siguientes:</p>
<dl>
<dt>No utilizados recientemente</dt>
<dd>
<p>Elimina un bean que no se haya utilizado de forma reciente. &Eacute;ste es el valor predeterminado.</p>
</dd>
<dt>Primero en entrar, primero en salir</dt>
<dd>
<p>Quita el bean m&aacute;s antiguo de la memoria cach&eacute;.</p>
</dd>
<dt>Menos utilizado recientemente</dt>
<dd>
<p>Quita el bean que menos se haya utilizado recientemente.</p>
</dd>
</dl>
</dd>
<dt>Tiempo de espera de inactividad de cach&eacute;</dt>
<dd>
<p>El n&uacute;mero m&aacute;ximo de segundos que un bean puede permanecer inactivo en la memoria cach&eacute;. Una vez transcurrido ese tiempo, el contenedor puede colocar este bean en estado pasivo. Un valor de 0 especifica que los beans nunca se convierten en candidatos a tener el estado pasivo. El valor predeterminado es 600.</p>
</dd>
<dt>Propiedades adicionales</dt>
<dd>
<p>Propiedades adicionales del contenedor EJB.</p>
<p>Para obtener una descripci&oacute;n de las propiedades disponibles, consulte <a href="ref-ejbgeneralproperties.html">Propiedades Espec&iacute;ficas del Contenedor EJB</a>.</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">Definir Configuraci&oacute;n de EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/es/help/missingtopic.html">Para configurar las opciones de conjuntos MDB</a></p>
</li>
<li>
<p><a href="../../../ejb/es/help/missingtopic.html">Para configurar el servicio de temporizador de EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/es/help/missingtopic.html">To Configure Availability Settings for the EJB Container</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
