<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbmdbpoolsettings"></a><h4>Configura&#231;&#245;es do Conjunto MDB padr&#227;o</h4>
<a name="indexterm-15"></a><a name="indexterm-16"></a><a name="indexterm-17"></a><p>Utilize a p&#225;gina Configura&#231;&#245;es do conjunto MDB padr&#227;o, para configurar o conjunto
MDB.</p>

<p>A p&#225;gina Configura&#231;&#245;es do conjunto MDB padr&#227;o cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar com os valores padr&#227;o as configura&#231;&#245;es que apresentam valores padr&#227;o. As configura&#231;&#245;es que n&#227;o apresentam valores padr&#227;o n&#227;o s&#227;o alteradas.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>O nome da configura&#231;&#227;o para a qual as defini&#231;&#245;es nesta p&#225;gina se aplicam. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Tamanho inicial e m&#237;nimo do conjunto</dt>
<dd><p>O n&#250;mero m&#237;nimo de beans de mensagem a serem mantidos no conjunto.  O valor padr&#227;o &#233; 0.</p>

</dd>
<dt>Tamanho m&#225;ximo do conjunto</dt>
<dd><p>O n&#250;mero m&#225;ximo de beans que o recipiente pode manter no conjunto ao mesmo tempo. O valor padr&#227;o &#233; 32.</p>

</dd>
<dt>Quantidade de redimensionamento do conjunto</dt>
<dd><p>O n&#250;mero de beans que s&#227;o removidos do conjunto, se estiverem ociosos por mais tempo do que o especificado no campo Tempo limite de conjunto ocioso. O valor precisa ser ao menos 0 e menor do que o valor de Tamanho m&#225;ximo do conjunto. O valor padr&#227;o &#233; 8.</p>

</dd>
<dt>Tempo limite de conjunto ocioso</dt>
<dd><p>O tempo, em segundos, que um conjunto pode permanecer ocioso antes que seja removido do conjunto. Ap&#243;s esta quantidade de tempo, o bean &#233; destru&#237;do. Um valor de 0 significa que um bean pode permanecer ocioso indefinidamente. O valor padr&#227;o &#233; 600.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais do conjunto MDB. O Servidor GlassFish n&#227;o define quaisquer propriedades adicionais para o conjunto MDB.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-ejbmdbpoolsettings.html">Para configurar as defini&#231;&#245;es do conjunto MDB</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2966&id=task-ejbgeneral">Para configurar as defini&#231;&#245;es EJB</a></p>

</li>
<li><p><a href="task-ejbtimerservice.html">Para configurar o servi&#231;o de temporizador EJB</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>



<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
