<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbcontaineravailability"></a><h4>Disponibilidade de recipiente EJB</h4>
<a name="indexterm-13"></a><a name="indexterm-14"></a><p>Utilize a p&#225;gina Disponibilidade de recipiente EJB para configurar as defini&#231;&#245;es do
recipiente EJB.</p>

<p>A p&#225;gina Disponibilidade de recipiente EJB cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome da configura&#231;&#227;o</dt>
<dd><p>Nome da configura&#231;&#227;o ao qual as configura&#231;&#245;es desta p&#225;gina ser&#227;o enviadas. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Servi&#231;o de disponibilidade</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Ativo estiver marcada, a disponibilidade est&#225; ativada para o recipiente EJB.</p>

</dd>
<dt>Tipo de persist&#234;ncia de alta disponibilidade</dt>
<dd><p>Mecanismo de persist&#234;ncia utilizado quando a op&#231;&#227;o Servi&#231;o de disponibilidade ativado estiver marcada. O padr&#227;o &#233; <tt>replicated</tt>, que oferece persist&#234;ncia com base no failover em um cluster. N&#227;o altere este valor.</p>

</dd>
<dt>Tipo de persist&#234;ncia de SFSB</dt>
<dd><p>Mecanismo de persist&#234;ncia utilizado quando a op&#231;&#227;o Servi&#231;o de disponibilidade ativado <b>n&#227;o</b> estiver marcada. O padr&#227;o &#233; <tt>file</tt>, que oferece persist&#234;ncia com base no sistema de arquivos. N&#227;o altere este valor.</p>

<p>O campo Local de armazenamento da sess&#227;o determina onde os estados do ponto de verifica&#231;&#227;o SFSB s&#227;o persistentes. Para definir o Local de armazenamento da sess&#227;o, consulte <a href="../../../ejb-lite/pt_BR/help/task-ejbgeneral.html">Para configurar as defini&#231;&#245;es do EJB</a>.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais da disponibilidade do recipiente EJB.</p>

<p>O Servidor GlassFish n&#227;o define propriedades adicionais da disponibilidade do recipiente EJB.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-ejbcontaineravailability.html">Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente EJB</a></p>

</li>
<li><p><a href="../../../ejb-lite/pt_BR/help/task-ejbgeneral.html">Para configurar as defini&#231;&#245;es EJB</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
