<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbtimerservice"></a><h4>Servi&#231;o de temporizador EJB</h4>
<a name="indexterm-18"></a><a name="indexterm-19"></a><a name="indexterm-20"></a><p>Use a p&#225;gina Servi&#231;os de temporizador EJB para configurar o servi&#231;o de
temporizador EJB.</p>

<p>O servi&#231;o de temporizador &#233; um servi&#231;o de notifica&#231;&#227;o persistente e transacional
que &#233; fornecido pelo recipiente do bean corporativo, e &#233; usado para
programar notifica&#231;&#245;es ou eventos usados por beans corporativos. Todos os beans corporativos,
exceto os beans de sess&#227;o com estado, podem receber notifica&#231;&#245;es do servi&#231;o
de temporizador. Os temporizadores persistentes definidos pelo servi&#231;o n&#227;o s&#227;o destru&#237;dos quando
o servidor &#233; desligado ou reiniciado.</p>

<p>A p&#225;gina Servi&#231;o de temporizador EJB cont&#233;m a seguintes op&#231;&#245;es:</p>

<dl><dt>Carregar padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar com os valores padr&#227;o as configura&#231;&#245;es que apresentam valores padr&#227;o. As configura&#231;&#245;es que n&#227;o apresentam valores padr&#227;o n&#227;o s&#227;o alteradas.</p>

</dd>
<dt>Configuration Name</dt>
<dd><p>O nome da configura&#231;&#227;o para a qual as defini&#231;&#245;es nesta p&#225;gina se aplicam. Este campo &#233; de somente leitura.</p>

</dd>
<dt>Intervalo m&#237;nimo de entrega</dt>
<dd><p>O n&#250;mero m&#237;nimo de milissegundos permitidos antes que o pr&#243;ximo vencimento do temporizador para um determinado temporizador possa ocorrer. Definir esse intervalo com um valor muito baixo pode causar a sobrecarga do servidor. O valor padr&#227;o &#233; 1000.</p>

</dd>
<dt>M&#225;ximo de reentregas</dt>
<dd><p>O n&#250;mero m&#225;ximo de tentativas feitas pelo servi&#231;o de temporizador para entregar um vencimento do temporizador devido &#224; exce&#231;&#227;o ou ao retorno. O valor padr&#227;o &#233; 1. </p>

</dd>
<dt>Intervalo de reentrega</dt>
<dd><p>O intervalo em milissegundos entre as tentativas de reentrega. O valor padr&#227;o &#233; 5.000.</p>

</dd>
<dt>Origem dos dados do temporizador</dt>
<dd><p>O nome JNDI do recurso JDBC que ser&#225; usado como a origem dos dados do temporizador. Se especificado, este valor sobrep&#245;e o valor padr&#227;o de <tt>jdbc/__TimerPool</tt> para o aplicativo do sistema do servi&#231;o de temporizador.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-ejbtimerservice.html">Para configurar o servi&#231;o de temporizador EJB</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2966&id=task-ejbgeneral">Para configurar as defini&#231;&#245;es EJB</a></p>

</li>
<li><p><a href="task-ejbmdbpoolsettings.html">Para configurar as defini&#231;&#245;es do conjunto MDB</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-timers-1"><tt>list-timers</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
