<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-ejbcontaineravailability"></a><h3>Para configurar as defini&#231;&#245;es de disponibilidade de um recipiente EJB</h3><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><a name="indexterm-12"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Selecione a configura&#231;&#227;o que est&#225; sendo alterada.</b></li>
<li><b>No n&#243; da configura&#231;&#227;o, selecione o n&#243; Servi&#231;o de disponibilidade.</b><p>A p&#225;gina Servi&#231;o de disponibilidade &#233; exibida.</p></li>
<li><b>Na p&#225;gina Servi&#231;o de disponibilidade, clique na guia Disponibilidade do recipiente EJB.</b><p>A p&#225;gina Disponibilidade do recipiente EJB se abre.</p></li>
<li><b>Marque a caixa Servi&#231;o de disponibilidade ativado para ativar a disponibilidade para
o recipiente EJB.</b><p>Para desativar a disponibilidade, desmarque a caixa Ativo do Servi&#231;o de disponibilidade.</p></li>
<li><b>O tipo de persist&#234;ncia HA &#233; <tt>replicated</tt>.</b><p>Trata-se do mecanismo de persist&#234;ncia utilizado quando a op&#231;&#227;o Servi&#231;o de disponibilidade
ativado estiver marcada. A persist&#234;ncia &#233; baseada no failover em um cluster.
N&#227;o altere este valor.</p></li>
<li><b>O tipo de persist&#234;ncia SFSB &#233; <tt>file</tt>.</b><p>Trata-se do mecanismo de persist&#234;ncia utilizado quando a op&#231;&#227;o Servi&#231;o de disponibilidade
ativado <b>n&#227;o</b> estiver marcada. A persist&#234;ncia &#233; baseada no sistema de arquivos.
N&#227;o altere este valor.</p><p>O campo Local de armazenamento da sess&#227;o determina onde os estados do
ponto de verifica&#231;&#227;o SFSB s&#227;o persistentes. Para definir o Local de armazenamento
da sess&#227;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2966&id=task-ejbgeneral">Para configurar as defini&#231;&#245;es do EJB</a>.</p></li>
<li><b>Para restaurar os valores padr&#227;o, clique no bot&#227;o Carregar padr&#245;es.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique essas propriedades.</b><p>O Servidor GlassFish n&#227;o define propriedades adicionais para a disponibilidade do recipiente
EJB.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2966&id=task-ejbgeneral">Para configurar as defini&#231;&#245;es EJB</a></p>

</li>
<li><p><a href="task-ejbmdbpoolsettings.html">Para configurar as defini&#231;&#245;es do conjunto MDB</a></p>

</li>
<li><p><a href="task-ejbtimerservice.html">Para configurar o servi&#231;o de temporizador EJB</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
