<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-configurationsystemproperties"></a><h4>Propri&#233;t&#233;s syst&#232;me</h4>
<a name="indexterm-242"></a><a name="indexterm-243"></a><p>La page Propri&#233;t&#233;s syst&#232;me affiche la liste des propri&#233;t&#233;s syst&#232;me Java d&#233;finies
pour la configuration nomm&#233;e s&#233;lectionn&#233;e. Les propri&#233;t&#233;s syst&#232;me Java sont transmises au
lanceur d'application Java par l'interm&#233;diaire de l'option <tt>-D</tt> du lanceur d'application Java
au d&#233;marrage de GlassFish Server.</p>

<p>Ces propri&#233;t&#233;s d&#233;finissent les valeurs par d&#233;faut des param&#232;tres de port pour
toutes les instances GlassFish Server faisant r&#233;f&#233;rence &#224; la configuration. </p>

<p>Pour plus d'informations sur les param&#232;tres de port pr&#233;d&#233;finis dans une ,
reportez-vous &#224; la section <a href="ref-predefinedconfigsysproperties.html">Propri&#233;t&#233;s syst&#232;me pr&#233;d&#233;finies </a>.</p>

<p>Pour chaque propri&#233;t&#233;, les informations suivantes sont affich&#233;es&#160;:</p>

<dl><dt>Nom de la variable d&#8217;instance</dt>
<dd><p>Nom de la propri&#233;t&#233; syst&#232;me.</p>

</dd>
<dt>Valeur par d&#233;faut</dt>
<dd><p>Valeur d&#233;finie pour la propri&#233;t&#233; dans la configuration nomm&#233;e &#224; laquelle l'instance fait r&#233;f&#233;rence. Ce champ est en lecture seule.</p>

</dd>
<dt>Valeurs de l&#8217;instance</dt>
<dd><p>Lien vers la page <a href="ref-sysinstancevalues.html">Valeurs de l'instance</a> pour la propri&#233;t&#233;.</p>

</dd>
</dl>
<p>Le tableau Propri&#233;t&#233;s suppl&#233;mentaires contient &#233;galement les options suivantes.</p>

<dl><dt>Ajouter une propri&#233;t&#233;</dt>
<dd><p>Bouton permettant d'ajouter une propri&#233;t&#233;. Le fait de cliquer sur ce bouton permet d'ajouter une ligne au tableau Propri&#233;t&#233;s suppl&#233;mentaires.</p>

</dd>
<dt>Supprimer des propri&#233;t&#233;s</dt>
<dd><p>Bouton permettant de supprimer une ou plusieurs propri&#233;t&#233;s s&#233;lectionn&#233;es. Toute propri&#233;t&#233; supprim&#233;e revient &#224; sa valeur par d&#233;faut ou, si aucune valeur par d&#233;faut n'est d&#233;finie, n'est pas d&#233;finie.</p>

</dd>
</dl>
<p>La page Propri&#233;t&#233;s syst&#232;me contient &#233;galement les options suivantes&#160;:</p>

<dl><dt>Nom de configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Reconfiguration dynamique</dt>
<dd><p>Si cette option est activ&#233;e, les modifications apport&#233;es &#224; la configuration sont appliqu&#233;es aux instances faisant r&#233;f&#233;rence &#224; la configuration sans n&#233;cessiter le red&#233;marrage du serveur.</p>

</dd>
<dt>Clusters et/ou instances utilisant cette configuration</dt>
<dd><p>Liste des clusters et instances faisant r&#233;f&#233;rence &#224; la configuration avec une indication de si chaque cluster ou instance est en cours d'ex&#233;cution&#160;:</p>


<ul><li><p>Si le cluster ou l'instance est en cours d'ex&#233;cution, une coche (&#10003;) s'affiche.</p>

</li>
<li><p>Si le cluster ou l'instance est arr&#234;t&#233;, un point d'exclamation (<tt>!</tt>) s'affiche.</p>

</li></ul>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p>D&#233;finir les valeurs par d&#233;faut des propri&#233;t&#233;s de configuration</p>

</li></ul>
<h5>Sous-commandes <tt>asadmin</tt> &#233;quivalentes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-system-properties-1"><tt>create-system-properties</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-system-property-1"><tt>delete-system-property</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-system-properties-1"><tt>list-system-properties</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
