<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-monitoringservice"></a><h4>Service de contr&#244;le</h4>
<a name="indexterm-242"></a><p>La page Service de contr&#244;le permet de configurer les options de contr&#244;le
pour les composants ou services des serveurs individuels.</p>

<p>Vous devez d&#233;ployer une application, un composant ou un service avant d&#8217;en
configurer le contr&#244;le.</p>

<p>La page Service de contr&#244;le contient les options suivantes&#160;:</p>

<dl><dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Service de contr&#244;le</dt>
<dd><p>Si la case Service de contr&#244;le activ&#233; est s&#233;lectionn&#233;e, la fonction de contr&#244;le est activ&#233;e pour GlassFish Server. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>MBeans de contr&#244;le</dt>
<dd><p>Si la case MBeans de contr&#244;le activ&#233;s est s&#233;lectionn&#233;e, tous les MBeans n&#233;cessaires au contr&#244;le sont d&#233;ploy&#233;s sur GlassFish Server. Cette option est activ&#233;e par d&#233;faut.</p>

<p>Si la case n&#8217;est pas coch&#233;e, vous ne pouvez pas afficher les donn&#233;es de contr&#244;le sous la Console d'administration , m&#234;me si la case Service de contr&#244;le est s&#233;lectionn&#233;e. Au lieu de cela, vous devez utiliser la ligne de commande pour afficher les donn&#233;es de contr&#244;le. Si vous d&#233;sactivez la case &#224; cocher, l&#8217;empreinte de m&#233;moire de GlassFish Server est r&#233;duite. </p>

</dd>
<dt>DTrace</dt>
<dd><p>Si la case DTrace activ&#233; est s&#233;lectionn&#233;e et si vous avez le contr&#244;le DTrace de Oracle Enterprise Manager, vous pouvez utiliser l&#8217;outil DTrace Solaris. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
</dl>
<p>Pour chaque composant disponible, les informations disponibles sont fournies.</p>

<dl><dt>Composant</dt>
<dd><p>Nom du composant du GlassFish Server.</p>

</dd>
<dt>Niveau de contr&#244;le</dt>
<dd><p>Niveau de contr&#244;le d&#233;fini pour le composant. Pour chaque composant, les niveaux disponibles sont BAS, HAUT et D&#201;SACTIV&#201;. Le niveau par d&#233;faut est OFF. Dans cette version, il n&#8217;existe aucune diff&#233;rence entre les options BAS et HAUT.</p>

</dd>
</dl>
<p>Le tableau Param&#232;tres du niveau de composant contient &#233;galement les options suivantes.</p>

<dl><dt>Modifier le niveau</dt>
<dd><p>Bouton permettant de modifier le niveau de contr&#244;le d&#8217;un ou plusieurs composants s&#233;lectionn&#233;s.</p>

</dd>
<dt>Niveau</dt>
<dd><p>Liste d&#233;roulante &#224; partir de laquelle vous pouvez s&#233;lectionner un niveau de contr&#244;le &#224; appliquer &#224; tous les composants s&#233;lectionn&#233;s.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-confmonitor.html">Configurer le contr&#244;le du service</a></p>

</li>
<li><p><a href="task-appmonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des applications</a></p>

</li>
<li><p><a href="task-servermonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des serveurs</a></p>

</li>
<li><p><a href="task-resourcemonitoringdata.html">Affichage des donn&#233;es de contr&#244;le des ressources</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=enable-monitoring-1"><tt>enable-monitoring</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=disable-monitoring-1"><tt>disable-monitoring</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=monitor-1"><tt>monitor</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
