<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-lifecyclemodules"></a><h4>Modules de cycle de vie</h4>
<a name="indexterm-187"></a><p>Utilisez la page Modules de cycle de vie pour configurer les modules
de cycle de vie.</p>

<p>Un module de cycle de vie accomplit certaines t&#226;ches lorsqu&#8217;il est d&#233;clench&#233;
par un ou plusieurs &#233;v&#233;nements dans le cycle de vie du serveur.
Les &#233;v&#233;nements de serveur qui peuvent &#234;tre d&#233;clencheurs sont : l&#8217;initialisation, le
d&#233;marrage, les requ&#234;tes pr&#234;t pour la maintenance et l&#8217;arr&#234;t. Les modules de
cycle de vie ne font pas partie de la sp&#233;cification Java EE,
mais optimisent le fonctionnement du GlassFish Server.</p>

<p>Pour chaque module de cycle de vie, les informations suivantes sont fournies.</p>

<dl><dt>Nom</dt>
<dd><p>Nom du module de cycle de vie.</p>

</dd>
<dt>Activ&#233; ou &#201;tat</dt>
<dd><p>Coche si l&#8217;application est activ&#233;e ou X si l&#8217;application est d&#233;sactiv&#233;e, si seule l'instance de serveur par d&#233;faut <tt>server</tt> existe.</p>

<p>Si des clusters ou d'autres instances de serveur autonomes existent, s&#233;lectionnez Activ&#233; sur toutes les cibles pour afficher les cibles sur lesquelles l'application est d&#233;ploy&#233;e. </p>

</dd>
<dt>Ordre de chargement</dt>
<dd><p>Valeur indiquant l&#8217;ordre relatif dans lequel le module de cycle de vie doit &#234;tre charg&#233;.</p>

</dd>
</dl>
<p>Le tableau Modules de cycle de vie contient &#233;galement les options suivantes.</p>

<dl><dt>Nouveau</dt>
<dd><p>Bouton permettant de cr&#233;er un nouveau module de cycle de vie.</p>

</dd>
<dt>Supprimer</dt>
<dd><p>Bouton permettant de supprimer un ou plusieurs modules de cycle de vie s&#233;lectionn&#233;s.</p>

</dd>
<dt>Activer</dt>
<dd><p>Bouton permettant d&#8217;activer un ou plusieurs modules de cycle de vie s&#233;lectionn&#233;s. Pr&#233;sent si seule l'instance de serveur par d&#233;faut, <tt>server</tt>, existe. </p>

</dd>
<dt>D&#233;sactiver</dt>
<dd><p>Bouton permettant de d&#233;sactiver un ou plusieurs modules de cycle de vie s&#233;lectionn&#233;s. Pr&#233;sent si seule l'instance de serveur par d&#233;faut, <tt>server</tt>, existe. </p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-lifecyclemodulenew.html">Pour cr&#233;er un module de cycle de vie</a></p>

</li>
<li><p><a href="task-lifecyclemoduleedit.html">Pour modifier un module de cycle de vie</a></p>

</li>
<li><p><a href="task-lifecyclemoduledelete.html">Pour supprimer un module de cycle de vie</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-lifecycle-module-1"><tt>create-lifecycle-module</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-lifecycle-modules-1"><tt>list-lifecycle-modules</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-lifecycle-module-1"><tt>delete-lifecycle-module</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
