<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Utilisateurs de fichiers</h4>
<a name="indexterm-215"></a><p>Utilisez la page Utilisateurs de fichiers pour g&#233;rer les utilisateurs de domaine
<tt>file</tt>. Les utilisateurs et les groupes du domaine <tt>file</tt> sont r&#233;pertori&#233;s dans le
fichier cl&#233;, dont l&#8217;emplacement est sp&#233;cifi&#233; par la propri&#233;t&#233; <tt>file</tt>.</p>

<p>Un utilisateur du domaine <tt>fichier</tt> peut appartenir &#224; un  a <b>groupe Java</b>,
c&#8217;est-&#224;-dire une cat&#233;gorie d&#8217;utilisateurs class&#233;s par caract&#233;ristiques communes. Par exemple, les clients
d&#8217;une application d&#8217;e-commerce appartiendront au groupe <tt>CUSTOMER</tt>, tandis que les plus gros
clients appartiendront au groupe <tt>PREFERRED</tt>. La classification des utilisateurs dans des groupes
facilite le contr&#244;le de l&#8217;acc&#232;s d&#8217;un grand nombre d&#8217;utilisateurs.</p>

<p>Une fois le GlassFish Server install&#233;, le seul utilisateur est l&#8217;administrateur configur&#233;
lors de l&#8217;installation. Par d&#233;faut, cet utilisateur appartient au groupe <tt>asadmin</tt>, du
domaine <tt>administrateur</tt>, qui autorise la modification du GlassFish Server. Les utilisateurs rattach&#233;s
&#224; ce groupe ont des privil&#232;ges d&#8217;administrateur, c&#8217;est-&#224;-dire qu&#8217;ils ont acc&#232;s &#224;
l&#8217;outil <tt>asadmin</tt>  et &#224; la Console d'administration .</p>

<p>La page Utilisateurs de fichiers affiche une liste des utilisateurs pour le
domaine s&#233;lectionn&#233;. Pour chaque utilisateur, les informations suivantes sont fournies&#160;:</p>

<dl><dt>ID utilisateur</dt>
<dd><p>Nom d&#8217;utilisateur.</p>

</dd>
<dt>Liste des groupes</dt>
<dd><p>Groupes auxquels l&#8217;utilisateur appartient.</p>

</dd>
</dl>
<p>Le tableau Utilisateurs de fichiers contient &#233;galement des options suivantes.</p>

<dl><dt>Nouveau</dt>
<dd><p>Bouton permettant de cr&#233;er un nouvel utilisateur.</p>

</dd>
<dt>Supprimer</dt>
<dd><p>Bouton permettant de supprimer un ou plusieurs utilisateurs s&#233;lectionn&#233;s.</p>

</dd>
</dl>
<a name="gkool"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-fileuserscreate.html">Ajout d'un utilisateur au domaine de fichiers</a></p>

</li>
<li><p><a href="task-fileusersedit.html">Modification des informations d'un utilisateur de domaine de fichiers</a></p>

</li>
<li><p><a href="task-fileusersdelete.html">Suppression d'un utilisateur du domaine de fichiers</a></p>

</li></ul>
<a name="gkonn"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-file-users-1"><tt>list-file-users</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-file-user-1"><tt>create-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=update-file-user-1"><tt>update-file-user</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-file-user-1"><tt>delete-file-user</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
