<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfig"></a><h4>Configuration de la s&#233;curit&#233; des messages</h4>
<a name="indexterm-229"></a><p>Utilisez la page Configurations de la s&#233;curit&#233; des messages pour afficher et
modifier les configurations disponibles pour les fournisseurs de s&#233;curit&#233; des messages.</p>

<p>Pour configurer la s&#233;curit&#233; des messages, vous devez comprendre les bases des
concepts de s&#233;curit&#233; et des services Web. Pour plus d'informations, reportez-vous au
<a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2435&id=ablrk">Chapitre 3, Administering Message Security du <i>Oracle GlassFish Server 3.1 Security Guide</i></a> et au <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=gbbjk">Chapitre 6, Administering Web Applications du <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>.</p>

<p>Le GlassFish Server impl&#233;mente la s&#233;curit&#233; des messages via les fournisseurs de
s&#233;curit&#233; des messages int&#233;gr&#233;s &#224; sa couche de traitement SOAP. Les fournisseurs
de s&#233;curit&#233; des messages d&#233;pendent des autres utilitaires de s&#233;curit&#233; du GlassFish
Server.</p>

<p>Pour chaque configuration, les informations suivantes sont fournies.</p>

<dl><dt>Couche d&#8217;authentification</dt>
<dd><p>Couche message &#224; laquelle l&#8217;authentification est effectu&#233;e. Par d&#233;faut, une configuration SOAP est fournie. Il est &#233;galement possible de fournir une configuration HttpServlet.</p>

</dd>
<dt>Fournisseur par d&#233;faut</dt>
<dd><p>Fournisseur de serveur par d&#233;faut pour cette configuration. Par d&#233;faut, aucun fournisseur de serveur par d&#233;faut n&#8217;est configur&#233;.</p>

</dd>
<dt>Fournisseur client par d&#233;faut</dt>
<dd><p>Fournisseur client par d&#233;faut pour cette configuration. Par d&#233;faut, aucun fournisseur client par d&#233;faut n&#8217;est configur&#233;.</p>

</dd>
</dl>
<p>Le tableau Configurations de la s&#233;curit&#233; des messages contient &#233;galement les options
suivantes.</p>

<dl><dt>Nouveau</dt>
<dd><p>Bouton permettant de cr&#233;er une configuration.</p>

</dd>
<dt>Supprimer</dt>
<dd><p>Bouton permettant de supprimer une ou plusieurs configurations s&#233;lectionn&#233;es.</p>

</dd>
</dl>
<a name="gkoky"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du GlassFish Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p>

</li></ul>
<a name="gkong"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
