<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref355" name="sthref355"></a>Param&egrave;tres du journaliseur</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Param&egrave;tres du journaliseur permet de configurer la journalisation pour l'instance ou le cluster GlassFish&nbsp;Server.</p>
<p>Elle contient les options suivantes&nbsp;:</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Ecrire dans le journal syst&egrave;me</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le r&eacute;sultat de la journalisation est envoy&eacute; &agrave; l'utilitaire <code>syslog</code> en plus du journal du serveur. Cette fonctionnalit&eacute; est disponible sur les syst&egrave;mes Solaris et Linux uniquement. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Fichier journal</dt>
<dd>
<p>Autre nom ou emplacement pour le fichier du journal du serveur. L'emplacement par d&eacute;faut est <i>domain-dir</i><code>/logs/server.log</code>.</p>
</dd>
<dt>Gestionnaire du journal</dt>
<dd>
<p>Nom de classe absolu d'un gestionnaire de journal personnalis&eacute;. Un gestionnaire de journal personnalis&eacute; permet d'envoyer des journaux vers une destination autre que <code>server.log</code> ou <code>syslog</code>. Il doit venir en extension de la classe <code>java.util.logging.Handler</code> (API compatible JSR&nbsp;047). Ajoutez la classe du gestionnaire au classpath de GlassFish&nbsp;Server de fa&ccedil;on &agrave; installer le gestionnaire au d&eacute;marrage du serveur.</p>
</dd>
<dt>Limite de rotation des fichiers</dt>
<dd>
<p>Taille en octets que le fichier journal du serveur doit atteindre avant la rotation. Lorsque le journal du serveur atteint la taille indiqu&eacute;e, GlassFish&nbsp;Server cr&eacute;e un fichier vide nomm&eacute; <code>server.log</code> et renomme l'ancien fichier <code>server.log_</code><i>date</i>, o&ugrave; <i>date</i> indique la date et l'heure de rotation du fichier. La valeur par d&eacute;faut est 2&nbsp;Mo. La valeur minimale est 500&nbsp;ko. Si vous sp&eacute;cifiez une valeur inf&eacute;rieure, le syst&egrave;me effectuera la rotation &agrave; 500&nbsp;ko. Pour d&eacute;sactiver la rotation du fichier journal, sp&eacute;cifiez la valeur&nbsp;0.</p>
</dd>
<dt>Temps limite de rotation des fichiers</dt>
<dd>
<p>Nombre de minutes au bout duquel la rotation du journal du serveur doit &ecirc;tre effectu&eacute;e. La valeur par d&eacute;faut est&nbsp;0&nbsp;; cela signifie que le syst&egrave;me effectuera la rotation lorsque le fichier aura atteint la taille sp&eacute;cifi&eacute;e dans le champ Limite de rotation des fichiers. Si vous sp&eacute;cifiez une ou plusieurs minutes, le temps limite remplace la taille limite indiqu&eacute;e par le champ Limite de rotation des fichiers.</p>
</dd>
<dt>Fr&eacute;quence de vidage</dt>
<dd>
<p>Nombre maximal de messages &agrave; &eacute;crire simultan&eacute;ment depuis la file d'attente sur le journal du serveur. La valeur par d&eacute;faut est&nbsp;1.</p>
</dd>
</dl>
<a id="sthref356" name="sthref356"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configurer les param&egrave;tres g&eacute;n&eacute;raux de journalisation</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Afficher les fichiers journaux du serveur DAS</a></p>
</li>
</ul>
<a id="sthref357" name="sthref357"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
