<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-concepts"></a><h4>Concepts-cl&#233;s de Outil de mise &#224; jour</h4>
<a name="indexterm-253"></a><p>Outil de mise &#224; jour g&#232;re les installations des composants du logiciel
GlassFish Server contenus dans un seul r&#233;pertoire syst&#232;me de fichiers.</p>

<p>La version Console d'administration  de Outil de mise &#224; jour vous
permet d&#8217;effectuer les op&#233;rations suivantes&#160;:</p>


<ul><li><p>Installer des composants add-on</p>

</li>
<li><p>Afficher des mises &#224; jour pour les composants install&#233;s</p>

</li>
<li><p>Afficher les composants install&#233;s</p>

</li></ul>
<p>Pour mettre &#224; jour ou supprimer des composants install&#233;s, arr&#234;tez le domaine
de GlassFish Server, puis utilisez l&#8217;une des commandes suivantes&#160;:</p>


<ul><li><p><tt><i>as-install-parent</i>/bin/updatetool</tt>, qui d&#233;marre l&#8217;utilitaire graphique de l&#8217;outil de mise &#224; jour</p>

</li>
<li><p><tt><i>as-install-parent</i>/bin/pkg</tt>, version ligne de commande de l&#8217;outil de mise &#224; jour</p>

</li></ul>
<p>Les concepts-cl&#233;s de Outil de mise &#224; jour sont d&#233;crits dans les
sections suivantes.</p>

<a name="ref-uc-about-component"></a><h5>Composant</h5>
<p>Un <b>composant</b> correspond &#224; l&#8217;unit&#233; installable que g&#232;re Outil de mise &#224;
jour. Un composant regroupe des fichiers qui sont install&#233;s ensemble dans votre
syst&#232;me dans une image d&#8217;installation.</p>

<a name="ref-uc-about-image"></a><h5>Image d&#8217;installation</h5>
<p>Une <b>image d&#8217;installation</b> correspond au r&#233;pertoire contenant les composants du logiciel, y compris
le contenu du r&#233;pertoire. L&#8217;image d&#8217;installation est ajout&#233;e &#224; Outil de mise
&#224; jour suite au t&#233;l&#233;chargement et &#224; l&#8217;installation du logiciel GlassFish Server.
Pour vous aider &#224; ajouter et mettre &#224; jour les composants du
logiciel GlassFish Server, chaque image d&#8217;installation contient des informations sur l&#8217;installation des
composants.</p>

<a name="ref-uc-about-repository"></a><h5>R&#233;f&#233;rentiel r&#233;seau</h5>
<p>Un <b>r&#233;f&#233;rentiel r&#233;seau</b> contient les &#233;l&#233;ments suivants :</p>


<ul><li><p>Composants pouvant &#234;tre ajout&#233;s &#224; une image d&#8217;installation</p>

</li>
<li><p>Mises &#224; jour de composants existants dans une image d&#8217;installation</p>

</li></ul>
<p>Une image d&#8217;installation est associ&#233;e &#224; un ou plusieurs r&#233;f&#233;rentiels r&#233;seaux. Chaque
r&#233;f&#233;rentiel r&#233;seau est d&#233;sign&#233; par un nom et une URL. Un nom
de r&#233;f&#233;rentiel est propre &#224; chaque image d&#8217;installation et  repr&#233;sente &#224;
la fois l&#8217;organisation ou le projet qui g&#232;re le r&#233;f&#233;rentiel et le
p&#233;rim&#232;tre bien d&#233;fini du contenu. Pour en savoir plus sur les r&#233;f&#233;rentiels
r&#233;seau pr&#233;configur&#233;s pour GlassFish Server, reportez-vous &#224; <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=gjzko">Preconfigured Repositories for GlassFish Server du <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>. </p>

<a name="ref-uc-about-addon"></a><h5>Composant add-on</h5>
<p>Un <b>composant add-on</b> est un composant de l&#8217;image d&#8217;installation qui n&#8217;est pas encore
install&#233;.</p>



<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
