<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityproviderconfigprops"></a><h4>Propri&#233;t&#233;s propres aux configurations de fournisseur de s&#233;curit&#233; des messages</h4>
<a name="indexterm-234"></a><a name="indexterm-235"></a><p>Les propri&#233;t&#233;s suivantes sont disponibles pour la configuration d&#8217;un fournisseur de s&#233;curit&#233;
des messages.</p>

<dl><dt><tt>server.config</tt></dt>
<dd><p>R&#233;pertoire et nom de fichier d&#8217;un fichier XML qui contient les informations de configuration du serveur. La valeur par d&#233;faut est <i>domain-dir</i><tt>/config/wss-server-config-1.0.xml </tt>.</p>

</dd>
<dt><tt>d&#233;bogage</tt></dt>
<dd><p>La valeur <tt>true</tt> active le vidage des messages de d&#233;bogage du fournisseur du serveur vers le journal du serveur. La valeur par d&#233;faut est <tt>false</tt>.</p>

</dd>
<dt><tt>dynamic.username.password</tt></dt>
<dd><p>La valeur <tt>true</tt> signale au fournisseur l&#8217;ex&#233;cution de collecte du nom d&#8217;utilisateur et du mot de passe par le <tt>Gestionnaire de rappels</tt> pour chaque requ&#234;te. Si la valeur est false, le nom d&#8217;utilisateur et le mot de passe de <tt>wsse:UsernameToken(s) </tt> sont recueillis une fois, lors de l&#8217;initialisation du module. Cette propri&#233;t&#233; s&#8217;applique uniquement &#224; un module d&#8217;authentification client <tt>ClientAuthModule</tt>. La valeur par d&#233;faut est <tt>false</tt>.</p>

</dd>
<dt><tt>encryption.key.alias</tt></dt>
<dd><p>Sp&#233;cifie la cl&#233; de chiffrement utilis&#233;e par le fournisseur. La cl&#233; est identifi&#233;e par son alias de <tt>keystore</tt>. La valeur par d&#233;faut est <tt>s1as</tt>.</p>

</dd>
<dt><tt>signature.key.alias</tt></dt>
<dd><p>Sp&#233;cifie la cl&#233; de signature utilis&#233;e par le fournisseur. La cl&#233; est identifi&#233;e par son alias de <tt>keystore</tt>. La valeur par d&#233;faut est <tt>s1as</tt>.</p>

</dd>
</dl>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
