<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmpathsettings"></a><h4>Param&#232;tres du chemin JVM</h4>
<a name="indexterm-191"></a><p>Utilisez la page Param&#232;tres du chemin JVM pour configurer le chemin d&#8217;acc&#232;s
&#224; la biblioth&#232;que native. Le chemin de la biblioth&#232;que native est une concat&#233;nation
des chemins suivants :</p>


<ul><li><p>Pr&#233;fixe du chemin d&#8217;acc&#232;s &#224; la biblioth&#232;que native</p>

</li>
<li><p>Chemin d&#8217;acc&#232;s du serveur &#224; ses biblioth&#232;ques natives (c&#8217;est-&#224;-dire, <tt></tt><i>as-install</i><tt>/lib</tt>)</p>

</li>
<li><p>R&#233;pertoires de biblioth&#232;que native 64&#160;bits, le cas &#233;ch&#233;ant</p>

</li>
<li><p>Valeur de la variable <tt>java.library.path</tt> pour la JVM utilis&#233;e pour d&#233;marrer GlassFish Server (ceci diff&#232;re selon les syst&#232;mes d&#8217;exploitation)</p>

</li>
<li><p>Tous les chemins sp&#233;cifi&#233;s sur la page <a href="ref-serverinstjvmprofiler.html">Param&#232;tres du profileur JVM</a>, si le profileur est activ&#233;</p>

</li>
<li><p>Suffixe du chemin d&#8217;acc&#232;s &#224; la biblioth&#232;que native</p>

</li></ul>
<p>D&#8217;autres param&#232;tres sont affich&#233;s comme des valeurs en lecture seule pour les
domaines qui ont &#233;t&#233; mis &#224; niveau &#224; partir d&#8217;une version pr&#233;c&#233;dente de
GlassFish Server. Ils ne sont pas pris en charge dans la version v3.</p>

<p>La page Param&#232;tres du chemin JVM contient les options suivantes.</p>

<dl><dt>Nom de configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Classpath de l&#8217;environnement</dt>
<dd><p>Si la case &#224; cocher Ignorer est activ&#233;e, la variable d&#8217;environnement <tt>CLASSPATH</tt> est ignor&#233;e. La variable d&#8217;environnement <tt>CLASSPATH</tt> est utile pour les didacticiels de base relatifs &#224; la programmation, mais d&#233;conseill&#233;e pour les environnements d&#8217;entreprise. Ce champ est en lecture seule.</p>

</dd>
<dt>Classpath du syst&#232;me</dt>
<dd><p>Chemin des classes sur votre syst&#232;me. Ce champ est en lecture seule. </p>

</dd>
<dt>Pr&#233;fixe du chemin de classe</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter au d&#233;but du classpath du serveur, un par ligne. Ce champ est en lecture seule.</p>

</dd>
<dt>Suffixe du chemin de classe</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter &#224; la fin du classpath du serveur, un par ligne. Ce champ est en lecture seule.</p>

</dd>
<dt>Pr&#233;fixe du chemin de biblioth&#232;que native</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter au pr&#233;fixe du chemin de biblioth&#232;que native, un par ligne.</p>

</dd>
<dt>Suffixe du chemin de biblioth&#232;que native</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter au chemin de biblioth&#232;que native, un par ligne.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jvmsettings.html">Configurer les param&#232;tres g&#233;n&#233;raux du profileur JVM</a></p>

</li>
<li><p><a href="task-jvmpathsettings.html">Configurer les param&#232;tres du chemin d'acc&#232;s &#224; la JVM </a></p>

</li>
<li><p><a href="task-jvmoptions.html">Configurer les options JVM</a></p>

</li>
<li><p><a href="task-securitymanagerdisable.html">D&#233;sactiver le gestionnaire de s&#233;curit&#233;</a></p>

</li>
<li><p><a href="task-jvmprofilersettings.html">Configurer les param&#232;tres du profileur JVM </a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jvm-options-1"><tt>create-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jvm-options-1"><tt>delete-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jvm-options-1"><tt>list-jvm-options</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-profiler-1"><tt>create-profiler</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-profiler-1"><tt>delete-profiler</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
