<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectoredit" name="ref-jmxconnectoredit"></a><a id="GHCOM00127" name="GHCOM00127"></a></p>

<h4><a id="sthref442" name="sthref442"></a>Modifier le connecteur&nbsp;JMX</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier le connecteur&nbsp;JMX permet de modifier le connecteur&nbsp;JMX conforme &agrave;&nbsp;JSR 360.</p>
<p>Elle contient les options suivantes&nbsp;:</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Nom</dt>
<dd>
<p>Nom du connecteur JMX. Ce champ est en lecture seule.</p>
</dd>
<dt>Protocole JMX</dt>
<dd>
<p>Nom du protocole que ce connecteur&nbsp;JMX prend en charge. Ce champ est en lecture seule.</p>
</dd>
<dt>JMXServiceURL</dt>
<dd>
<p>URL du service JMX. Ce champ est en lecture seule.</p>
</dd>
<dt>S&eacute;curit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la communication&nbsp;JMX est crypt&eacute;e. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Adresse</dt>
<dd>
<p>Adresse&nbsp;IP du service de d&eacute;nomination aupr&egrave;s duquel le stub de serveurs de connecteurs&nbsp;JMX est inscrit. Ce n'est pas le port du socket de serveur qui effectue la v&eacute;ritable communication&nbsp;JMX. C'est l'adresse de l'interface r&eacute;seau depuis laquelle le registre&nbsp;RMI est d&eacute;marr&eacute;. Si votre syst&egrave;me est dot&eacute; de plusieurs interfaces r&eacute;seau, modifiez cette valeur afin de s&eacute;lectionner une seule interface. La valeur par d&eacute;faut est <code>0.0.0.0</code>.</p>
</dd>
<dt>Port</dt>
<dd>
<p>Num&eacute;ro du port sur lequel le service de d&eacute;nomination (registre&nbsp;RMI) &eacute;coute les connexions client&nbsp;RMI. La seule fonction de ce service de d&eacute;nomination consiste &agrave; t&eacute;l&eacute;charger les stubs&nbsp;RMI. Si le port par d&eacute;faut est occup&eacute;, un port libre est utilis&eacute; &agrave; la place. Les valeurs valides vont de&nbsp;1 &agrave;&nbsp;65535. Sous les syst&egrave;mes UNIX, la cr&eacute;ation de sockets qui &eacute;coutent sur les ports&nbsp;1 &agrave;&nbsp;1024 n&eacute;cessite des privil&egrave;ges de superutilisateur. La valeur par d&eacute;faut est 8686.</p>
</dd>
<dt>Nom de domaine</dt>
<dd>
<p>Nom qui repr&eacute;sente le domaine administratif sp&eacute;cial. Toutes les authentifications sont g&eacute;r&eacute;es par ce domaine. La valeur par d&eacute;faut est <code>admin-realm</code> .</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Autres propri&eacute;t&eacute;s du connecteur&nbsp;JMX. Plusieurs propri&eacute;t&eacute;s sont indiqu&eacute;es par d&eacute;faut.</p>
</dd>
</dl>
<a id="sthref443" name="sthref443"></a>
<h5>T&acirc;che connexe</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">Modifier le connecteur&nbsp;JMX</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">Modifier les param&egrave;tres&nbsp;SSL pour le connecteur&nbsp;JMX</a></p>
</li>
</ul>
<a id="sthref444" name="sthref444"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
