<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-registrationpage"></a><h4>Enregistrement du produit</h4>
<a name="indexterm-131"></a><p>Pour enregistrer votre installation de Oracle GlassFish Server, vous devez poss&#233;der un <a href="https://reg.sun.com/whyregister">compte Sun en ligne</a>.
Si vous n&#8217;avez pas encore de compte en ligne Sun, GlassFish Server
vous permet d&#8217;en cr&#233;er un lors de l&#8217;enregistrement.</p>

<p>La page Enregistrement du produit contient les options suivantes&#160;:</p>

<dl><dt>J&#8217;ai d&#233;j&#224; un compte en ligne Sun ou un compte SDN (Sun Developer Network)</dt>
<dd><p>S&#233;lectionnez cette option si vous poss&#233;dez d&#233;j&#224; un compte. Si vous s&#233;lectionnez cette option, les champs suivants sont visibles.</p>

<dl><dt>Nom de l&#8217;utilisateur</dt>
<dd><p>Nom d&#8217;utilisateur que vous avez sp&#233;cifi&#233; lors de l&#8217;enregistrement de votre compte en ligne Sun.</p>

</dd>
<dt>Mot de passe</dt>
<dd><p>Mot de passe que vous avez sp&#233;cifi&#233; lors de l&#8217;enregistrement de votre compte en ligne Sun.</p>

</dd>
<dt>H&#244;te proxy</dt>
<dd><p>Nom d&#8217;h&#244;te du serveur proxy de l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute.</p>

<p>Ce champ est applicable uniquement si l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute se connecte &#224; Internet par l&#8217;interm&#233;diaire d&#8217;un serveur proxy.</p>

</dd>
<dt>Port proxy</dt>
<dd><p>Num&#233;ro de port du serveur proxy de l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute.</p>

<p>Ce champ est applicable uniquement si l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute se connecte &#224; Internet par l&#8217;interm&#233;diaire d&#8217;un serveur proxy.</p>

</dd>
</dl>
</dd>
<dt>Je n&#8217;ai pas de compte en ligne Sun. M&#8217;inscrire.</dt>
<dd><p>S&#233;lectionnez cette option si vous n&#8217;avez pas de compte et si vous voulez enregistrer votre installation de GlassFish Server. Si vous s&#233;lectionnez cette option, les champs suivants sont visibles.</p>

<dl><dt>Adresse e-mail</dt>
<dd><p>Cette derni&#232;re sera le nom d&#8217;utilisateur de votre compte en ligne Sun.</p>

</dd>
<dt>Mot de passe</dt>
<dd><p>Mot de passe &#224; utiliser pour votre compte en ligne Sun. Celui-ci est sensible &#224; la casse et doit comporter entre 6 et 10 caract&#232;res.</p>

</dd>
<dt>Ressaisir le mot de passe</dt>
<dd><p>Vous devez ressaisir le mot de passe sp&#233;cifi&#233; dans le champ Mot de passe.</p>

</dd>
<dt>Pr&#233;nom</dt>
<dd><p>Votre pr&#233;nom.</p>

</dd>
<dt>Nom</dt>
<dd><p>Votre nom.</p>

</dd>
<dt>Soci&#233;t&#233;</dt>
<dd><p>Soci&#233;t&#233; pour laquelle vous travaillez, le cas &#233;ch&#233;ant.</p>

</dd>
<dt>Pays/Territoire</dt>
<dd><p>Votre pays ou territoire de r&#233;sidence.</p>

</dd>
<dt>H&#244;te proxy</dt>
<dd><p>Nom d&#8217;h&#244;te du serveur proxy de l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute.</p>

<p>Ce champ est applicable uniquement si l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute se connecte &#224; Internet par l&#8217;interm&#233;diaire d&#8217;un serveur proxy.</p>

</dd>
<dt>Port proxy</dt>
<dd><p>Num&#233;ro de port du serveur proxy de l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute.</p>

<p>Ce champ est applicable uniquement si l&#8217;ordinateur sur lequel GlassFish Server s&#8217;ex&#233;cute se connecte &#224; Internet par l&#8217;interm&#233;diaire d&#8217;un serveur proxy.</p>

</dd>
</dl>
</dd>
</dl>
<h5>T&#226;che connexe</h5>

<ul><li><p><a href="task-register.html">Enregistrement d'Oracle GlassFish Server</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
