<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-update"></a><h4>Mises &#224; jour disponibles</h4>
<a name="indexterm-256"></a><p>La page Mises &#224; jour disponibles contient des informations sur les derni&#232;res
versions des <a href="ref-uc-concepts.html#ref-uc-about-component">composants</a> de l&#8217;<a href="ref-uc-concepts.html#ref-uc-about-repository">image d&#8217;installation</a> d&#233;j&#224; install&#233;s.</p>

<p>Pour installer les mises &#224; jour disponibles, commencez par le domaine GlassFish
Server. Utilisez ensuite l&#8217;une des commandes suivantes&#160;:</p>


<ul><li><p><tt>glassfish3/bin/updatetool</tt>, qui d&#233;marre l&#8217;utilitaire graphique de l&#8217;outil de mise &#224; jour</p>

</li>
<li><p><tt>glassfish3/bin/pkg</tt>, version ligne de commande de l&#8217;outil de mise &#224; jour </p>

</li></ul>
<p>Pour de plus amples informations sur l'utilisation de la commande <tt>pkg</tt>, reportez-vous
au <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=ghapp">Chapitre 11, Extending and Updating GlassFish Server du <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>. L&#8217;utilitaire Outil de mise &#224; jour poss&#232;de sa propre aide
en ligne.</p>

<p>Red&#233;marrez le serveur apr&#232;s avoir termin&#233; l&#8217;installation des mises &#224; jour.</p>

<p>La page Mises &#224; jour disponibles contient les options suivantes&#160;:</p>

<dl><dt>Chemin d&#8217;installation</dt>
<dd><p>Chemin du syst&#232;me de fichiers du r&#233;pertoire root ou du r&#233;pertoire sup&#233;rieur de l&#8217;image d&#8217;installation.</p>

</dd>
<dt>Available Updates</dt>
<dd><p>Pour chaque composant pour lequel une version plus r&#233;cente est disponible, le tableau fournit les informations suivantes.</p>

<dl><dt>Composant</dt>
<dd><p>Nom du composant.</p>

</dd>
<dt>Cat&#233;gorie</dt>
<dd><p>Cat&#233;gorie du logiciel &#224; laquelle le composant est associ&#233;, comme par exemple serveurs d&#8217;application, outils syst&#232;me et bases de donn&#233;es. La cat&#233;gorie est affect&#233;e au composant par le fabricant du composant au moment de sa cr&#233;ation.</p>

</dd>
<dt>Version install&#233;e</dt>
<dd><p>Num&#233;ro de version du package dans lequel le composant actuel est fourni.</p>

</dd>
<dt>Nouvelle version</dt>
<dd><p>Num&#233;ro de version de la mise &#224; jour disponible.</p>

</dd>
<dt>Modifier</dt>
<dd><p>Diff&#233;rence de taille entre la version install&#233;e et la mise &#224; jour disponible.</p>

</dd>
<dt>Source</dt>
<dd><p>Nom du <a href="ref-uc-concepts.html#ref-uc-about-repository">R&#233;f&#233;rentiel r&#233;seau</a> &#224; partir duquel le composant peut &#234;tre obtenu.</p>

</dd>
</dl>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>
<p><a href="task-uc-update.html">Affichage des mises &#224; jour disponibles pour les composants</a></p>

<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
