<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-predefinedconfigsysproperties"></a><h4>Propri&#233;t&#233;s syst&#232;me pr&#233;d&#233;finies </h4>
<p>GlassFish Server d&#233;finit les propri&#233;t&#233;s syst&#232;me de configuration suivantes&#160;:</p>

<dl><dt><tt>ASADMIN_LISTENER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro de port du port HTTP ou HTTPS pour l'administration. Ce port est le port de l'URL que vous sp&#233;cifiez dans votre navigateur Web pour g&#233;rer l'instance, <tt>http://localhost:4949 </tt>, par exemple. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>HTTP_LISTENER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour l'&#233;coute des requ&#234;tes HTTP. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>HTTP_SSL_LISTENER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour l'&#233;coute des requ&#234;tes HTTPS. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>IIOP_LISTENER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour les connexions IIOP. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>IIOP_SSL_LISTENER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour les connexions IIOP s&#233;curis&#233;es. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>IIOP_SSL_MUTUALAUTH_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour les connexions IIOP s&#233;curis&#233;es avec l'authentification client. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>JAVA_DEBUGGER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour les connexions au d&#233;bogueur <a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/"> Java Platform Debugger Architecture (JPDA)</a>. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>JMS_PROVIDER_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro de port pour le fournisseur Java Message Service. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>JMX_SYSTEM_CONNECTOR_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port d'&#233;coute du connecteur JMX. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
<dt><tt>OSGI_SHELL_TELNET_PORT</tt></dt>
<dd><p>Cette propri&#233;t&#233; sp&#233;cifie le num&#233;ro du port utilis&#233; pour les connexions &#224; <a href="http://felix.apache.org/site/apache-felix-remote-shell.html">Apache Felix Remote Shell</a>. Ce shell utilise le service de shell Felix pour interagir avec le sous-syst&#232;me de gestion du module OSGi. Les valeurs valides sont comprises entre 1 et 65535. Sous UNIX, la cr&#233;ation des sockets &#233;coutant sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur.</p>

</dd>
</dl>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
