<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-enablemesec4appclients" name="task-enablemesec4appclients"></a><a id="GHCOM00210" name="GHCOM00210"></a></p>

<h4><a id="sthref197" name="sthref197"></a>Activer la s&eacute;curit&eacute; des messages pour les clients d'application</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les fournisseurs client doivent avoir les m&ecirc;mes r&egrave;gles de protection des messages que les fournisseurs c&ocirc;t&eacute; serveur avec lesquels ils interagissent. C'est d&eacute;j&agrave; le cas des fournisseurs configur&eacute;s (mais non activ&eacute;s) lors de l'installation de GlassFish&nbsp;Server.</p>
<p>Pour activer la s&eacute;curit&eacute; des messages sur les clients d'application, modifiez la configuration de GlassFish&nbsp;Server pour le conteneur du client d'application.</p>
<ol>
<li>
<p>Arr&ecirc;tez les applications client qui d&eacute;pendent du descripteur du conteneur du client.</p>
</li>
<li>
<p>Dans un &eacute;diteur de texte, ouvrez le descripteur du conteneur du client d'application Sun, qui se trouve dans <i>domain-dir</i><code>/config/sun-acc.xml.</code></p>
</li>
<li>
<p>Pour activer le fournisseur client par d&eacute;faut dans le client d'application, ajoutez l'attribut <code>default-client-provider</code> &agrave; l'&eacute;l&eacute;ment <code>message-security-config</code>.</p>
<p>Le code environnant est donn&eacute; comme contexte et peut &ecirc;tre l&eacute;g&egrave;rement diff&eacute;rent dans votre installation. Ne le changez pas.</p>
<pre>
&lt;client-container&gt;
  &lt;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"/&gt;
  &lt;log-service file="" level="WARNING"/&gt;
  &lt;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>&gt;
    &lt;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="clientprovider" provider-type="client"&gt;
      &lt;request-policy auth-source="sender"/&gt;
      &lt;response-policy/&gt;
        &lt;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"/&gt;
    &lt;/provider-config&gt;
  &lt;/message-security-config&gt;
&lt;/client-container&gt;
</pre>
<p>Le fournisseur de s&eacute;curit&eacute; des messages configur&eacute; dans le conteneur du client doit avoir acc&egrave;s aux cl&eacute;s priv&eacute;es et aux certificats s&eacute;curis&eacute;s. Pour permettre l'acc&egrave;s, d&eacute;finissez les valeurs des propri&eacute;t&eacute;s syst&egrave;mes suivantes dans le script de d&eacute;marrage du client d'application&nbsp;:</p>
<pre>
-Djavax.net.ssl.keyStore

-Djavax.net.ssl.trustStore
</pre></li>
</ol>
<a id="sthref198" name="sthref198"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurer les utilitaires GlassFish&nbsp;Server pour qu'ils puissent &ecirc;tre utilis&eacute;s par les fournisseurs de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;er une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modifier une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Supprimer une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;er une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modifier une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Supprimer une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
