<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appredeploy" name="task-appredeploy"></a><a id="GHCOM00167" name="GHCOM00167"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a>Red&eacute;ployer une application d&eacute;ploy&eacute;e</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le red&eacute;ploiement d'une application consiste &agrave; d&eacute;ployer une nouvelle version de l'application tout en conservant les param&egrave;tres et les options avec lesquels l'application a &eacute;t&eacute; d&eacute;ploy&eacute;e initialement.</p>
<a id="sthref97" name="sthref97"></a>
<h5>Avant de commencer</h5>
<p>Assurez-vous que l'application &agrave; red&eacute;ployer est d&eacute;j&agrave; d&eacute;ploy&eacute;e.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Applications.</p>
<p>La page Applications appara&icirc;t.</p>
</li>
<li>
<p>Dans la table Applications d&eacute;ploy&eacute;es, cliquez sur Red&eacute;ployer sur la ligne de l'application &agrave; red&eacute;ployer.</p>
<p>Le nom de l'application peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; "<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i>" dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>La page Red&eacute;ployer des applications ou des modules appara&icirc;t.</p>
</li>
<li>
<p>Sp&eacute;cifiez l'emplacement de l'application &agrave; red&eacute;ployer.</p>
<ul>
<li>
<p>Si l'application est un fichier d'archive stock&eacute; sur l'ordinateur client ou accessible depuis ce dernier, s&eacute;lectionnez l'option Fichier packag&eacute; &agrave; t&eacute;l&eacute;charger sur le serveur.</p>
<p>L'ordinateur client est l'h&ocirc;te sur lequel vous visualisez la Console d'administration via un navigateur.</p>
<p>Cliquez sur Parcourir pour acc&eacute;der au fichier ou tapez le chemin d'acc&egrave;s complet.</p>
</li>
<li>
<p>Si l'application est un fichier d'archive stock&eacute; sur l'ordinateur du serveur ou une application non packag&eacute;e situ&eacute;e dans un r&eacute;pertoire &eacute;clat&eacute;, s&eacute;lectionnez l'option R&eacute;pertoire ou fichier packag&eacute; local accessible &agrave; partir de GlassFish&nbsp;Server.</p>
<p>L'ordinateur du serveur est l'h&ocirc;te qui ex&eacute;cute le serveur d'administration du domaine (DAS).</p>
<p>Cliquez sur Parcourir les fichiers pour acc&eacute;der &agrave; un fichier ou sur Parcourir les dossiers pour acc&eacute;der &agrave; un r&eacute;pertoire. Vous pouvez &eacute;galement saisir le chemin d'acc&egrave;s complet au fichier ou au r&eacute;pertoire. Le d&eacute;ploiement &agrave; partir d'un r&eacute;pertoire &eacute;clat&eacute; est r&eacute;serv&eacute; aux d&eacute;veloppeurs exp&eacute;riment&eacute;s et est d&eacute;conseill&eacute; dans les environnements de production.</p>
</li>
</ul>
</li>
<li>
<p>Cochez la case Disponibilit&eacute; activ&eacute;e afin d'activer la persistance de session et les points de contr&ocirc;le&nbsp;SFSB pour l'application.</p>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation des points de contr&ocirc;le et, &eacute;ventuellement, la mise en mode passif des sessions&nbsp;Web et des beans Session avec conservation de statut (SFSB). Si cette valeur est False (valeur par d&eacute;faut) tous les enregistrements de session&nbsp;Web et la r&eacute;alisation des points de contr&ocirc;le&nbsp;SFSB sont d&eacute;sactiv&eacute;s pour l'application sp&eacute;cifi&eacute;e. Si cette valeur est True, l'application sp&eacute;cifi&eacute;e est activ&eacute;e pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux du serveur et du conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</li>
<li>
<p>Cochez la case Pr&eacute;compiler les JSP pour compiler au pr&eacute;alable les fichiers&nbsp;JSP (JavaServer Pages).</p>
<p>Si cette option est d&eacute;sactiv&eacute;e, les fichiers&nbsp;JSP sont compil&eacute;s au moment de l'ex&eacute;cution, lors de leur premier acc&egrave;s. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Ex&eacute;cuter le v&eacute;rificateur pour v&eacute;rifier les descripteurs de d&eacute;ploiement avant le red&eacute;ploiement.</p>
<p>Si cette option est s&eacute;lectionn&eacute;e et que la v&eacute;rification &eacute;choue, le red&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour&nbsp;; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</li>
<li>
<p>Cochez la case Java Web Start pour activer l'acc&egrave;s &agrave; Java Web Start d'un module de client d'application.</p>
<p>Cette option est activ&eacute;e ou d&eacute;sactiv&eacute;e par d&eacute;faut en fonction de son param&egrave;tre lors du d&eacute;ploiement initial de l'application.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Conserver l'&eacute;tat pour conserver les sessions&nbsp;Web, les instances&nbsp;SFSB et les horloges&nbsp;EJB cr&eacute;&eacute;es de fa&ccedil;on persistante entre les red&eacute;ploiements.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Elle n'est prise en charge que sur l'instance de serveur par d&eacute;faut, appel&eacute;e <code>server</code>. Elle n'est pas prise en charge et est ignor&eacute;e pour toute autre cible.</p>
<p>Certaines modifications apport&eacute;es &agrave; une application entre des red&eacute;ploiements emp&ecirc;chent cette option de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance dans la classe de bean&nbsp;SFSB.</p>
<p>Pour les applications&nbsp;Web, cette fonctionnalit&eacute; n'est applicable que si, dans le fichier <code>glassfish-web-app.xml</code>, l'attribut <code>persistence-type</code> de l'&eacute;l&eacute;ment <code>session-manager</code> est <code>file</code>.</p>
<p>Pour les instances&nbsp;SFSB, le type de persistance sans haute disponibilit&eacute; est d&eacute;fini dans le serveur (option Type de persistance SFSB) et doit &ecirc;tre d&eacute;fini sur <code>file</code>, qui est la valeur par d&eacute;faut recommand&eacute;e.</p>
<p>Si la conservation ou la restauration d'une session&nbsp;Web, d'une instance&nbsp;SFSB ou d'une horloge&nbsp;EJB active &eacute;choue, <i>aucune</i> d'entre elles ne sera disponible une fois le red&eacute;ploiement termin&eacute;. Toutefois, le red&eacute;ploiement se poursuit et un avertissement est consign&eacute;.</p>
<p>Pour conserver les donn&eacute;es d'&eacute;tat actives, GlassFish&nbsp;Server s&eacute;rialise les donn&eacute;es et les enregistre dans la m&eacute;moire. Pour restaurer les donn&eacute;es, le chargeur de classe de l'application qui vient d'&ecirc;tre red&eacute;ploy&eacute;e d&eacute;s&eacute;rialise les donn&eacute;es pr&eacute;c&eacute;demment enregistr&eacute;es.</p>
</li>
<li>
<p>Cochez la case Conserver les ressources de niveau application pour conserver des ressources de niveau application et les restaurer pendant le red&eacute;ploiement.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref98" name="sthref98"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Afficher la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ployer une application&nbsp;Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ployer une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ployer un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ployer un module connecteur</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">D&eacute;ployer un fichier JAR&nbsp;EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Modifier une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Afficher les descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Afficher les cibles de l'application</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Afficher les informations relatives aux adresses d'un service&nbsp;Web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancer une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancer un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;charger des stubs de client d'application</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Recharger une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesview.html">Afficher les ressources de niveau application</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesedit.html">Modifier les ressources de niveau application</a></p>
</li>
<li>
<p><a href="../../../ejb/fr/help/missingtopic.html">Configurer les param&egrave;tres de disponibilit&eacute; du conteneur&nbsp;EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
