<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-systemproperties"></a><h4>Pour g&#233;rer les propri&#233;t&#233;s syst&#232;me</h4><a name="indexterm-16"></a><a name="indexterm-17"></a><a name="indexterm-18"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud GlassFish Server.</b><p>La page Informations g&#233;n&#233;rales s&#8217;affiche.</p></li>
<li><b>Sur la page Informations g&#233;n&#233;rales, cliquez sur l&#8217;onglet Propri&#233;t&#233;s syst&#232;me.</b><p>La page Propri&#233;t&#233;s syst&#232;me s&#8217;affiche.</p></li>
<li><b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s syst&#232;me pour la
configuration.</b><p>Un certain nombre de propri&#233;t&#233;s syst&#232;me sont pr&#233;d&#233;finies mais ne sont pas
indiqu&#233;es sur cette page. Pour en savoir plus, reportez-vous &#224; la section
<a href="ref-preconfiguredprops.html">Propri&#233;t&#233;s syst&#232;me pr&#233;d&#233;finies</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-generaltab.html">Afficher des informations g&#233;n&#233;rales sur le DAS</a></p>

</li>
<li><p><a href="task-logviewer.html">Afficher les journaux du DAS </a></p>

</li>
<li><p><a href="task-filter-logs.html">Filtrer les enregistrements de journal affich&#233;s</a></p>

</li>
<li><p><a href="task-setadvanceappconfig.html">D&#233;finir la configuration des applications</a></p>

</li>
<li><p><a href="task-setadvancedomainattributes.html">D&#233;finir les attributs du domaine</a></p>

</li>
<li><p><a href="task-setadminpassword.html">Pour changer le mot de passe administrateur</a></p>

</li>
<li><p><a href="task-appmonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des applications</a></p>

</li>
<li><p><a href="task-servermonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des serveurs</a></p>

</li>
<li><p><a href="task-resourcemonitoringdata.html">Affichage des donn&#233;es de contr&#244;le des ressources</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
