<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-set-proxy"></a><h4>Configurer les param&#232;tres proxy de r&#233;seau pour acc&#233;der aux r&#233;f&#233;rentiels de r&#233;seau</h4><a name="indexterm-125"></a><a name="indexterm-126"></a><a name="indexterm-127"></a><p>Les param&#232;tres proxy de r&#233;seau permettent de d&#233;terminer le mode de connexion
de GlassFish Server &#224; Internet. Pour permettre au Outil de mise &#224;
jour d&#8217;acc&#233;der aux <a href="ref-uc-concepts.html#ref-uc-about-repository">r&#233;f&#233;rentiels de r&#233;seau</a> via l&#8217;Internet, configurez vos param&#232;tres proxy de r&#233;seau.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Outil de mise &#224; jour.</b><p>La page Add-ons disponibles s&#8217;affiche.</p></li>
<li><b>Sur la page Add-ons disponibles, cliquez sur l&#8217;onglet Configuration.</b><p>La page Configuration Outil de mise &#224; jour s&#8217;affiche.</p></li>
<li><b>Sur la page Configuration de l'Outil de mise &#224; jour, indiquez  le
mode de connexion &#224; l&#8217;Internet de la machine sur laquelle GlassFish Server
fonctionne.</b><ul>
<li><b>Si la machine se connecte directement &#224; l&#8217;Internet, s&#233;lectionnez l&#8217;option Connexion directe.</b></li>
<li><b>Si la machine se connecte &#224; l&#8217;Internet via un proxy, s&#233;lectionnez l&#8217;option
Via un proxy.</b></li></ul></li>
<li><b>Si la machine sur laquelle s&#8217;ex&#233;cute le GlassFish Server se connecte &#224;
Internet par l&#8217;interm&#233;diaire d&#8217;un proxy, donnez le nom de l&#8217;h&#244;te proxy et
son num&#233;ro de port.</b><p>Si la machine sur laquelle GlassFish Server s&#8217;ex&#233;cute se connecte directement &#224;
Internet, ignorez cette &#233;tape.</p><p>Il est possible qu&#8217;un navigateur Web s&#8217;ex&#233;cute sur la m&#234;me machine que
GlassFish Server. Dans ce cas, vous pouvez obtenir le nom d&#8217;h&#244;te et
le num&#233;ro de port du proxy dans ce navigateur. Sinon, contactez votre
administrateur syst&#232;me.</p></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-uc-update.html">Affichage des mises &#224; jour disponibles pour les composants</a></p>

</li>
<li><p><a href="task-uc-addon.html">Installer des composants add-ons</a></p>

</li>
<li><p><a href="task-uc-installed-remove.html">Affichage des composants install&#233;s</a></p>

</li>
<li><p><a href="task-uc-pkgdetails.html">Afficher les informations d&#233;taill&#233;es d'un composant</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
