<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectoredit" name="task-jmxconnectoredit"></a><a id="GHCOM00211" name="GHCOM00211"></a></p>

<h4><a id="sthref199" name="sthref199"></a>Modifier le connecteur&nbsp;JMX</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez le service d'administration pour configurer un connecteur JMX distant conforme au JSR-160.</p>
<p>Le connecteur&nbsp;JMX distant conforme au JSR-160 g&egrave;re la communication entre les clients&nbsp;JMX (comme par exemple, JConsole) et le service&nbsp;JMX, &agrave; des fins de gestion de domaine.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service d'administration.</p>
<p>La page Modifier le connecteur JMX appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case S&eacute;curit&eacute; activ&eacute;e pour que la communication&nbsp;JMX soit crypt&eacute;e.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Adresse, saisissez l'adresse&nbsp;IP du service de d&eacute;nomination aupr&egrave;s duquel le stub du serveur du connecteur&nbsp;JMX est inscrit.</p>
<p>Ce n'est pas le port du socket de serveur qui effectue la v&eacute;ritable communication&nbsp;JMX. C'est l'adresse de l'interface r&eacute;seau depuis laquelle le registre&nbsp;RMI est d&eacute;marr&eacute;. Si votre syst&egrave;me est dot&eacute; de plusieurs interfaces r&eacute;seau, modifiez cette valeur afin de s&eacute;lectionner une seule interface. La valeur par d&eacute;faut est <code>0.0.0.0</code>.</p>
</li>
<li>
<p>Dans le champ Port, saisissez le num&eacute;ro de port sur lequel le service de d&eacute;nomination (registre&nbsp;RMI) &eacute;coute les connexions client&nbsp;RMI.</p>
<p>La seule fonction de ce service de d&eacute;nomination consiste &agrave; t&eacute;l&eacute;charger les stubs&nbsp;RMI. Si le port par d&eacute;faut est occup&eacute;, un port libre est utilis&eacute; &agrave; la place. Les valeurs valides vont de&nbsp;1 &agrave;&nbsp;65535. Sous les syst&egrave;mes UNIX, la cr&eacute;ation de sockets qui &eacute;coutent sur les ports&nbsp;1 &agrave;&nbsp;1024 n&eacute;cessite des privil&egrave;ges de superutilisateur. La valeur par d&eacute;faut est 8686.</p>
</li>
<li>
<p>Dans le champ Nom de domaine, saisissez le nom qui repr&eacute;sente le domaine d'administration sp&eacute;cial.</p>
<p>Toutes les authentifications sont g&eacute;r&eacute;es par ce domaine. La valeur par d&eacute;faut est <code>admin-realm</code> .</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish&nbsp;Server sp&eacute;cifie plusieurs propri&eacute;t&eacute;s par d&eacute;faut.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
<li>
<p>Si vous avez coch&eacute; la case S&eacute;curit&eacute; activ&eacute;e, suivez la proc&eacute;dure d&eacute;crite dans <a href="task-jmxconnectorssledit.html">Modifier les param&egrave;tres&nbsp;SSL pour le connecteur&nbsp;JMX</a>.</p>
</li>
</ol>
<a id="sthref200" name="sthref200"></a>
<h5>Voir aussi</h5>
<p><a href="task-jmxconnectorssledit.html">Modifier les param&egrave;tres&nbsp;SSL pour le connecteur&nbsp;JMX</a></p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
