<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-accessadmintools"></a><h3>Autoriser l&#8217;acc&#232;s aux outils d&#8217;administration</h3><a name="indexterm-79"></a><p>Seuls les utilisateurs du groupe <tt>asadmin</tt> ont acc&#232;s &#224; la Console d'administration
 et &#224; l&#8217;utilitaire de ligne de commande <tt>asadmin</tt>. Pour autoriser l&#8217;acc&#232;s
&#224; ces outils d&#8217;administration, ajoutez les utilisateurs au groupe <tt> asadmin</tt> dans le
domaine <tt>admin-realm</tt>.</p>

<ol>
<li><b>Sous le n&#339;ud Configurations, d&#233;veloppez la configuration de l'instance de serveur ou
de cluster pour lequel vous souhaitez configurer les privil&#232;ges d'acc&#232;s d'administration. </b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>D&#233;veloppez le n&#339;ud Domaines.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud <tt>admin-realm</tt>.</b><p>La page Modification du domaine s&#8217;ouvre.</p></li>
<li><b>Sur la page Modification du domaine, cliquez sur le bouton G&#233;rer les
utilisateurs.</b><p>La page Administrateurs s&#8217;ouvre.</p><p>Apr&#232;s l&#8217;installation, le nom et le mot de passe administrateur entr&#233;s lors
de l&#8217;installation figurent dans un fichier nomm&#233; <tt>admin-keyfile</tt>. Par d&#233;faut, cet utilisateur
appartient au groupe <tt>asadmin</tt>, qui conf&#232;re le droit de modifier le GlassFish
Server. N&#8217;assignez des utilisateurs &#224; ce groupe que si vous voulez leur
accorder des privil&#232;ges d&#8217;administrateur pour l'instance ou le cluster de &#38;ProductName.</p><p>Si vous ajoutez des utilisateurs au domaine <tt>admin-realm</tt>, mais que vous les
assignez &#224; un autre groupe que <tt>asadmin</tt>, les informations utilisateur seront toujours
enregistr&#233;es dans le fichier nomm&#233; <tt>admin-keyfile</tt>, mais l&#8217;utilisateur n&#8217;aura pas acc&#232;s aux
outils d&#8217;administration ni aux applications du domaine <tt>file</tt>.</p></li>
<li><b>Sur la page Administrateurs, cliquez sur Nouveau pour ajouter un utilisateur au
domaine <tt>admin-realm</tt>.</b><p>La page Nouvel utilisateur du domaine fichier s&#8217;ouvre.</p></li>
<li><b>Dans le champ ID utilisateur, saisissez le nouveau nom d&#8217;utilisateur.</b></li>
<li><b>Dans le champ Liste des groupes, saisissez les noms des groupes auxquels
l&#8217;utilisateur appartient.</b><p>Pour autoriser un utilisateur &#224; modifier le GlassFish Server, ajoutez le groupe
<tt>asadmin</tt> &#224; la Liste des groupes.</p></li>
<li><b>Dans les champs Nouveau mot de passe et Confirmer le mot de
passe, saisissez le mot de passe du nouvel utilisateur.</b></li>
<li><b>Cliquez sur OK pour ajouter cet utilisateur au domaine <tt>admin-realm</tt> ou sur
Annuler pour quitter sans sauvegarder.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-securitysettings.html">Configurer les r&#233;glages de s&#233;curit&#233;</a></p>

</li>
<li><p><a href="task-changeadminpasswd.html">Pour modifier le mot de passe d'un utilisateur du domaine d'administration</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
