<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-update"></a><h3>Affichage des mises &#224; jour disponibles pour les composants</h3><a name="indexterm-122"></a><p>La page Mises &#224; jour disponibles contient des informations sur les derni&#232;res
versions des <a href="ref-uc-concepts.html#ref-uc-about-component">composants</a> de l&#8217;<a href="ref-uc-concepts.html#ref-uc-about-repository">image d&#8217;installation</a> d&#233;j&#224; install&#233;s.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Outil de mise &#224; jour.</b><p>La page Add-ons disponibles s&#8217;affiche.</p></li>
<li><b>Dans la page Add-ons disponibles, cliquez sur l&#8217;onglet Mises &#224; jour disponibles.</b><p>La page Mises &#224; jour disponibles s&#8217;affiche. Si aucune mise &#224; jour
n&#8217;est disponible, le tableau est vide.</p></li></ol><p></b>&#201;tapes suivantes</b></p><p>Pour installer les mises &#224; jour disponibles, commencez par le domaine GlassFish
Server. Utilisez ensuite l&#8217;une des commandes suivantes&#160;:</p>


<ul><li><p><tt><i>as-install-parent</i>/bin/updatetool</tt>, qui d&#233;marre l&#8217;utilitaire graphique de l&#8217;outil de mise &#224; jour</p>

</li>
<li><p><tt><i>as-install-parent</i>/bin/pkg</tt>, version ligne de commande de l&#8217;outil de mise &#224; jour</p>

</li></ul>
<p>Pour de plus amples informations sur l'utilisation de la commande <tt>pkg</tt>, reportez-vous
au <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2416&id=ghapp">Chapitre 11, Extending and Updating GlassFish Server du <i>Oracle GlassFish Server 3.1 Administration Guide</i></a>. L&#8217;utilitaire Outil de mise &#224; jour poss&#232;de sa propre aide
en ligne.</p>

<p>Red&#233;marrez le serveur apr&#232;s avoir termin&#233; l&#8217;installation des mises &#224; jour.</p>

<p></b>Voir aussi</b></p>
<ul><li><p><a href="task-uc-addon.html">Installer des composants add-ons</a></p>

</li>
<li><p><a href="task-uc-installed-remove.html">Affichage des composants install&#233;s</a></p>

</li>
<li><p><a href="task-uc-pkgdetails.html">Afficher les informations d&#233;taill&#233;es d'un composant</a></p>

</li>
<li><p><a href="task-uc-set-proxy.html">Configurer les param&#232;tres proxy de r&#233;seau pour acc&#233;der aux r&#233;f&#233;rentiels de r&#233;seau</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
