<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a><a id="GHCOM00177" name="GHCOM00177"></a></p>

<h4><a id="sthref120" name="sthref120"></a>Configurer les param&egrave;tres g&eacute;n&eacute;raux de journalisation</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configurations.</p>
</li>
<li>
<p>Sous le noeud Configurations, cliquez sur la configuration d'instance de serveur ou de cluster pour laquelle vous souhaitez d&eacute;finir les param&egrave;tres du journaliseur.</p>
<p>La page Configuration appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Configuration, cliquez sur Param&egrave;tres du journaliseur.</p>
<p>La page Param&egrave;tres du journaliseur de la cible de configuration s&eacute;lectionn&eacute;e appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Ecrire dans le journal syst&egrave;me pour envoyer le r&eacute;sultat de la journalisation &agrave; l'utilitaire <code>syslog</code> en plus du journal du serveur.</p>
<p>Cette fonctionnalit&eacute; est disponible sur les syst&egrave;mes Solaris et Linux uniquement. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Fichier journal, saisissez un autre nom ou emplacement pour le fichier journal du serveur.</p>
<p>L'emplacement par d&eacute;faut est <code>${com.sun.aas.instanceRoot}/logs/server.log</code>.</p>
</li>
<li>
<p>Dans le champ Gestionnaire de journaux, saisissez le nom de classe absolu d'un gestionnaire de journal personnalis&eacute;.</p>
<p>Un gestionnaire de journal personnalis&eacute; permet d'envoyer des journaux vers une destination autre que <code>server.log</code> ou <code>syslog</code>. Celui-ci doit venir en extension de la classe <code>java.util.logging.ConsoleHandler</code> (API compatible JSR&nbsp;047). Ajoutez la classe du gestionnaire au classpath de GlassFish&nbsp;Server de fa&ccedil;on &agrave; installer le gestionnaire au d&eacute;marrage du serveur.</p>
</li>
<li>
<p>Dans le champ Limite de rotation du fichier, saisissez la taille en octets que le fichier journal du serveur doit atteindre avant sa rotation.</p>
<p>Lorsque le journal du serveur atteint la taille indiqu&eacute;e, GlassFish&nbsp;Server cr&eacute;e un fichier vide nomm&eacute; <code>server.log</code> et renomme l'ancien fichier <code>server.log_</code><i>date</i>, o&ugrave; <i>date</i> indique la date et l'heure de rotation du fichier. La valeur par d&eacute;faut est 2&nbsp;Mo. La valeur minimale est 500&nbsp;ko. Si vous sp&eacute;cifiez une valeur inf&eacute;rieure, le syst&egrave;me effectuera la rotation &agrave; 500&nbsp;ko. Pour d&eacute;sactiver la rotation du fichier journal, sp&eacute;cifiez la valeur&nbsp;0.</p>
</li>
<li>
<p>Dans le champ Temps limite de rotation du fichier, saisissez le nombre de minutes au bout duquel la rotation du journal du serveur doit &ecirc;tre effectu&eacute;e.</p>
<p>La valeur par d&eacute;faut est&nbsp;0&nbsp;; cela signifie que le syst&egrave;me effectuera la rotation lorsque le fichier aura atteint la taille sp&eacute;cifi&eacute;e dans le champ Limite de rotation des fichiers.</p>

<hr>
<p><b>Remarque:</b></p>
Si vous sp&eacute;cifiez une ou plusieurs minutes, le temps limite remplace la taille limite indiqu&eacute;e par le champ Limite de rotation des fichiers.
<hr>

</li>
<li>
<p>Dans le champ Fr&eacute;quence de vidage, saisissez le nombre maximal de messages &agrave; &eacute;crire simultan&eacute;ment de la file d'attente vers le journal du serveur.</p>
<p>La valeur par d&eacute;faut est&nbsp;1.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Remarque:</b></p>
Selon la configuration pour laquelle la journalisation est activ&eacute;e, vous devrez peut-&ecirc;tre red&eacute;marrer le serveur.
<p>Un red&eacute;marrage du serveur peut &eacute;galement &ecirc;tre n&eacute;cessaire si le nom du fichier journal est modifi&eacute; par rapport &agrave; la valeur par d&eacute;faut. Un message <code>Red&eacute;marrage requis</code> appara&icirc;t dans le coin sup&eacute;rieur droit de la Console d'administration s'il est n&eacute;cessaire de red&eacute;marrer le serveur.</p>

<hr>

</li>
</ol>
<a id="sthref121" name="sthref121"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">Modifier la limite du nombre de fichiers journaux &agrave; rotation</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Afficher les fichiers journaux du serveur DAS</a></p>
</li>
<li>
<p><a href="task-logging-collectlogfiles.html">Cr&eacute;er une archive&nbsp;ZIP pour tous les fichiers journaux</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
