<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jvmsettings" name="task-jvmsettings"></a><a id="GHCOM00172" name="GHCOM00172"></a></p>

<h4><a id="sthref110" name="sthref110"></a>Configurer les param&egrave;tres g&eacute;n&eacute;raux&nbsp;JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La machine virtuelle Java (JVM) permet d'ex&eacute;cuter du code binaire Java sur un ordinateur physique. Vous pouvez r&eacute;gler les param&egrave;tres&nbsp;JVM pour am&eacute;liorer les performances et emp&ecirc;cher les erreurs d'allocation de m&eacute;moire.</p>
<p>La machine virtuelle Java est incluse dans le logiciel Java&nbsp;Platform Standard&nbsp;Edition (plate-forme Java&nbsp;SE), n&eacute;cessaire &agrave; l'ex&eacute;cution de GlassFish&nbsp;Server. La saisie de param&egrave;tres&nbsp;JVM incorrects emp&ecirc;chant l'ex&eacute;cution du serveur, vous devez &ecirc;tre prudent lors de la modification de ces param&egrave;tres.</p>

<hr>
<p><b>Remarque:</b></p>
Les termes "Java Virtual Machine" et "JVM" d&eacute;signent une machine virtuelle pour la plate-forme&nbsp;Java.
<hr>

<ol>
<li>
<p>In the navigation tree, expand the Configuration node.</p>
</li>
<li>
<p>Select the configuration that you are changing.</p>
</li>
<li>
<p>Select the JVM Settings node.</p>
<p>The JVM General Settings tab page opens.</p>
</li>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Param&egrave;tres&nbsp;JVM.</p>
<p>La page Param&egrave;tres&nbsp;JVM appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Param&egrave;tres g&eacute;n&eacute;raux&nbsp;JVM, dans le champ R&eacute;pertoire d'origine Java, saisissez le nom du r&eacute;pertoire d'installation du logiciel Java&nbsp;SE.</p>
<p>GlassFish&nbsp;Server fonctionne avec la plate-forme Java&nbsp;SE. Pour v&eacute;rifier que la version du logiciel Java&nbsp;SE sp&eacute;cifi&eacute; est prise en charge par cette version, consultez le document <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Oracle GlassFish Server Release Notes</i></a>. Si vous saisissez un nom de r&eacute;pertoire inexistant ou le r&eacute;pertoire d'une version non prise en charge du logiciel Java&nbsp;SE, GlassFish&nbsp;Server ne d&eacute;marre pas.</p>
</li>
<li>
<p>Dans le champ Options Javac, saisissez les options de ligne de commande du compilateur du langage de programmation Java.</p>
<p>GlassFish&nbsp;Server ex&eacute;cute le compilateur lorsque des composants&nbsp;EJB (Enterprise Java Beans) sont d&eacute;ploy&eacute;s.</p>
</li>
<li>
<p>Cochez la case D&eacute;bogage activ&eacute; pour activer le d&eacute;bogage avec JPDA (Java Platform Debugger Architecture).</p>
<p>L'architecture&nbsp;JPDA est utilis&eacute;e par les d&eacute;veloppeurs d'applications. Pour plus d'informations, reportez-vous au manuel <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG"><i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
</li>
<li>
<p>Dans le champ Options de d&eacute;bogage, saisissez les options JPDA &agrave; transmettre &agrave; la&nbsp;JVM.</p>
<p>Ce champ ne s'applique que si le d&eacute;bogage a &eacute;t&eacute; activ&eacute; &agrave; l'&eacute;tape pr&eacute;c&eacute;dente.</p>
</li>
<li>
<p>Dans le champ Options de compilation RMI, saisissez les options de ligne de commande du compilateur&nbsp;<code>rmic</code>.</p>
<p>GlassFish&nbsp;Server ex&eacute;cute le compilateur <code>rmic</code> lorsque des composants&nbsp;EJB sont d&eacute;ploy&eacute;s.</p>
</li>
<li>
<p>Dans le champ Pr&eacute;processeur du code ex&eacute;cutable, saisissez la liste des noms de classe.</p>
<p>S&eacute;parez les noms de classe par des virgules. Chaque classe doit impl&eacute;menter l'interface com.sun.appserv.BytecodePreprocessor. Les classes sont appel&eacute;es par ordre d'&eacute;num&eacute;ration.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
<p>GlassFish&nbsp;Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour la&nbsp;JVM.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
<li>
<p>Red&eacute;marrez le serveur.</p>
</li>
</ol>
<a id="sthref111" name="sthref111"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jvmpathsettings.html">Configurer les param&egrave;tres du chemin&nbsp;JVM</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">Configurer les options&nbsp;JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">D&eacute;sactiver le gestionnaire de s&eacute;curit&eacute;</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Configurer les param&egrave;tres de l'analyseur de performances&nbsp;JVM</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
