<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigedit" name="task-messagesecurityconfigedit"></a><a id="GHCOM00205" name="GHCOM00205"></a></p>

<h4><a id="sthref185" name="sthref185"></a>Modifier une configuration de s&eacute;curit&eacute; des messages</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Pour activer la s&eacute;curit&eacute; des messages au niveau des adresses des services&nbsp;Web d&eacute;ploy&eacute;s sur GlassFish&nbsp;Server, vous devez sp&eacute;cifier un fournisseur &agrave; utiliser par d&eacute;faut c&ocirc;t&eacute; serveur. Si vous activez un fournisseur de s&eacute;curit&eacute; des messages par d&eacute;faut, vous devez &eacute;galement activer les fournisseurs qu'utiliseront les clients des services Web&nbsp;d&eacute;ploy&eacute;s sur GlassFish&nbsp;Server. L'activation des fournisseurs utilis&eacute;s par les clients est abord&eacute;e dans <a href="task-enablemesec4appclients.html">Activer la s&eacute;curit&eacute; des messages pour les clients d'application</a>.</p>
<p>Pour activer la s&eacute;curit&eacute; des messages pour les appels de service&nbsp;Web provenant des adresses d&eacute;ploy&eacute;es, vous devez sp&eacute;cifier un fournisseur client par d&eacute;faut. Si vous avez activ&eacute; un fournisseur client par d&eacute;faut pour GlassFish&nbsp;Server, vous devez vous assurer que les services appel&eacute;s depuis les adresses d&eacute;ploy&eacute;es sur GlassFish&nbsp;Server sont configur&eacute;s de mani&egrave;re compatible avec la s&eacute;curit&eacute; de la couche des messages.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud S&eacute;curit&eacute;.</p>
</li>
<li>
<p>S&eacute;lectionnez le noeud S&eacute;curit&eacute; des messages.</p>
<p>La page Configurations de s&eacute;curit&eacute; des messages appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Configurations de s&eacute;curit&eacute; des messages, cliquez sur le nom Couche d'authentification de la configuration que vous modifiez.</p>
<p>Par d&eacute;faut, la seule configuration de s&eacute;curit&eacute; des messages d&eacute;finie est&nbsp;SOAP.</p>
<p>La page Modifier la configuration de s&eacute;curit&eacute; des messages appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier la configuration de s&eacute;curit&eacute; des messages, dans la liste d&eacute;roulante Fournisseur par d&eacute;faut, s&eacute;lectionnez un fournisseur c&ocirc;t&eacute; serveur.</p>
<p>Le fournisseur de serveur par d&eacute;faut, &eacute;galement appel&eacute; le fournisseur par d&eacute;faut, identifie le fournisseur de serveur appel&eacute; si l'application n'identifie aucun fournisseur de serveur sp&eacute;cifique. Les choix disponibles sont <code>ServerProvider</code>, <code>XWS_ServerProvider</code> ou aucun. Par d&eacute;faut, aucun fournisseur n'est s&eacute;lectionn&eacute;, afin que GlassFish&nbsp;Server n'appelle pas de fournisseur de s&eacute;curit&eacute; des messages c&ocirc;t&eacute; serveur. La plupart du temps, s&eacute;lectionnez <code>ServerProvider</code> comme fournisseur par d&eacute;faut.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Fournisseur client par d&eacute;faut, s&eacute;lectionnez un fournisseur client.</p>
<p>Le fournisseur client par d&eacute;faut identifie le fournisseur client appel&eacute; si l'application n'identifie aucun fournisseur client sp&eacute;cifique. Les choix disponibles sont <code>ClientProvider</code>, <code>XWS_ClientProvider</code> ou aucun. Par d&eacute;faut, aucun fournisseur n'est s&eacute;lectionn&eacute;, afin que GlassFish&nbsp;Server n'appelle pas de fournisseur de s&eacute;curit&eacute; des messages c&ocirc;t&eacute; client. La plupart du temps, s&eacute;lectionnez "aucun" comme fournisseur client par d&eacute;faut. S&eacute;lectionnez <code>ClientProvider</code> pour appliquer un fournisseur et une r&egrave;gle par d&eacute;faut de protection des messages aux appels de service&nbsp;Web provenant des adresses de services Web d&eacute;ploy&eacute;es sur GlassFish&nbsp;Server.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
<li>
<p>Pour obtenir des instructions sur la modification des r&egrave;gles de protection des messages relatives aux fournisseurs de serveur ou aux fournisseurs client activ&eacute;s, reportez-vous &agrave; <a href="task-messagesecurityproviderconfigedit.html">Modifier une configuration de fournisseur de s&eacute;curit&eacute; des messages</a>.</p>
</li>
</ol>
<a id="sthref186" name="sthref186"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurer les utilitaires GlassFish&nbsp;Server pour qu'ils puissent &ecirc;tre utilis&eacute;s par les fournisseurs de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;er une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Supprimer une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;er une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modifier une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Supprimer une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activer la s&eacute;curit&eacute; des messages pour les clients d'application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
