<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appredeploy"></a><h4>Red&#233;ploiement d&#8217;une application d&#233;ploy&#233;e</h4><a name="indexterm-54"></a><a name="indexterm-55"></a><p>Le red&#233;ploiement d&#8217;une application d&#233;ploie une nouvelle version de l&#8217;application tout en
conservant les param&#232;tres et les options avec lesquels l&#8217;application a &#233;t&#233; d&#233;ploy&#233;e
initialement.</p>

<h6>Avant de commencer</h6><p>Assurez-vous que l&#8217;application &#224; red&#233;ployer est d&#233;j&#224; d&#233;ploy&#233;e.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Applications.</b><p>La page Applications s&#8217;affiche.</p></li>
<li><b>Dans le tableau Applications d&#233;ploy&#233;es, cliquez sur Red&#233;ployer sur la ligne de
l&#8217;application que vous voulez red&#233;ployer.</b><p>Le nom de l'application peut &#234;tre suivi d'un identificateur de version facultatif
dont il est s&#233;par&#233; par un signe deux-points (<tt>:</tt>). Pour plus d'informations
sur le module et les versions d'application, reportez-vous &#224; la section <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions du <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p><p>La page Red&#233;ploiement d&#8217;applications ou de modules s&#8217;affiche.</p></li>
<li><b>Sp&#233;cifiez l&#8217;emplacement de l&#8217;application &#224; red&#233;ployer.</b><ul>
<li><b>Si l&#8217;application est un fichier d&#8217;archive stock&#233; sur la machine client ou
accessible depuis cette derni&#232;re, s&#233;lectionnez l&#8217;option Fichier empaquet&#233; &#224; t&#233;l&#233;charger sur le
serveur.</b><p>L&#8217;ordinateur client est l&#8217;h&#244;te sur lequel vous visualisez la Console d'administration 
via un navigateur.</p><p>Cliquez sur Parcourir pour acc&#233;der au fichier ou tapez le chemin d&#8217;acc&#232;s
complet au fichier.</p></li>
<li><b>Si l&#8217;application est un fichier d&#8217;archive stock&#233; sur la machine serveur ou
une application non empaquet&#233;e dans un r&#233;pertoire &#233;clat&#233;, s&#233;lectionnez l&#8217;option Fichier local
empaquet&#233; ou R&#233;pertoire accessible depuis GlassFish Server.</b><p>La machine serveur est l&#8217;h&#244;te sur lequel fonctionne le serveur d&#8217;administration du
domaine. </p><p>Cliquez sur Parcourir les fichiers pour acc&#233;der &#224; un fichier ou Parcourir
les dossiers pour acc&#233;der &#224; un r&#233;pertoire. Vous pouvez &#233;galement saisir le
nom du chemin d&#8217;acc&#232;s complet au fichier ou au r&#233;pertoire. Le d&#233;ploiement
&#224; partir d&#8217;un r&#233;pertoire &#233;clat&#233; est r&#233;serv&#233; aux d&#233;veloppeurs exp&#233;riment&#233;s et est
d&#233;conseill&#233; pour les environnements de production.</p></li></ul></li>
<li><b>Cochez la case Pr&#233;compiler les JSP pour compiler au pr&#233;alable les fichiers
JavaServer Pages (JSP).</b><p>Si cette option est d&#233;sactiv&#233;e, les fichiers JSP sont compil&#233;s au moment
de l&#8217;ex&#233;cution lors de leur premier acc&#232;s. Cette option est d&#233;sactiv&#233;e par
d&#233;faut.</p></li>
<li><b>S&#233;lectionnez la case &#224; cocher Ex&#233;cuter le v&#233;rificateur pour v&#233;rifier les descripteurs
de d&#233;ploiement avant le red&#233;ploiement. </b><p>Si cette option est s&#233;lectionn&#233;e et que la v&#233;rification &#233;choue, le red&#233;ploiement
n&#8217;a pas lieu. Le v&#233;rificateur examine la structure et le contenu des
descripteurs de d&#233;ploiement. La v&#233;rification d&#8217;applications volumineuses est souvent une t&#226;che qui
demande du temps. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p><p>Les packages du v&#233;rificateur doivent &#234;tre install&#233;s &#224; partir de l'outil de
mise &#224; jour ou un avertissement est enregistr&#233; et cette option est
ignor&#233;e. </p></li>
<li><b>Cochez la case Java Web Start pour activer l&#8217;acc&#232;s &#224; Java Web
Start pour un module client de l&#8217;application.</b><p>Cette option est activ&#233;e ou d&#233;sactiv&#233;e par d&#233;faut en fonction de son
param&#232;tre lorsque l'application a &#233;t&#233; initialement d&#233;ploy&#233;e. </p></li>
<li><b>S&#233;lectionnez la case Garder l'&#233;tat pour conserver des sessions Web, des instances
SFSB et des horloges EJB cr&#233;&#233;es de fa&#231;on persistante entre les red&#233;ploiements.
</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut. Cette option n'est prise en charge
que sur l'instance de serveur par d&#233;faut, appel&#233;e <tt>server</tt>. Elle n'est pas
prise en charge et est ignor&#233;e pour toute autre cible. </p><p>Certaines modifications apport&#233;es &#224; une application entre des red&#233;ploiements emp&#234;chent cette fonctionnalit&#233;
de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance
dans la classe de bean SFSB. </p><p>Pour les applications Web, cette fonction n'est applicable que si dans le
fichier <tt>glassfish-web-app.xml </tt>, l'attribut <tt>persistence-type</tt> de l'&#233;l&#233;ment <tt> session-manager</tt> est <tt>file</tt>.</p><p>Pour les instances de bean de session avec &#233;tat, le type de
persistance sans haute disponibilit&#233; est d&#233;fini dans le serveur (l'option Type de
persistance SFSB) et doit &#234;tre d&#233;fini sur <tt>file</tt>, qui est la valeur
par d&#233;faut et recommand&#233;e. </p><p>Si la conservation ou la restauration d'une session Web, d'une instance de
SFSB ou d'une horloge EJB active &#233;choue, <b>aucune</b> d'entre elles ne sera
disponible une fois le red&#233;ploiement termin&#233;. Toutefois, le red&#233;ploiement se poursuit et
un avertissement est enregistr&#233;.</p><p>Pour conserver les donn&#233;es d'&#233;tat actives, GlassFish Server s&#233;rialise les donn&#233;es et
les enregistre dans la m&#233;moire. Pour restaurer les donn&#233;es, le chargeur de
classe de l&#8217;application qui vient d&#8217;&#234;tre red&#233;ploy&#233;e d&#233;s&#233;rialise les donn&#233;es qui ont
&#233;t&#233; enregistr&#233;es.</p></li>
<li><b>S&#233;lectionnez la case &#224; cocher Conserver les ressources limit&#233;es &#224; l&#8217;application pour
conserver des ressources limit&#233;es &#224; l&#8217;application et les restaurer pendant le red&#233;ploiement.
</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-applistdeployed.html">Pour afficher la liste des applications d&#233;ploy&#233;es</a></p>

</li>
<li><p><a href="task-appdeployweb.html">D&#233;ployer une application Web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Pour d&#233;ployer une application d'entreprise</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Pour d&#233;ployer un client d'application</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Pour d&#233;ployer un module connecteur</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Pour d&#233;ployer un Jar EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Modification d'une application d&#233;ploy&#233;e</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>

</li>
<li><p><a href="task-appviewtargets.html">Afficher les cibles de l'application</a></p>

</li>
<li><p><a href="task-endpoint.html">Affichage des informations relatives aux extr&#233;mit&#233;s des services Web</a></p>

</li>
<li><p><a href="task-applaunch.html">Lancement d'une application</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Lancer un client d'application</a></p>

</li>
<li><p><a href="task-apprestart.html">Recharger une application d&#233;ploy&#233;e</a></p>

</li>
<li><p><a href="../../../ejb/fr/help/task-ejbcontaineravailability.html">To Configure Availability Settings for the EJB Container</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
