<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-eelogginglevels"></a><h3>Configurer les niveaux de journalisation</h3><a name="indexterm-68"></a><a name="indexterm-69"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configurations.</b></li>
<li><b>Sous le n&#339;ud Configuration, cliquez sur la configuration de l'instance de serveur
ou de cluster pour lequel vous souhaitez configurer les param&#232;tres du journal.
</b><p>La page Configuration s&#8217;ouvre.</p></li>
<li><b>Sur la page Configuration, cliquez sur Param&#232;tres du journal. </b><p>La page Param&#232;tres du journal pour la cible de configuration s&#233;lectionn&#233;e s'ouvre.
</p></li>
<li><b>Sur la page Param&#232;tres du , cliquez sur l&#8217;onglet Niveaux de journalisation.</b><p>La page Niveaux de journalisation de module s&#8217;ouvre.</p></li>
<li><b>Sur la page Niveaux de journalisation de module, modifiez les niveaux de
journalisation pour un ou plusieurs modules, comme suit.</b><ul>
<li><b>Pour modifier le niveau de journalisation d&#8217;un module individuel, s&#233;lectionnez une nouvelle
valeur dans la liste d&#233;roulante &#224; l&#8217;oppos&#233; du module dont vous voulez
modifier le niveau de journalisation.</b></li>
<li><b>Pour modifier le niveau de journalisation d&#8217;un groupe de modules :</b><ol style="list-style-type: lower-alpha">
<li><b>Cochez les cases en regard des noms des modules dont vous voulez
modifier le niveau de journalisation.</b></li>
<li><b>S&#233;lectionnez une valeur dans la liste d&#233;roulante en haut du tableau.</b></li>
<li><b>Cliquez sur le bouton Modifier le niveau.</b></li></ol></li></ul><p>Les messages correspondant au niveau s&#233;lectionn&#233; ou sup&#233;rieur apparaissent dans le journal.
Choisissez l&#8217;une des valeurs suivantes (class&#233;es de la plus &#233;lev&#233;e &#224; la
plus basse) :</p>


<ul><li><p><tt>GRAVE</tt></p>

</li>
<li><p><tt>WARNING</tt></p>

</li>
<li><p><tt>INFO</tt></p>

</li>
<li><p><tt>CONFIG</tt></p>

</li>
<li><p><tt>FINE</tt></p>

</li>
<li><p><tt>FINER</tt></p>

</li>
<li><p><tt>FINEST</tt></p>

</li>
<li><p><tt>OFF</tt></p>

</li></ul>
<p>Pour en savoir plus sur la signification des niveaux de journalisation, consultez
la rubrique <a href="ref-eelogginglevels.html">Niveaux de journalisation des modules</a>. Le niveau par d&#233;faut est <tt>INFO</tt>, donc par d&#233;faut,
le journal contiendra des messages des niveaux <tt> INFO</tt>, <tt>AVERTISSEMENT</tt> ou <tt>GRAVE</tt>.</p></li>
<li><b>Cliquez sur Enregistrer.</b><p>Les modifications apport&#233;es aux niveaux de journalisation prennent effet imm&#233;diatement. Ils sont
&#233;galement sauvegard&#233;s pour &#234;tre utilis&#233;s au red&#233;marrage du serveur.</p></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-eelogging.html">Configurer les param&#232;tres g&#233;n&#233;raux de journalisation</a></p>

</li>
<li><p><a href="task-logging-max-logfiles.html">Pour modifier la limite du nombre de fichiers journaux &#224; rotation</a></p>

</li>
<li><p><a href="task-logviewer.html">Afficher les journaux du DAS </a></p>

</li>
<li><p><a href="task-logging-collectlogfiles.html">Pour cr&#233;er une archive ZIP de tous les fichiers journaux </a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
