<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-set-proxy" name="task-uc-set-proxy"></a><a id="GHCOM00218" name="GHCOM00218"></a></p>

<h4><a id="sthref220" name="sthref220"></a><a id="sthref221" name="sthref221"></a><a id="sthref222" name="sthref222"></a>Configurer les param&egrave;tres proxy de r&eacute;seau pour l'acc&egrave;s aux r&eacute;f&eacute;rentiels r&eacute;seau</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les param&egrave;tres proxy de r&eacute;seau d&eacute;terminent le mode de connexion de GlassFish&nbsp;Server &agrave; Internet. Pour permettre &agrave; l'Outil de mise &agrave; jour d'acc&eacute;der aux r&eacute;f&eacute;rentiels de r&eacute;seau via Internet, configurez les param&egrave;tres proxy de r&eacute;seau.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Outil de mise &agrave; jour.</p>
<p>La page Extensions disponibles appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Extensions disponibles, cliquez sur l'onglet Configuration.</p>
<p>La page Configuration de l'Outil de mise &agrave; jour appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Configuration de l'Outil de mise &agrave; jour, indiquez le mode de connexion &agrave; Internet de l'ordinateur sur lequel GlassFish&nbsp;Server est ex&eacute;cut&eacute;.</p>
<ul>
<li>
<p>Si l'ordinateur se connecte directement &agrave; Internet, s&eacute;lectionnez l'option Connexion directe.</p>
</li>
<li>
<p>Si l'ordinateur se connecte &agrave; Internet via un proxy, s&eacute;lectionnez l'option Via un proxy.</p>
</li>
</ul>
</li>
<li>
<p>Si l'ordinateur sur lequel GlassFish&nbsp;Server est ex&eacute;cut&eacute; se connecte &agrave; Internet via un proxy, indiquez le nom de l'h&ocirc;te proxy et son num&eacute;ro de port.</p>
<p>Si l'ordinateur sur lequel GlassFish&nbsp;Server est ex&eacute;cut&eacute; se connecte directement &agrave; Internet, ignorez cette &eacute;tape.</p>
<p>Il est possible d'utiliser un navigateur&nbsp;Web sur l'ordinateur sur lequel GlassFish&nbsp;Server est ex&eacute;cut&eacute;. Dans ce cas, vous pouvez obtenir le nom d'h&ocirc;te et le num&eacute;ro de port du proxy &agrave; partir du navigateur&nbsp;Web. Sinon, demandez ces informations &agrave; l'administrateur syst&egrave;me.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref223" name="sthref223"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Afficher les mises &agrave; jour disponibles pour les composants</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">Installer des composants d'extension</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Afficher les composants install&eacute;s</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Afficher les informations d&eacute;taill&eacute;es d'un composant</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
