<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-endpoint"></a><h3>Affichage des informations relatives aux extr&#233;mit&#233;s des services Web</h3><a name="indexterm-47"></a><a name="indexterm-48"></a><a name="indexterm-49"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Applications.</b><p>La page Applications s&#8217;affiche.</p></li>
<li><b>Sur le page Applications, cliquez sur le nom du service Web dont
vous affichez les informations d&#8217;extr&#233;mit&#233;.</b><p>Le nom peut &#234;tre suivi d'un identificateur de version facultatif dont il
est s&#233;par&#233; par un signe deux-points (<tt>:</tt>). Pour plus d'informations sur le
module et les versions d'application, reportez-vous &#224; la section <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions du <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p><p>La page Modification de l&#8217;application s&#8217;affiche.</p></li>
<li><b>Dans le tableau Modules et composants, cliquez sur le lien Afficher le
point d&#8217;extr&#233;mit&#233; pour le sous-composant.</b><p>La page Informations relatives aux extr&#233;mit&#233;s des services Web s&#8217;ouvre.</p></li>
<li><b>Si le lien Testeur est visible, cliquez sur ce lien pour afficher
une page qui vous permet de fournir des param&#232;tres pour tester les
m&#233;thodes du service Web.</b><p>Le lien Testeur s&#8217;affiche uniquement si le type de d&#233;ploiement de l&#8217;application
n'est pas RI (par exemple, s&#8217;il est 109). La page Testeur s'affiche
dans un nouvel onglet ou une nouvelle fen&#234;tre de navigateur.</p></li>
<li><b>Cliquez sur le lien WSDL pour afficher le fichier Web Services Definition
Language (WSDL) pour le point d&#8217;extr&#233;mit&#233;. </b><p>Le fichier WSDL s&#8217;ouvre dans un nouvel onglet ou une nouvelle fen&#234;tre du
navigateur.</p><p>Notez que certains navigateurs Web tentent d'interpr&#233;ter la source WSDL lorsque vous
cliquez sur le lien WSDL, affichant ainsi une page vierge. Pour de
tels navigateurs, utilisez la commande d'affichage de la source du navigateur sur
la page vierge pour afficher la source WSDL. </p></li>
<li><b>Cliquez sur le lien Nom de l&#8217;application ou sur le bouton Pr&#233;c&#233;dent
pour revenir &#224; la page Modification d&#8217;une application.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-applistdeployed.html">Pour afficher la liste des applications d&#233;ploy&#233;es</a></p>

</li>
<li><p><a href="task-appdeployweb.html">D&#233;ployer une application Web</a></p>

</li>
<li><p><a href="task-deployentapp.html">Pour d&#233;ployer une application d'entreprise</a></p>

</li>
<li><p><a href="task-appdeployclient.html">Pour d&#233;ployer un client d'application</a></p>

</li>
<li><p><a href="task-appdeployconn.html">Pour d&#233;ployer un module connecteur</a></p>

</li>
<li><p><a href="task-appdeployejb.html">Pour d&#233;ployer un Jar EJB</a></p>

</li>
<li><p><a href="task-appedit.html">Modification d'une application d&#233;ploy&#233;e</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>

</li>
<li><p><a href="task-applaunch.html">Lancement d'une application</a></p>

</li>
<li><p><a href="task-appclientlaunch.html">Lancer un client d'application</a></p>

</li>
<li><p><a href="task-appredeploy.html">Red&#233;ploiement d'une application d&#233;ploy&#233;e</a></p>

</li>
<li><p><a href="task-apprestart.html">Recharger une application d&#233;ploy&#233;e</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
