<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appviewtargets"></a><h3>Afficher les cibles de l&#8217;application</h3><ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud Applications.</b><p>La page Applications s&#8217;affiche.</p></li>
<li><b>S&#233;lectionnez l'application pour laquelle vous souhaitez afficher les cibles. </b><p>Le nom de l'application peut &#234;tre suivi d'un identificateur de version facultatif
dont il est s&#233;par&#233; par un signe deux-points (<tt>:</tt>). Pour plus d'informations
sur le module et les versions d'application, reportez-vous &#224; la section <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2417&id=gkhhv">Module and Application Versions du <i>Oracle GlassFish Server 3.1 Application Deployment Guide</i></a>.</p><p>La page de l'application s'ouvre.</p></li>
<li><b>S&#233;lectionnez l&#8217;onglet Cible.</b><p>La page Cibles de l'application s'ouvre et les cibles actuellement sp&#233;cifi&#233;es pour
l&#8217;application s'affichent.</p></li>
<li><b>Pour activer ou d&#233;sactiver une application sur une instance ou un cluster
cible sp&#233;cifique, cochez la case situ&#233;e &#224; c&#244;t&#233; de la cible et
s&#233;lectionnez Activer ou D&#233;sactiver dans le menu d&#233;roulant Plus d'actions. </b></li>
<li><b>Pour permettre l&#8217;&#233;quilibrage de charge d&#8217;une cible sur une instance ou un
cluster cible sp&#233;cifique, cochez la case situ&#233;e &#224; c&#244;t&#233; de la cible
et s&#233;lectionnez Equilibreur de charge activ&#233; ou Equilibreur de charge d&#233;sactiv&#233; dans
le menu d&#233;roulant Plus d'actions. </b></li>
<li><b>Pour associer une application &#224; des serveurs virtuels sp&#233;cifiques, s&#233;lectionnez Gestion des
serveurs virtuels pour l'instance ou le cluster cible de votre choix.</b><p>La page Cibles du serveur virtuel s'ouvre.</p><p>Pour ajouter des serveurs virtuels cibles, s&#233;lectionnez-les dans la liste Cibles disponibles
et d&#233;placez-les vers la liste Cibles s&#233;lectionn&#233;es &#224; l'aide du bouton Ajouter.</p><p>Par d&#233;faut, le module ou l'application est associ&#233; au serveur virtuel par
d&#233;faut, nomm&#233; <tt>server</tt>. Utilisez le bouton Tout Ajouter pour ajouter toutes les
cibles. Utilisez les boutons Supprimer et Tout Supprimer pour supprimer des cibles
de la liste Cibles s&#233;lectionn&#233;es. </p><p>Cliquez sur Enregistrer pour revenir &#224; la page Cibles de l'application. </p></li>
<li><b>Pour ajouter ou supprimer des instances ou clusters cibles pour l'application, s&#233;lectionnez
Gestion des cibles. </b><p>La page Gestion des cibles s&#8217;ouvre.</p><p>Pour ajouter des cibles, s&#233;lectionnez-les dans la liste Cibles disponibles et d&#233;placez-les
vers la liste Cibles s&#233;lectionn&#233;es &#224; l'aide du bouton Ajouter.</p><p>Utilisez le bouton Tout Ajouter pour ajouter toutes les cibles. Utilisez les
boutons Supprimer et Tout Supprimer pour supprimer des cibles de la liste
Cibles s&#233;lectionn&#233;es. </p><p>Cliquez sur Enregistrer pour revenir &#224; la page Cibles de l'application. </p></li>
<li><b>Cliquez sur Enregistrer.</b><p>L'application est d&#233;sormais disponible dans la liste r&#233;vis&#233;e des cibles. </p></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-appedit.html">Modification d'une application d&#233;ploy&#233;e</a></p>

</li>
<li><p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>

</li>
<li><p><a href="task-applaunch.html">Lancement d'une application</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
