<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfignew"></a><h3>Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</h3><a name="indexterm-107"></a><p>Normalement, vous n&#8217;avez pas besoin de cr&#233;er de configuration de s&#233;curit&#233; des
messages. GlassFish Server comporte une configuration de s&#233;curit&#233; des messages pour la
couche d&#8217;authentification SOAP. Les fournisseurs de cette configuration ne sont pas activ&#233;s
par d&#233;faut, mais vous pouvez les activer en modifiant la configuration de
s&#233;curit&#233; des messages SOAP. Vous pouvez cependant cr&#233;er une configuration pour la
couche d&#8217;authentification HttpServlet et sp&#233;cifier une ou plusieurs configurations de fournisseurs.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud S&#233;curit&#233; des messages.</b><p>La page Configurations de s&#233;curit&#233; des messages s&#8217;ouvre.</p></li>
<li><b>Sur la page Configurations de s&#233;curit&#233; des messages, cliquez sur Nouvelle.</b><p>La page Nouvelle configuration de s&#233;curit&#233; des messages s&#8217;ouvre.</p>
<hr><p><b>Remarque - </b>Il n'est pas possible de cr&#233;er ou supprimer les fournisseurs de s&#233;curit&#233;
des messages pour la configuration par d&#233;faut <tt>server-config</tt>. Les seuls fournisseurs de
s&#233;curit&#233; des messages qui sont pris en charge pour le <tt>server-config</tt> par
d&#233;faut sont SOAP et HttpServlet. Comme ces deux fournisseurs de message sont
d&#233;j&#224; cr&#233;&#233;s par d&#233;faut lors de l'installation de GlassFish Server, le bouton
Nouveau est gris&#233; sur la page Configuration de la s&#233;curit&#233; des messages
pour le <tt>server-config</tt> par d&#233;faut.</p>


<hr>
</li>
<li><b>Sur la page Nouvelle configuration de s&#233;curit&#233; des messages, dans la liste
d&#233;roulante Couche d&#8217;authentification, s&#233;lectionnez la couche message pour laquelle vous cr&#233;ez une
configuration.</b><p>Comme une configuration SOAP est disponible par d&#233;faut, le seul choix est
<tt> HttpServlet</tt>.</p></li>
<li><b>Dans le champ ID fournisseur, saisissez l&#8217;identifiant unique de la configuration du
fournisseur pour cette configuration de s&#233;curit&#233; des messages.</b></li>
<li><b>Cochez la case Fournisseur par d&#233;faut pour indiquer que cette configuration de
fournisseur correspond au fournisseur par d&#233;faut.</b></li>
<li><b>Dans la liste d&#233;roulante Type de fournisseur, s&#233;lectionnez le type de ce
fournisseur.</b><p>Les choix disponibles sont les suivants :</p><dl><dt><tt>client</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d&#8217;authentification du client.</p>

</dd>
<dt><tt>server</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d&#8217;authentification du serveur.</p>

</dd>
<dt><tt>client-server</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est &#224; la fois le fournisseur d&#8217;authentification du client et du serveur.</p>

</dd>
</dl>
</li>
<li><b>Dans le champ Nom de la classe, saisissez le nom de la
classe d&#8217;impl&#233;mentation Java du fournisseur.</b><p>Les fournisseurs d&#8217;authentification client doivent impl&#233;menter l&#8217;interface <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> . Les fournisseurs c&#244;t&#233;
serveur doivent impl&#233;menter l&#8217;interface <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> . Les fournisseurs c&#244;t&#233; client doivent impl&#233;menter
les deux interfaces.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p><p>Le GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les configurations de
s&#233;curit&#233; des messages.</p></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du GlassFish Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
