<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-lifecyclemoduleedit"></a><h4>Pour modifier un module de cycle de vie</h4><a name="indexterm-59"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le noeud Modules de cycle de vie.</b><p>La page Modules de cycle de vie s&#8217;affiche.</p></li>
<li><b>Sur la page Modules de cycle de vie, cliquez sur le nom
du module de cycle de vie que vous modifiez.</b><p>La page Modification du module de cycle de vie s&#8217;ouvre.</p></li>
<li><b>Dans le champ Nom de la classe, saisissez le nom complet du
fichier de classe du module de cycle de vie.</b><p>La classe doit impl&#233;menter l&#8217;interface <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></li>
<li><b>Dans le champ Classpath, saisissez le classpath du module de cycle de
vie.</b><p>Le classpath indique l&#224; o&#249; se trouve le module de cycle de
vie. La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/applications</tt>. Si le module est d&#233;j&#224;
dans ce r&#233;pertoire (c&#8217;est-&#224;-dire dans le classpath du serveur), ce champ peut
&#234;tre laiss&#233; vierge.</p></li>
<li><b>Dans le champ Ordre de chargement, saisissez une valeur indiquant l&#8217;ordre dans
lequel ce module de cycle de vie doit &#234;tre charg&#233; au d&#233;marrage.</b><p>Les modules aux valeurs d&#8217;ordre de chargement &#224; petit nombre sont charg&#233;s
plus t&#244;t. La valeur peut aller de 101 &#224; la valeur <tt>MAXINT</tt>
du syst&#232;me d&#8217;exploitation. Les valeurs de 1 &#224; 100 sont r&#233;serv&#233;es.</p></li>
<li><b>Dans le champ Description, saisissez une description du module de cycle de
vie.</b></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer le module de cycle de
vie.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case Emp&#234;cher le d&#233;marrage de l&#8217;instance en cas d&#8217;&#233;chec du
chargement pour indiquer que le serveur doit &#234;tre arr&#234;t&#233; en cas d&#8217;&#233;chec
de chargement du module de cycle de vie.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>L'onglet Cible s'affiche si des clusters ou des instances de serveur autonomes
existent en plus de l'instance de serveur par d&#233;faut (<tt>server</tt>). S&#233;lectionnez l'onglet
Cibles pour afficher les cibles sur lesquelles le module de cycle de
vie a &#233;t&#233; activ&#233;. Voir <a href="task-appviewtargets.html">Afficher les cibles de l'application</a> pour obtenir des instructions sur la
mani&#232;re d'activer ou d&#233;sactiver un module de cycle de vie sur une
ou plusieurs cibles. </b></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-lifecyclemodulenew.html">Pour cr&#233;er un module de cycle de vie</a></p>

</li>
<li><p><a href="task-lifecyclemoduledelete.html">Pour supprimer un module de cycle de vie</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
