<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityproviderconfigdelete"></a><h4>Pour supprimer la configuration d&#8217;un fournisseur de s&#233;curit&#233; des messages</h4><a name="indexterm-112"></a><h6>Avant de commencer</h6><p>Il n'est pas possible de cr&#233;er ou supprimer les fournisseurs de s&#233;curit&#233;
des messages pour la configuration par d&#233;faut <tt>server-config</tt>. Les seuls fournisseurs de
s&#233;curit&#233; des messages qui sont pris en charge pour le <tt>server-config</tt> par
d&#233;faut sont SOAP et HttpServlet. Comme ces deux fournisseurs de message sont
d&#233;j&#224; cr&#233;&#233;s par d&#233;faut lors de l'installation de GlassFish Server, le bouton
Supprimer ne s'affiche pas sur la page Configuration de la s&#233;curit&#233; des
messages pour le <tt>server-config</tt> par d&#233;faut.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud S&#233;curit&#233; des messages.</b><p>La page Configurations de s&#233;curit&#233; des messages s&#8217;ouvre.</p></li>
<li><b>Sur la page Configurations de s&#233;curit&#233; des messages, s&#233;lectionnez SOAP.</b><p>La page Modifier la configuration de s&#233;curit&#233; des messages s&#8217;ouvre.</p></li>
<li><b>Sur la page Modifier la configuration de s&#233;curit&#233; des messages, cliquez sur
l&#8217;onglet Fournisseurs.</b><p>La page Modifier la configuration du fournisseur s&#8217;ouvre.</p></li>
<li><b>Sur la page Modifier la configuration du fournisseur, cochez la case situ&#233;e
sur la gauche de la configuration du fournisseur &#224; supprimer.</b></li>
<li><b>Cliquez sur Supprimer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du GlassFish Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p>

</li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
