<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a><a id="GHEJL00001" name="GHEJL00001"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Enterprise Java Beans (EJB)" k&ouml;nnen Sie Einstellungen f&uuml;r den EJB-Container konfigurieren.</p>
<p>Neben den allgemeinen Einstellungen f&uuml;r Enterprise Beans k&ouml;nnen Sie Pool- und Cacheeinstellungen festlegen.</p>
<ul>
<li>
<p>Pooleinstellungen gelten nur f&uuml;r Session-Beans ohne Status. Standardm&auml;&szlig;ig verwaltet der Container einen Pool von Enterprise Beans, um auf Clientanforderungen reagieren zu k&ouml;nnen, ohne dass die bei der Bean-Erstellung entstehenden Performanceeinbu&szlig;en auftreten.</p>
<p>Falls es in einer Anwendung, die bereitgestellte Enterprise Beans nutzt, zu Problemen mit der Performance kommt, k&ouml;nnen Sie die Performance der Anwendung verbessern, indem Sie einen Pool erstellen oder die Anzahl der in einem vorhandenen Pool verwalteten Beans erh&ouml;hen.</p>
</li>
<li>
<p>Cacheeinstellungen gelten nur f&uuml;r Session-Beans mit Status. Der Container verwaltet einen Zwischenspeicher mit Enterprise Bean-Daten f&uuml;r die am h&auml;ufigsten verwendeten Enterprise Beans. So kann der Container schneller reagieren, wenn andere Anwendungsmodule Daten von den Enterprise Beans anfordern.</p>
<p>Gecachte Enterprise Beans k&ouml;nnen einen von drei Status aufweisen: Aktiv, Inaktiv und Passiviert. Auf ein aktives Enterprise Bean wird aktuell von Clients zugegriffen. Die Daten eines inaktiven Enterprise Beans befinden sich aktuell im Cache, es greifen jedoch keine Clients auf das Bean zu. Die Daten eines passivierten Beans sind tempor&auml;r gespeichert und werden in den Cache zur&uuml;ckgelesen, wenn ein Client das Bean anfordert.</p>
</li>
</ul>
<p>Die Seite "Enterprise Java Beans (EJB)" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zum Wiederherstellen der Standardwerte f&uuml;r Einstellungen, f&uuml;r die es Standardwerte gibt. Einstellungen, die nicht &uuml;ber Standardwerte verf&uuml;gen, k&ouml;nnen nicht ge&auml;ndert werden.</p>
</dd>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Sessionspeicherort</dt>
<dd>
<p>Das Verzeichnis, in dem passivierte Session-Beans mit Status und persistente HTTP-Sessions im Dateisystem gespeichert werden. Der Standardwert ist <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Passivierte Beans sind Session-Beans mit Status, deren Status in eine Datei auf dem Dateisystem geschrieben wurde. Passivierte Beans befinden sich typischerweise f&uuml;r eine bestimmte Zeitspanne im Leerlauf und es wird nicht durch einen Client auf sie zugegriffen. &Auml;hnlich sind persistente HTTP-Sessions individuelle Websessions, deren Status in eine Datei auf dem Dateisystem geschrieben wurde.</p>
</dd>
<dt>Commit-Option</dt>
<dd>
<p>Gibt an, wie der Container passivierte Bean-Instanzen zwischen Transaktionen zwischenspeichert. Wenn Sie "Option B" (Standardeinstellung) w&auml;hlen, speichert der Container eine bereite Instanz zwischen Transaktionen zwischen. Wenn Sie "Option C" w&auml;hlen, wird vom Container keine bereite Instanz zwischen Transaktionen zwischengespeichert.</p>
</dd>
<dt>Initial and Minimum Pool Size (Urspr&uuml;ngliche und minimale Poolgr&ouml;&szlig;e)</dt>
<dd>
<p>Die Mindestanzahl an Beans, die im Pool vorhanden sein m&uuml;ssen. Der Standardwert ist 0.</p>
</dd>
<dt>Maximum Pool Size (Maximale Poolgr&ouml;&szlig;e)</dt>
<dd>
<p>Die maximale Anzahl an Beans, die der Container parallel im Pool verwalten kann. Der Standardwert lautet 32.</p>
</dd>
<dt>Pool Resize Quantity (Anzahl der Gr&ouml;&szlig;en&auml;nderungen des Pools)</dt>
<dd>
<p>Die Anzahl an Beans, die aus dem Pool entfernt werden, wenn sie sich l&auml;nger als im Feld "Pool-Leerlaufzeit" angegeben im Leerlauf befinden. Der Wert muss gr&ouml;&szlig;er oder gleich 0 und kleiner als der Wert f&uuml;r die maximale Poolgr&ouml;&szlig;e sein. Der Standardwert ist 8.</p>
</dd>
<dt>Pool-Leerlaufzeit</dt>
<dd>
<p>Die Anzahl Sekunden, die sich eine Bean im Pool im Leerlauf befinden kann, bevor sie aus dem Pool entfernt wird. Nach diesem Zeitraum wird die Bean zerst&ouml;rt. Der Wert 0 bedeutet, dass sich eine Bean zeitlich unbegrenzt im Leerlauf befinden kann. Der Standardwert ist 600.</p>
</dd>
<dt>Max Cache Size (Maximale Zwischenspeichergr&ouml;&szlig;e)</dt>
<dd>
<p>Die maximale Anzahl an Beans, die im Zwischenspeicher vorhanden sein k&ouml;nnen. Erh&ouml;hen Sie die maximale Anzahl an Beans, die zwischengespeichert werden, um den Overhead f&uuml;r das Erstellen und Zerst&ouml;ren von Beans zu reduzieren. Beachten Sie jedoch, dass die Erh&ouml;hung des Cachewerts dazu f&uuml;hrt, dass der Server mehr Arbeitsspeicher und Ressourcen belegt. Stellen Sie sicher, dass die Betriebsumgebung die gew&auml;hlten Cacheeinstellungen unterst&uuml;tzt. Der Wert 0 bedeutet einen nicht gebundenen Zwischenspeicher. Der Standardwert lautet 512.</p>
</dd>
<dt>Umfang der Gr&ouml;&szlig;en&auml;nderungen des Caches</dt>
<dd>
<p>Die Anzahl an Beans, die passiviert werden sollen, wenn der Cache voll ist. Wenn die maximale Anzahl an zwischengespeicherten Beans erreicht ist, entfernt der Container eine bestimmte Anzahl an passivierten Beans aus dem Backupspeicher. Dieser Wert gibt zudem die Anzahl der Beans an, die erstellt werden m&uuml;ssen, wenn eine Anforderung eingeht und im Pool keine Beans verf&uuml;gbar sind. Der Wert muss gr&ouml;&szlig;er als 1 und kleiner als der Wert f&uuml;r die maximale Cachegr&ouml;&szlig;e sein. Der Standardwert lautet 32.</p>
</dd>
<dt>Timeout beim Entfernen</dt>
<dd>
<p>Die Anzahl Sekunden, nach der eine passivierte Bean aus dem Sessionspeicher entfernt wird. Der Wert 0 bedeutet, dass inaktive Beans vom Container nicht automatisch entfernt werden. Wenn der Wert f&uuml;r das Timeout beim Entfernen kleiner oder gleich dem Wert f&uuml;r die Cache-Leerlaufzeit ist, werden Beans ohne Passivieren sofort entfernt. Der Standardwert lautet 5400.</p>
</dd>
<dt>Policy f&uuml;r Auswahl beim Entfernen</dt>
<dd>
<p>Die Policy, gem&auml;&szlig; der der Container Session-Beans mit Status aus dem Cache entfernt. Folgende Optionen stehen zur Auswahl:</p>
<dl>
<dt>Nicht in j&uuml;ngerer Zeit verwendet (Not Recently Used (nru))&#65532;</dt>
<dd>
<p>Entfernt ein Bean, das in letzter Zeit nicht verwendet wurde. Dies ist der Standardwert.</p>
</dd>
<dt>Zuerst hereingekommen, zuerst weitergeleitet (First In First Out (fifo))</dt>
<dd>
<p>Entfernt die &auml;lteste Bean im Zwischenspeicher.</p>
</dd>
<dt>Zuletzt verwendet (Least Recently Used (lru))</dt>
<dd>
<p>Entfernt die zuletzt verwendete Bean.</p>
</dd>
</dl>
</dd>
<dt>Cache-Leerlaufzeit</dt>
<dd>
<p>Die maximale Anzahl Sekunden, die eine Bean im Cache im Leerlauf verbleiben kann. Nach diesem Zeitraum kann der Container dieses Bean passivieren. Der Wert 0 bedeutet, dass Beans nie f&uuml;r eine Passivierung in Frage kommen. Der Standardwert ist 600.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r den EJB-Container.</p>
<p>Eine Beschreibung der verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-ejbgeneralproperties.html">F&uuml;r den EJB-Container spezifische Eigenschaften</a>.</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">So werden EJB-Einstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="../../../ejb/de/help/missingtopic.html">So werden MDB-Pooleinstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="../../../ejb/de/help/missingtopic.html">To Configure the EJB Timer Service</a></p>
</li>
<li>
<p><a href="../../../ejb/de/help/missingtopic.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den EJB-Container konfiguriert</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<p>Keine.</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
