<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-storeproptab"></a><h4>Propri&#233;t&#233;s de stockage</h4>
<a name="indexterm-52"></a><a name="indexterm-53"></a><a name="indexterm-54"></a><p>Utilisez la page Propri&#233;t&#233;s de stockage pour ajouter ou modifier les propri&#233;t&#233;s
de persistance (stockage) de la session pour le conteneur Web.</p>

<p>La page Propri&#233;t&#233;s de stockage contient les options suivantes&#160;:</p>

<dl><dt>Nom de configuration</dt>
<dd><p>Le nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>R&#233;pertoire</dt>
<dd><p>Le chemin d&#8217;acc&#232;s absolu ou relatif du r&#233;pertoire dans lequel les fichiers de sessions individuelles sont enregistr&#233;s. La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/generated/jsp/j2ee-apps/</tt><i>appname</i><tt>/</tt><i>appname</i><tt>_war</tt>. Un chemin d&#8217;acc&#232;s relatif est relatif au r&#233;pertoire de travail temporaire pour cette application Web.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s de la zone de stockage. Le GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour la zone de stockage.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-webcontainergeneral.html">Configuration des propri&#233;t&#233;s g&#233;n&#233;rales du conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Configurer les propri&#233;t&#233;s de session pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Configurer les propri&#233;t&#233;s du gestionnaire pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Configurer les propri&#233;t&#233;s de stockage pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Pour configurer les param&#232;tres de disponibilit&#233; du conteneur Web</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
