<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-sessionproptab"></a><h4>Propri&#233;t&#233;s des sessions</h4>
<a name="indexterm-44"></a><a name="indexterm-45"></a><a name="indexterm-46"></a><p>La page Propri&#233;t&#233;s des sessions vous permet d&#8217;ajouter ou de modifier des
propri&#233;t&#233;s pour la session de conteneur Web.</p>

<p>La page Propri&#233;t&#233;s des sessions contient les options suivantes&#160;:</p>

<dl><dt>Charger les valeurs par d&#233;faut</dt>
<dd><p>Bouton permettant de restaurer les valeurs par d&#233;faut de tous les param&#232;tres.</p>

</dd>
<dt>Nom de configuration</dt>
<dd><p>Le nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>D&#233;lai d&#8217;expiration de la session</dt>
<dd><p>Sp&#233;cifie le nombre maximal de secondes pendant lesquelles une session inactive restera valide. Si la valeur est d&#233;finie sur 0 ou moins, les sessions n&#8217;expirent jamais. La valeur par d&#233;faut est 1800.</p>

</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s pour les sessions de conteneur Web. Pour obtenir une description des propri&#233;t&#233;s disponibles, consultez <a href="ref-websessionproperties.html">Propri&#233;t&#233;s sp&#233;cifiques aux sessions de conteneur Web</a>.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-webcontainergeneral.html">Configuration des propri&#233;t&#233;s g&#233;n&#233;rales du conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Configurer les propri&#233;t&#233;s de session pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Configurer les propri&#233;t&#233;s du gestionnaire pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Configurer les propri&#233;t&#233;s de stockage pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Pour configurer les param&#232;tres de disponibilit&#233; du conteneur Web</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
