<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-protocolssledit"></a><h4>SSL</h4>
<a name="indexterm-70"></a><a name="indexterm-71"></a><p>Utilisez la page SSL pour modifier les param&#232;tres SSL d&#8217;un protocole de
r&#233;seau. </p>

<p>Les param&#232;tres de cette page sont importants uniquement si la s&#233;curit&#233; est
activ&#233;e sur la page Modification de protocole. </p>

<p>La page SSL contient les options suivantes.</p>

<dl><dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>SSL3</dt>
<dd><p>Si cette case est s&#233;lectionn&#233;e, le protocole SSL3 est activ&#233; pour le protocole. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>TLS</dt>
<dd><p>Si cette case est s&#233;lectionn&#233;e, le protocole TLS est activ&#233; pour le protocole. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt></dt>
<dt>Authentification client</dt>
<dd><p>Si cette case est coch&#233;e, les clients doivent s&#8217;identifier sur le serveur &#224; chaque requ&#234;te. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Surnom du certificat</dt>
<dd><p>Surnom du certificat du serveur dans la base de donn&#233;es des certificats ou jeton PKCS n° 11. Dans le certificat, le format du nom est <tt><i> nom du jeton</i>:<i>surnom</i></tt>. M&#234;me la partie <tt><i>nom du jeton</i>:</tt> du nom de cet attribut est facultatif. </p>

</dd>
<dt>Key Store</dt>
<dd><p>Nom du fichier keystore (par exemple, <tt>keystore.jks </tt>).</p>

</dd>
<dt>Algorithme de confiance</dt>
<dd><p>Nom de l&#8217;algorithme de gestion de confiance (par exemple, PKIX) &#224; utiliser pour la validation du chemin de certification.</p>

</dd>
<dt>Longueur max. du certificat</dt>
<dd><p>Nombre maximum des certificats interm&#233;diaires non auto-&#233;mis pouvant exister dans un chemin de certification. Ce champ est utilis&#233; uniquement si le champ Algorithme de confiance est d&#233;fini &#224; PKIX. Z&#233;ro (0) implique que le chemin peut contenir un seul certificat. -1 implique que la longueur du chemin est illimit&#233;e (pas de maximum). La d&#233;finition d&#8217;une valeur &#224; moins de -1 entra&#238;ne l&#8217;&#233;mission d&#8217;une exception.</p>

</dd>
<dt>Trust Store</dt>
<dd><p>Nom du fichier truststore (par exemple, <tt>cacerts.jks </tt>).</p>

</dd>
<dt>Suites de chiffrement</dt>
<dd><p>Zone o&#249; vous pouvez ajouter ou supprimer des suites de chiffrement. Si vous n&#8217;ajoutez pas de suite de chiffrement, toutes les suites seront utilis&#233;es.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-protocolnew.html">Cr&#233;ation d'un protocole</a></p>

</li>
<li><p><a href="task-protocoledit.html">Modification d'un protocole</a></p>

</li>
<li><p><a href="task-protocolssledit.html">Modifier les param&#232;tres SSL d'un protocole </a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">Modifier les param&#232;tres HTTP pour un protocole </a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">Modifier les param&#232;tres de cache de fichiers pour un protocole</a></p>

</li>
<li><p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-protocol-1"><tt>create-protocol</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-protocols-1"><tt>list-protocols</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-protocol-1"><tt>delete-protocol</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
