<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-transportedit"></a><h4>Modifiez le transport</h4>
<a name="indexterm-78"></a><p>Utilisez la page Modifiez le transport pour modifier les param&#232;tres d&#8217;un transport
existant.</p>

<p>La page Modifiez le transport contient les options suivantes.</p>

<dl><dt>Restaurer les valeurs par d&#233;faut</dt>
<dd><p>Bouton de restauration des valeurs par d&#233;faut des param&#232;tres qui ont des valeurs par d&#233;faut. Les param&#232;tres qui n'ont pas de valeurs par d&#233;faut ne sont pas modifi&#233;s.</p>

</dd>
<dt>Nom de la configuration</dt>
<dd><p>Nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>Nom</dt>
<dd><p>Le nom du transport. Le champ Nom est en lecture seule. Vous pouvez sp&#233;cifier le nom uniquement lorsque vous cr&#233;ez un nouveau transport.</p>

</dd>
<dt>Nom de classe</dt>
<dd><p>Le nom de classe de l&#8217;impl&#233;mentation du transport. La valeur par d&#233;faut est <tt>com.sun.grizzly.TCPSelectorHandler</tt>.</p>

</dd>
<dt>Gestionnaires de cl&#233; de s&#233;lection</dt>
<dd><p>Le nom de classe du gestionnaire cl&#233; de s&#233;lection. Le gestionnaire de cl&#233; de s&#233;lection est une classe abstraite qui g&#232;re le cycle de vie des touches de s&#233;lection. Si vous ne sp&#233;cifiez pas une valeur, une impl&#233;mentation par d&#233;faut est utilis&#233;e. </p>

</dd>
<dt>Type de tampon de byte</dt>
<dd><p>Le type de <tt>tampon d&#8217;octet</tt> &#224; utiliser. Les choix disponibles sont <tt>HEAP</tt> et <tt>DIRECT</tt>. La valeur par d&#233;faut est <tt>HEAP</tt>.</p>

</dd>
<dt>Threads accepteur</dt>
<dd><p>Le nombre de processeurs dans la machine. Une valeur de -1 indique que Grizzly &#233;valuera le nombre de threads accepteur lui-m&#234;me, en fonction du nombre de processeurs de la machine. La valeur par d&#233;faut est 1. </p>

<p>Pour d&#233;finir le nombre de threads de traitement des requ&#234;tes, d&#233;finissez la valeur Taille max. du pool de threads du pool de threads utilis&#233; par un auditeur de r&#233;seau qui utilise ce transport. </p>

</dd>
<dt>Nombre max. de connexions</dt>
<dd><p>Le nombre maximal de connexions en attente sur un auditeur de r&#233;seau qui utilise ce transport. La valeur par d&#233;faut est 4096.</p>

</dd>
<dt>Taille du tampon</dt>
<dd><p>La taille (en octets) du tampon &#224; fournir pour les flux d&#8217;entr&#233;e cr&#233;&#233;s par un auditeur de r&#233;seau qui utilise ce transport. La valeur par d&#233;faut est 8192.</p>

</dd>
<dt>D&#233;lai d&#8217;expiration de la cl&#233; d&#8217;inactivit&#233;</dt>
<dd><p>Le d&#233;lai (en secondes) apr&#232;s lequel la cl&#233; d&#8217;inactivit&#233; sera annul&#233;e et le canal ferm&#233;. La valeur par d&#233;faut est 30.</p>

</dd>
<dt>D&#233;lai d&#8217;expiration de lecture</dt>
<dd><p>Le d&#233;lai (en millisecondes) pendant lequel GlassFish Server patiente lors de la phase d&#8217;analyse de l&#8217;en-t&#234;te et du corps d&#8217;une op&#233;ration de lecture. La valeur par d&#233;faut est 30000.</p>

</dd>
<dt>D&#233;lai d&#8217;expiration de l&#8217;interrogation du s&#233;lecteur</dt>
<dd><p>Le d&#233;lai (en millisecondes) pendant lequel un s&#233;lecteur NIO bloque l&#8217;attente d&#8217;&#233;v&#233;nements (requ&#234;tes utilisateur). La valeur par d&#233;faut est 1000.</p>

</dd>
<dt>D&#233;lai d&#8217;expiration d&#8217;&#233;criture</dt>
<dd><p>Le d&#233;lai (en millisecondes) pendant lequel GlassFish Server patiente avant de consid&#233;rer le client distant d&#233;connect&#233; lors de l&#8217;&#233;criture de la r&#233;ponse. La valeur par d&#233;faut est 30000.</p>

</dd>
<dt>Configuration de l&#8217;affichage</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, la configuration interne de Grizzly est purg&#233;e vers les journaux du serveur. Cette option peut fournir des informations int&#233;ressantes pour le d&#233;bogage. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Snoop</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, les informations requ&#234;te/r&#233;ponse sont purg&#233;es vers le journal du serveur. Cette option peut fournir des informations int&#233;ressantes pour le d&#233;bogage, mais peut r&#233;duire consid&#233;rablement les performances. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Aucun d&#233;lai TCP</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, TCP_NODELAY (&#233;galement appel&#233; l&#8217;algorithme de Nagle) est activ&#233;. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-transportnew.html">Cr&#233;er un transport</a></p>

</li>
<li><p><a href="task-transportedit.html">Modifier un transport</a></p>

</li>
<li><p><a href="task-transportdelete.html">Supprimer un transport</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li>
<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-transport-1"><tt>create-transport</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-transports-1"><tt>list-transports</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-transport-1"><tt>delete-transport</tt>(1)</a></p>

</li></ul>
</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
