<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-accesslog"></a><h4>Service HTTP</h4>
<a name="indexterm-55"></a><a name="indexterm-56"></a><p>Utilisez la page Service HTTP pour sp&#233;cifier la strat&#233;gie g&#233;n&#233;rale de journal
d&#8217;acc&#232;s pour les applications Web.</p>

<p>Le service HTTP offre des fonctions pour le d&#233;ploiement des applications Web
et pour permettre aux clients HTTP d&#8217;acc&#233;der aux applications Web d&#233;ploy&#233;es, avec
des serveurs virtuels, des pools de threads et la fonction de configuration
r&#233;seau.</p>

<p>GlassFish Server utilise le journal d&#8217;acc&#232;s du service HTTP pour activer et
configurer la rotation des journaux d&#8217;acc&#232;s pour les serveurs virtuels. Ces journaux
sont situ&#233;s dans le r&#233;pertoire <tt><i>domain-dir</i>/logs/access</tt> et sont nomm&#233;s comme suit :
<tt><i>virtual_server_name</i>_access_log.<i>aaaaMMjj</i>-<i>HH</i>h<i>mm</i>m<i>ss</i>s.txt</tt></p>

<p>La page Service HTTP contient les options suivantes.</p>

<dl><dt>Charger les valeurs par d&#233;faut</dt>
<dd><p>Bouton permettant de restaurer les valeurs par d&#233;faut de tous les param&#232;tres.</p>

</dd>
<dt>Nom de configuration</dt>
<dd><p>Le nom de la configuration &#224; laquelle les param&#232;tres de cette page s'appliquent. Ce champ est en lecture seule.</p>

</dd>
<dt>SSO</dt>
<dd><p>D&#233;termine si la connexion unique est activ&#233;e par d&#233;faut pour toutes les applications Web sur tous les serveurs virtuels de ce serveur qui sont configur&#233;s pour le m&#234;me domaine. Si cette option n&#8217;est pas activ&#233;e, la connexion unique est d&#233;sactiv&#233;e par d&#233;faut pour tous les serveurs virtuels et les utilisateurs doivent s&#8217;authentifier s&#233;par&#233;ment pour chaque application sur chaque serveur virtuel. Vous pouvez annuler ce param&#232;tre pour un serveur virtuel. La connexion unique peut &#234;tre activ&#233;e ou d&#233;sactiv&#233;e. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Journalisation des acc&#232;s</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, la journalisation des acc&#232;s est activ&#233;e pour tous les sous-&#233;l&#233;ments de serveur virtuel qui ne sp&#233;cifient pas cette propri&#233;t&#233;. Si cette option n&#8217;est pas s&#233;lectionn&#233;e, ceci d&#233;sactive la journalisation des acc&#232;s pour tous les sous-&#233;l&#233;ments de serveur virtuel qui ne sp&#233;cifient pas cette propri&#233;t&#233;. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Rotation</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, la rotation du fichier journal est activ&#233;e. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Strat&#233;gie de rotation</dt>
<dd><p>La seule strat&#233;gie de rotation disponible est <tt>time</tt>.</p>

</dd>
<dt>Intervalle de rotation</dt>
<dd><p>Nombre de minutes entre les rotations du journal d&#8217;acc&#232;s. Ce champ est valide uniquement si l&#8217;option Strat&#233;gie de rotation est d&#233;finie sur <tt>time</tt>. La valeur par d&#233;faut est 1440 minutes (24 heures).</p>

</dd>
<dt>Suffixe de rotation</dt>
<dd><p>Valeur de cha&#238;ne &#224; ajouter &#224; la fin du nom du fichier journal apr&#232;s la rotation. La valeur par d&#233;faut est <tt>yyyy-MM-dd</tt>.</p>

<p>Assurez-vous que le suffixe de rotation contient suffisamment de valeurs pour cr&#233;er un suffixe unique pour chaque rotation de journal. Par exemple, si plus d&#8217;une rotation par jour est appliqu&#233;e au journal d&#8217;acc&#232;s, ajoutez l&#8217;heure dans le suffixe de rotation.</p>

<p>Le suffixe doit &#234;tre unique pour s&#8217;assurer qu&#8217;une rotation est appliqu&#233;e au fichier du journal d&#8217;acc&#232;s chaque fois que l&#8217;intervalle de rotation arrive &#224; son terme. Si le suffixe de rotation du nouveau fichier du journal d&#8217;acc&#232;s est le m&#234;me que celui du fichier du journal d&#8217;acc&#232;s existant, aucune rotation n&#8217;est appliqu&#233;e au fichier.</p>

</dd>
<dt>Nombre max. de fichiers</dt>
<dd><p>Nombre maximal de fichiers journaux d&#8217;acc&#232;s en rotation devant &#234;tre conserv&#233;s. Une valeur n&#233;gative signifie qu&#8217;il n&#8217;y a pas de limite pour le nombre de fichiers. La valeur par d&#233;faut est &#8211;1.</p>

</dd>
<dt>Taille du tampon</dt>
<dd><p>La taille, en octets, du tampon de journal d&#8217;acc&#232;s ou une valeur inf&#233;rieure ou &#233;gale &#224; 0 pour les journaux d&#8217;acc&#232;s sans tampon. La valeur par d&#233;faut est 32768.</p>

</dd>
<dt>Intervalle de suppression</dt>
<dd><p>Nombre de secondes &#233;coul&#233;es avant l&#8217;&#233;criture du journal sur le disque. Le journal d&#8217;acc&#232;s est &#233;crit lorsque le tampon est satur&#233; ou que l&#8217;intervalle expire. Si la valeur est inf&#233;rieure ou &#233;gale &#224; 0, le tampon est toujours &#233;crit m&#234;me s&#8217;il n&#8217;est pas plein. Autrement dit, chaque fois que l&#8217;utilisateur acc&#232;de au serveur, le message journal est directement enregistr&#233; dans le fichier. La valeur par d&#233;faut est 300.</p>

</dd>
<dt>Format</dt>
<dd><p>Valeur de cha&#238;ne qui pr&#233;cise les informations &#224; enregistrer dans le journal d&#8217;acc&#232;s et l&#8217;ordre d&#8217;enregistrement. La valeur par d&#233;faut est la suivante :</p>

<pre>%client.name% %auth-user-name% %datetime% %request% %status% %response.length%</pre><p>Les valeurs suivantes peuvent &#234;tre incluses dans la cha&#238;ne de format :</p>

<dl><dt><tt>%attribute.<i>name</i>%</tt></dt>
<dd><p>Enregistre la valeur (en appelant sa m&#233;thode <tt>toString</tt>) de l&#8217;attribut de requ&#234;te avec le <i>nom</i> sp&#233;cifi&#233;</p>

</dd>
<dt><tt>%auth-user-name%</tt></dt>
<dd><p>Nom de l&#8217;utilisateur autoris&#233;</p>

</dd>
<dt><tt>%client.name%</tt></dt>
<dd><p>Nom de l&#8217;h&#244;te client</p>

</dd>
<dt><tt>%client.dns%</tt></dt>
<dd><p>Client DNS</p>

</dd>
<dt><tt>%cookie.<i>name</i>%</tt></dt>
<dd><p>La valeur du cookie de la requ&#234;te portant le <i>nom</i> sp&#233;cifi&#233;</p>

</dd>
<dt><tt>%cookie.value%</tt></dt>
<dd><p>La valeur du premier cookie d&#233;tect&#233; dans la requ&#234;te </p>

</dd>
<dt><tt>%datetime%</tt></dt>
<dd><p>Date du syst&#232;me</p>

</dd>
<dt><tt>%request%</tt></dt>
<dd><p>Ligne de requ&#234;te HTTP compl&#232;te</p>

</dd>
<dt><tt>%status%</tt></dt>
<dd><p>Statut</p>

</dd>
<dt><tt>%response.length%</tt></dt>
<dd><p>Longueur du contenu de la r&#233;ponse</p>

</dd>
<dt><tt>%header.referer%</tt></dt>
<dd><p>En-t&#234;te de r&#233;f&#233;rent</p>

</dd>
<dt><tt>%header.user-agent%</tt></dt>
<dd><p>En-t&#234;te agent utilisateur</p>

</dd>
<dt><tt>%http-method%</tt></dt>
<dd><p>M&#233;thode HTTP</p>

</dd>
<dt><tt>%http-uri%</tt></dt>
<dd><p>URI HTTP</p>

</dd>
<dt><tt>%query-str%</tt></dt>
<dd><p>Cha&#238;ne de requ&#234;te HTTP</p>

</dd>
<dt><tt>%http-version%</tt></dt>
<dd><p>Version du protocole HTTP</p>

</dd>
<dt><tt>%header.accept%</tt></dt>
<dd><p>En-t&#234;te d&#8217;acceptation</p>

</dd>
<dt><tt>%header.date%</tt></dt>
<dd><p>En-t&#234;te de date</p>

</dd>
<dt><tt>%header.if-mod-since%</tt></dt>
<dd><p>En-t&#234;te Si modifi&#233; depuis</p>

</dd>
<dt><tt>%header.auth%</tt></dt>
<dd><p>En-t&#234;te d&#8217;autorisation</p>

</dd>
<dt><tt>%header.<i>any</i>%</tt></dt>
<dd><p>Toute valeur d&#8217;en-t&#234;te HTTP valide d&#233;finie dans RFC 2616 (<tt>any</tt> est &#233;galement une valeur d&#8217;en-t&#234;te valide ; elle est indiqu&#233;e ici en tant que variable)</p>

</dd>
<dt><tt>%session.<i>name</i>%</tt></dt>
<dd><p>La valeur de l&#8217;attribut de session avec le nom <i>name</i>, ou le nom <tt>NULL-session-attribute-<i></i></tt> si l&#8217;attribut sp&#233;cifi&#233; n&#8217;existe pas dans la session, ou <tt>NULL-session</tt> si aucune session existe</p>

</dd>
<dt><tt>%time-taken%</tt></dt>
<dd><p>Dur&#233;e (en millisecondes) de traitement de chaque requ&#234;te </p>

</dd>
<dt><tt>%vs.id%</tt></dt>
<dd><p>ID serveur virtuel</p>

</dd>
</dl>
</dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Propri&#233;t&#233;s suppl&#233;mentaires du service HTTP. Pour une description des propri&#233;t&#233;s disponibles, reportez-vous &#224; la rubrique <a href="ref-httpserviceprops.html">Propri&#233;t&#233;s sp&#233;cifiques au service HTTP</a>.</p>

</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-accesslog.html">Configurer le service HTTP</a></p>

</li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
