<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-webcontaineravailability"></a><h4>Pour configurer les param&#232;tres de disponibilit&#233; du conteneur Web</h4><a name="indexterm-12"></a><a name="indexterm-13"></a><a name="indexterm-14"></a><a name="indexterm-15"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez la configuration &#224; modifier. </b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Service de disponibilit&#233;.</b><p>La page Service de disponibilit&#233; s'ouvre.</p></li>
<li><b>Sur la page Service de disponibilit&#233;, cliquez sur l'onglet Disponibilit&#233; du conteneur
Web. </b><p>La page correspondante s'ouvre.</p></li>
<li><b>Dans le champ Service de disponibilit&#233;, cochez la case Activ&#233; pour activer
la disponibilit&#233; du conteneur Web. </b><p>Pour d&#233;sactiver la disponibilit&#233;, d&#233;cochez la case Service de disponibilit&#233; activ&#233;.</p></li>
<li><b>Dans la liste d&#233;roulante Type de persistance, s&#233;lectionnez le m&#233;canisme de persistance.</b><ul>
<li><b>Si le service de disponibilit&#233; n'est <b>pas</b> activ&#233;, s&#233;lectionnez l'un des &#233;l&#233;ments
suivants&#160;:</b>
<ul><li><p><tt>memory</tt> pour n'utiliser aucune persistance de session </p>

</li>
<li><p><tt>file</tt> pour utiliser une persistance de session bas&#233;e sur le syst&#232;me de fichiers n'&#233;tant pas hautement disponible </p>

</li></ul>
</li>
<li><b>Si le service de disponibilit&#233; est activ&#233;, s&#233;lectionnez <tt>replicated</tt> pour utiliser la
persistance de session bas&#233;e sur le basculement du cluster hautement disponible. </b></li></ul></li>
<li><b>Dans la liste d&#233;roulante Fr&#233;quence de la persistance, s&#233;lectionnez la fr&#233;quence de
stockage de la session HTTP&#160;:</b>
<ul><li><p><tt>web-method</tt>&#160;: l'&#233;tat de la session est stock&#233; &#224; la fin de chaque requ&#234;te Web avant l'envoi d'une r&#233;ponse au client. Ce mode est la meilleure garantie que l&#8217;&#233;tat de la session sera enti&#232;rement r&#233;actualis&#233; en cas de panne. Il s&#8217;agit de la valeur par d&#233;faut.</p>

</li>
<li><p><tt>time-based</tt>&#160;: l'&#233;tat de la session est stock&#233; en arri&#232;re-plan selon la fr&#233;quence d&#233;finie par le param&#232;tre Intervalle de suppression. Pour plus d'informations sur ce param&#232;tre, voir <a href="task-webcontainermanagerprops.html">Configurer les propri&#233;t&#233;s du gestionnaire pour le conteneur Web</a>. </p>

<p>Ce mode ne garantit pas la mise &#224; jour compl&#232;te de l'&#233;tat de la session. Toutefois, les performances peuvent &#234;tre am&#233;lior&#233;es de mani&#232;re significative car l&#8217;&#233;tat n&#8217;est pas stock&#233; apr&#232;s chaque requ&#234;te.</p>

</li></ul>
<p>L'option Fr&#233;quence de la persistance n'est applicable que si le type de
persistance est <tt>replicated</tt>.  </p></li>
<li><b>Dans la liste d&#233;roulante Port&#233;e de la persistance, s&#233;lectionnez l'&#233;tendue des modifications
de session HTTP n&#233;cessaires pour le stockage&#160;: </b>
<ul><li><p><tt>session</tt>&#160;: l'&#233;tat de la session est stock&#233; int&#233;gralement &#224; chaque fois. Ce mode est la meilleure garantie que vos donn&#233;es de session seront correctement stock&#233;es pour n&#8217;importe quelle application Web distribuable.</p>

</li>
<li><p><tt>modified-session</tt>&#160;: l'&#233;tat de la session est stock&#233; int&#233;gralement s'il a &#233;t&#233; modifi&#233;. Une session est consid&#233;r&#233;e comme ayant &#233;t&#233; modifi&#233;e si <tt>HttpSession.setAttribute() </tt> ou <tt>HttpSession.removeAttribute()</tt> a &#233;t&#233; appel&#233;. Vous devez vous assurer que <tt> setAttribute()</tt> est appel&#233; chaque fois qu&#8217;un attribut est modifi&#233;. Cette exigence n&#8217;est pas requise par la sp&#233;cification Java EE, mais elle est n&#233;cessaire pour que ce mode fonctionne correctement.</p>

</li>
<li><p><tt>modified-attribute</tt>&#160;: seuls les attributs de session modifi&#233;s sont stock&#233;s. Pour que ce mode fonctionne correctement, suivez les recommandations ci-dessous&#160;:</p>


<ul><li><p>Appelez <tt>setAttribute()</tt> &#224; chaque modification de l'&#233;tat de la session.</p>

</li>
<li><p>Veillez &#224; ce qu&#8217;il n&#8217;y ait pas de r&#233;f&#233;rences crois&#233;es entre les attributs. Le graphe des objets sous chaque cl&#233; d&#8217;attribut distincte est s&#233;rialis&#233; et stock&#233; s&#233;par&#233;ment. S&#8217;il existe des r&#233;f&#233;rences crois&#233;es entre les objets sous chaque cl&#233; individuelle, ceux-ci ne seront pas s&#233;rialis&#233;s ni d&#233;s&#233;rialis&#233;s correctement.</p>

</li>
<li><p>R&#233;partissez l&#8217;&#233;tat de la session entre plusieurs attributs, ou au moins entre un attribut en lecture seule et un attribut modifiable.</p>

</li></ul>
</li></ul>
<p>Port&#233;e de la persistance n'est applicable que si le type de persistance
est <tt>replicated</tt>.  </p></li>
<li><b>Dans le champ &#201;tat Connexion Unique, cochez la case Activ&#233; pour rendre
l'&#233;tat de connexion unique disponible pour le basculement. </b><p>Pour rendre l'&#233;tat de connexion unique indisponible pour le basculement, d&#233;sactivez la
case &#201;tat Connexion unique. </p></li>
<li><b>Pour restaurer les valeurs par d&#233;faut de tous les param&#232;tres, cliquez sur
le bouton Charger les valeurs par d&#233;faut. </b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; de disponibilit&#233; du conteneur Web.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-webcontainergeneral.html">Configuration des propri&#233;t&#233;s g&#233;n&#233;rales du conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Configurer les propri&#233;t&#233;s de session pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Configurer les propri&#233;t&#233;s du gestionnaire pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Configurer les propri&#233;t&#233;s de stockage pour le conteneur Web</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
