<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-virtualserveredit"></a><h4>Modifier un serveur virtuel</h4><a name="indexterm-19"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Serveurs virtuels.</b><p>La page Serveurs virtuels s&#8217;ouvre.</p></li>
<li><b>Sur la page Serveurs virtuels, cliquez sur le nom du serveur virtuel
que vous modifiez.</b><p>La page Modification du serveur virtuel s&#8217;ouvre.</p></li>
<li><b>Dans le champ H&#244;tes, entrez les noms d&#8217;h&#244;te ou les adresses IP
de la machine sur laquelle le serveur s&#8217;ex&#233;cute.</b><p>Utilisez des noms d&#8217;h&#244;te r&#233;els ou virtuels enregistr&#233;s dans le serveur DNS
pour votre r&#233;seau (et, sous UNIX, dans votre fichier <tt>/etc/hosts</tt>). La valeur
par d&#233;faut est la valeur de propri&#233;t&#233; syst&#232;me <tt>${com.sun.aas.hostName}</tt>.</p></li>
<li><b>S&#233;lectionnez une option &#201;tat pour le serveur virtuel.</b><p>La valeur peut &#234;tre l&#8217;une des suivantes&#160;:</p><dl><dt>Activ&#233;</dt>
<dd><p>Le serveur virtuel est actif. Il s&#8217;agit de la valeur par d&#233;faut.</p>

</dd>
<dt>D&#233;sactiv&#233;</dt>
<dd><p>Le serveur virtuel est inactif. Les tentatives d&#8217;acc&#232;s au serveur renvoient le code d&#8217;erreur 404 (ressource non disponible).</p>

</dd>
<dt>D&#233;sactiv&#233;</dt>
<dd><p>Le serveur virtuel est d&#233;sactiv&#233;. Les tentatives d&#8217;acc&#232;s au serveur renvoient le code d&#8217;erreur 403 (refus d&#8217;ex&#233;cuter la requ&#234;te).</p>

</dd>
</dl>
</li>
<li><b>S&#233;lectionnez une option SSO pour le nouveau serveur virtuel.</b><p>Par d&#233;faut, un serveur virtuel h&#233;rite du param&#232;tre de connexion unique (SSO)
du service HTTP. S&#233;lectionnez Activ&#233; ou D&#233;sactiv&#233; pour annuler le param&#232;tre du
service HTTP en activant ou en d&#233;sactivant la connexion unique pour ce
serveur virtuel. </p><p>La connexion unique d&#8217;une application &#224; l&#8217;autre dans GlassFish Server est prise
en charge par les servlets et les fichiers JSP. Cette fonction permet
&#224; plusieurs applications exigeant les m&#234;mes informations de connexion utilisateur de partager
ces derni&#232;res au lieu de contraindre l&#8217;utilisateur &#224; s&#8217;authentifier s&#233;par&#233;ment pour chaque
application. </p></li>
<li><b>Dans la liste Auditeurs de r&#233;seau, s&#233;lectionnez un ou plusieurs auditeurs de
r&#233;seau, ou laissez le champ vide. </b></li>
<li><b>Dans la liste d&#233;roulante Module Web par d&#233;faut, s&#233;lectionnez le module devant
r&#233;pondre &#224; toutes les requ&#234;tes qui ne peuvent pas &#234;tre mapp&#233;es vers
les autres modules Web d&#233;ploy&#233;s sur le serveur virtuel.</b><p>Si aucun module Web par d&#233;faut n&#8217;est sp&#233;cifi&#233;, le module Web qui
poss&#232;de une racine contexte vide est utilis&#233;. S&#8217;il n&#8217;existe aucun module Web
avec une racine contexte vide, un module Web par d&#233;faut du syst&#232;me
est cr&#233;&#233; et utilis&#233;.</p></li>
<li><b>Dans le champ Fichier journal, saisissez le nom de chemin du fichier
o&#249; les messages de journalisation provenant de ce serveur virtuel doivent appara&#238;tre.</b><p>Par d&#233;faut, des messages de journalisation sont envoy&#233;s au journal du serveur
par d&#233;faut, <tt></tt><i>domain-dir</i><tt>/logs/server.log</tt>.</p></li>
<li><b>Dans le champ Docroot, entrez le chemin absolu du r&#233;pertoire racine de
documents sur le serveur.</b><p>La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/docroot</tt>.</p></li>
<li><b>S&#233;lectionnez l&#8217;option Journalisation de l&#8217;acc&#232;s pour activer ou d&#233;sactiver la journalisation des
acc&#232;s.</b><p>Par d&#233;faut, un serveur virtuel h&#233;rite du param&#232;tre de journalisation d&#8217;acc&#232;s du
service HTTP. S&#233;lectionnez Activ&#233; ou D&#233;sactiv&#233; pour annuler le param&#232;tre du service
HTTP en activant ou en d&#233;sactivant la journalisation d&#8217;acc&#232;s pour ce serveur
virtuel. </p></li>
<li><b>Dans le champ R&#233;pertoire, entrez le chemin absolu des journaux d&#8217;acc&#232;s du
serveur.</b><p>La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/logs/access</tt>.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez les autres propri&#233;t&#233;s du serveur virtuel.</b><p>Pour obtenir des informations sur les propri&#233;t&#233;s disponibles, consultez <a href="ref-virtualserverprops.html">Propri&#233;t&#233;s sp&#233;cifiques aux serveurs virtuels</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-virtualservercreate.html">Cr&#233;er un serveur virtuel</a></p>

</li>
<li><p><a href="task-virtualserverdelete.html">Supprimer un serveur virtuel</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
