<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-threadpooledit"></a><h4>Modification d&#8217;un pool de threads</h4><a name="indexterm-37"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Pools de threads.</b><p>La page Pools de threads s&#8217;affiche.</p></li>
<li><b>Dans la page Pools de threads, cliquez sur le nom du pool
de threads &#224; modifier.</b><p>La page Modification du pool de threads s&#8217;affiche.</p></li>
<li><b>Sur la page Modification d&#8217;un pool de threads, dans le champ Nom
de classe, saisissez le nom qualifi&#233; complet de la classe qui impl&#233;mente
le pool de thread.</b><p>La valeur par d&#233;faut est <tt>com.sun.grizzly.http.StatsThreadPool</tt>.</p></li>
<li><b>Dans le champ Taille Maximum de file d&#8217;attente, saisissez le nombre maximal
de messages pouvant &#234;tre mis en attente, jusqu&#8217;&#224; ce que des threads
soient disponibles pour les traiter. </b><p>Une valeur de -1 signifie que la taille de la file d&#8217;attente
est illimit&#233;e. La valeur par d&#233;faut est 4096.</p></li>
<li><b>Dans le champ Taille max. du pool de threads, saisissez le plus
grand nombre de threads pouvant exister dans le pool de threads.</b><p>La valeur par d&#233;faut est 5. Il s&#8217;agit de la valeur recommand&#233;e
pour les pools de threads du listener r&#233;seau.</p></li>
<li><b>Dans le champ Taille min. du pool de threads, saisissez le plus
petit nombre de threads pouvant exister dans le pool de threads.</b><p>Ces threads sont cr&#233;&#233;s lorsque le pool de thread est instanci&#233;. La
valeur par d&#233;faut est 2.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;expiration de thread inactif, saisissez le d&#233;lai maximal,
en secondes, durant lequel un thread peut demeurer inactif dans le pool.</b><p>Une fois ce d&#233;lai expir&#233;, le thread est supprim&#233; du pool. La
valeur par d&#233;faut est 900.</p></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-threadpoolnew.html">Cr&#233;ation d'un pool de threads</a></p>

</li>
<li><p><a href="task-threadpooldelete.html">Suppression d'un pool de threads</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
