<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-protocolnew"></a><h3>Cr&#233;ation d&#8217;un protocole</h3><a name="indexterm-24"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud Config r&#233;seau.</b></li>
<li><b>Sous le n&#339;ud Configuration de r&#233;seau, s&#233;lectionnez le n&#339;ud Protocoles.</b><p>La page Protocoles s&#8217;affiche.</p></li>
<li><b>Sur la page Protocoles, cliquez sur Nouveau.</b><p>La page Nouveau protocole s&#8217;affiche.</p></li>
<li><b>Dans le champ Nom, saisissez un nom unique pour le protocole.</b></li>
<li><b>Cochez la case S&#233;curit&#233; activ&#233;e pour activer la s&#233;curit&#233; pour le protocole.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut. Si vous activez la s&#233;curit&#233;, vous
pouvez utiliser l&#8217;onglet SSL de la page Modification de protocole pour modifier
les param&#232;tres de s&#233;curit&#233;. </p></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer le cache de fichiers.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ &#194;ge max., entrez la dur&#233;e de vie maximale, en
secondes, pour une entr&#233;e de cache valide.</b><p>Ce param&#232;tre d&#233;termine comment des informations en cache depuis un certain temps
sont utilis&#233;es apr&#232;s la mise en cache d&#8217;un fichier. Une entr&#233;e ant&#233;rieure
&#224; l&#8217;&#226;ge maximal est remplac&#233;e par une nouvelle entr&#233;e pour le m&#234;me
fichier. Si le contenu change rarement, augmentez cette valeur pour am&#233;liorer les
performances.</p><p>L&#8217;&#226;ge maximal optimal d&#233;pend de la fr&#233;quence &#224; laquelle les fichiers existants
sont modifi&#233;s. Par exemple, si les fichiers sont modifi&#233;s quatre fois par
jour &#224;&#160;intervalles r&#233;guliers, vous pouvez d&#233;finir l&#8217;&#226;ge maximal sur 21600 secondes (6
heures). Sinon, pensez &#224; d&#233;finir l&#8217;&#226;ge maximal sur la p&#233;riode la plus
longue durant laquelle vous acceptez d&#8217;utiliser la version pr&#233;c&#233;dente d&#8217;un fichier apr&#232;s
sa modification.</p><p>La valeur par d&#233;faut est 30.</p></li>
<li><b>Dans le champ Taille max. du cache, saisissez la taille maximum totale
(en octets) du cache de fichiers sur le disque.</b><p>La valeur par d&#233;faut est 10485760.</p></li>
<li><b>Dans le champ Nb max. de fichiers, saisissez le nombre maximal de
fichiers pouvant &#234;tre stock&#233;s dans le cache de fichiers.</b><p>Si la valeur est trop &#233;lev&#233;e, le serveur met en cache les
fichiers peu utiles qui consomment de la m&#233;moire. Si elle est trop
faible, vous perdez l&#8217;avantage de la mise en cache. Testez diff&#233;rentes valeurs
de cet attribut pour rechercher la solution optimale pour des applications sp&#233;cifiques.</p><p>La valeur par d&#233;faut est 1024.</p></li>
<li><b>Dans le champ Nom du serveur, saisissez le nom d&#8217;h&#244;te &#224; utiliser
dans les URL envoy&#233;es au client par le serveur.</b><p>Ce nom est l&#8217;alias si votre serveur en utilise un. Si votre
serveur n&#8217;utilise aucun alias, laissez ce champ vide.</p><p>Cette valeur affecte les URL que le serveur g&#233;n&#232;re automatiquement ; elle
n&#8217;affecte pas les URL des r&#233;pertoires et des fichiers stock&#233;s dans le
serveur. Si votre serveur utilise un alias, le nom du serveur doit
&#234;tre le nom de l&#8217;alias. Si un signe deux-points et un num&#233;ro de
port sont ajout&#233;s, ce port est utilis&#233; dans les URL envoy&#233;s au
client par le serveur.</p></li>
<li><b>Dans la liste d&#233;roulante Serveur virtuel par d&#233;faut, s&#233;lectionnez le serveur virtuel
&#224; associer avec ce protocole.</b><p>La page Serveurs virtuels vous permet de d&#233;finir des serveurs virtuels.</p></li>
<li><b>Dans le champ Port de redirection, saisissez la valeur de port &#224;
utiliser pour rediriger une requ&#234;te vers un autre port. </b><p>GlassFish Server r&#233;achemine automatiquement la requ&#234;te si les deux conditions suivantes sont
remplies :</p>


<ul><li><p>L&#8217;auditeur de r&#233;seau qui r&#233;f&#233;rencie ce protocole prend en charge les requ&#234;tes non SSL.</p>

</li>
<li><p>Une requ&#234;te pour laquelle une contrainte de s&#233;curit&#233; correspondante requiert le transport SSL est re&#231;ue.</p>

</li></ul>
<p>Si aucun port de redirection n&#8217;est sp&#233;cifi&#233;, le GlassFish Server utilise le
num&#233;ro de port sp&#233;cifi&#233; dans la requ&#234;te d&#8217;origine. Par d&#233;faut, aucun port
n&#8217;est sp&#233;cifi&#233;. </p></li>
<li><b>Dans le champ Nombre max. de connexions, tapez le nombre maximum de
requ&#234;tes pouvant &#234;tre envoy&#233;es dans le pipeline jusqu&#8217;&#224; la fermeture de la connexion
par le serveur. </b><p>Le sous-syst&#232;me Keep-Alive interroge p&#233;riodiquement les connexions inactives. La valeur par d&#233;faut
est 256.</p><p>D&#233;finissez cette propri&#233;t&#233; sur 1 pour d&#233;sactiver la connexion Keep-Alive HTTP/1.0, ainsi
que la connexion Keep-Alive HTTP/1.1 et le pipelining. Une valeur de 0
signifie que les requ&#234;tes sont toujours rejet&#233;es. Une valeur de -1 indique que
le nombre de connexions persistantes est illimit&#233;.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;attente, entrez la dur&#233;e maximum (en secondes) pendant
laquelle une connexion peut &#234;tre consid&#233;r&#233;e comme inactive et conserv&#233;e &#224; l&#8217;&#233;tat
de persistance. </b><p>Une valeur de 0 ou moins signifie que les connexions persistantes sont
conserv&#233;es ouvertes ind&#233;finiment. La valeur par d&#233;faut est 30 secondes.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de D&#233;lai d&#8217;expiration du chargement pour activer la
fermeture de la connexion pour un servlet qui lit les octets lentement
une fois la limite de D&#233;lai d&#8217;expiration du chargement de la connexion
atteinte. </b><p>Si cette option est d&#233;sactiv&#233;e, les connexions servlet n&#8217;ont pas de d&#233;lai
d&#8217;expiration. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;expiration du chargement de la connexion, entrez le
d&#233;lai d&#8217;expiration pour les chargements, en milli&#232;mes de secondes.  </b><p>Ce champ est applicable uniquement si la case D&#233;sactiv&#233; du D&#233;lai d&#8217;expiration
du chargement est s&#233;lectionn&#233;e. La valeur par d&#233;faut est 300000 millisecondes.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;expiration de la requ&#234;te, saisissez le nombre de
secondes au bout desquelles une requ&#234;te expire.</b><p>Si la requ&#234;te n&#8217;est pas trait&#233;e avant d&#8217;atteindre la valeur de d&#233;lai
d&#8217;expiration, la requ&#234;te est ignor&#233;e. La valeur par d&#233;faut est 30 secondes.</p></li>
<li><b>Dans le champ Taille du tampon d&#8217;envoi, saisissez la taille (en octets)
du tampon d&#8217;envoi.</b><p>La valeur par d&#233;faut est 8192 octets.</p></li>
<li><b>Dans le champ Longueur du tampon d&#8217;en-t&#234;te, saisissez la taille (en octets)
du tampon utilis&#233; par les threads de traitement de requ&#234;te pour lire
les donn&#233;es de la requ&#234;te.</b><p>La valeur par d&#233;faut est 8192 octets.</p></li>
<li><b>Dans le champ Taille maximum des billets, tapez la taille maximale (en
octets) des actions POST. </b><p>La valeur par d&#233;faut est 2097152 octets.</p></li>
<li><b>Dans le champ Codage URI, tapez le nom du jeu de caract&#232;res utilis&#233;
pour d&#233;coder les URI de requ&#234;te re&#231;us. </b><p>La valeur doit &#234;tre un nom de jeu de caract&#232;res IANA valide.
La valeur par d&#233;faut est UTF-8.</p></li>
<li><b>Dans le champ Version, saisissez la version du protocole HTTP utilis&#233;.</b><p>La valeur par d&#233;faut est HTTP/1.1.</p></li>
<li><b>Compression &#224; partir de la liste d&#233;roulante, s&#233;lectionnez l'utilisation d'HTTP/1.1 compression gzip
pour enregistrer server bande passante. </b><p>Les choix disponibles sont les suivants :</p><dl><dt><tt>on</tt></dt>
<dd><p>Compresse les donn&#233;es.</p>

</dd>
<dt><tt>off</tt></dt>
<dd><p>D&#233;sactive la compression.</p>

</dd>
<dt><tt>force</tt></dt>
<dd><p>Force la compression des donn&#233;es dans tous les cas. </p>

</dd>
</dl>
<p>La valeur par d&#233;faut est <tt>off</tt>.</p></li>
<li><b>Dans le champ Types MIME compressibles, tapez une liste s&#233;par&#233;e par des
virgules de types MIME pour lesquels la compression HTTP est utilis&#233;e. </b><p>La valeur par d&#233;faut est <tt>text/html,text/xml,text/plain</tt>. </p></li>
<li><b>Dans le champ Taille minimum de compression, saisissez la taille minimale d&#8217;un
fichier lorsque la compression est appliqu&#233;e. </b><p>Cette valeur doit &#234;tre configur&#233;e si la compression est d&#233;finie sur <tt>on</tt>
ou <tt>force</tt>. La valeur par d&#233;faut est 2048 octets.</p></li>
<li><b>Dans le champ Agents utilisateur sans compression, tapez une liste s&#233;par&#233;e par
des virgules d&#8217;expressions r&#233;guli&#232;res correspondant &#224; des agents utilisateur de clients HTTP pour
lesquels la compression ne devrait pas &#234;tre utilis&#233;e. </b><p>Par d&#233;faut, cette valeur est une cha&#238;ne vide.</p></li>
<li><b>Dans le champ Agent utilisateur limit&#233;, tapez une liste des agents utilisateur
limit&#233;s sur lesquels la compression HTTP est appliqu&#233;e. </b><p>Si aucun utilisateur agent n&#8217;est sp&#233;cifi&#233;, la compression HTTP est appliqu&#233;e &#224;
tous les agents utilisateur. Par d&#233;faut, aucun utilisateur agent n&#8217;est sp&#233;cifi&#233;.</p></li>
<li><b>Dans le champ Type de r&#233;ponse par d&#233;faut, saisissez une cha&#238;ne qui
sp&#233;cifie le type de r&#233;ponse par d&#233;faut. </b><p>Le format est une cha&#238;ne s&#233;par&#233;e par des points-virgule pr&#233;sentant le type
de contenu (content-type), l&#8217;encodage, la langue et le jeu de caract&#232;res. La
valeur par d&#233;faut est <tt>text/html; charset=iso-8859-1</tt>.</p></li>
<li><b>Dans le champ Type de r&#233;ponse forc&#233;e, entrez une cha&#238;ne qui sp&#233;cifie
le type de requ&#234;te utilis&#233; si aucun mappage MIME est disponible correspondant
&#224; l&#8217;extension du fichier.</b><p>Le format est une cha&#238;ne s&#233;par&#233;e par des points-virgule pr&#233;sentant le type
de contenu (content-type), l&#8217;encodage, la langue et le jeu de caract&#232;res. La
valeur par d&#233;faut est <tt>text/html; charset=iso-8859-1</tt>.</p></li>
<li><b>Dans le champ Adaptateur, entrez le nom de classe de l&#8217;adaptateur de
ressources statiques. </b><p>La valeur par d&#233;faut est <tt>com.sun.grizzly.tcp.StaticResourcesAdapter</tt>.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Support Comet pour activer la prise en
charge de Comet pour l&#8217;auditeur de r&#233;seau qui r&#233;f&#233;rencie ce protocole. </b><p>Par d&#233;faut, cette option est d&#233;sactiv&#233;e. Si votre servlet ou votre page
JSP utilise la technologie Comet, assurez-vous qu&#8217;il ou elle est initialis&#233;(e) lorsque
GlassFish Server d&#233;marre en ajoutant l&#8217;&#233;l&#233;ment <tt>load-on-startup</tt> &#224; votre fichier <tt>web.xml</tt>. Exemple&#160;:</p><pre>&#60;servlet>
&#60;servlet-name>CheckIn&#60;/servlet-name>
&#60;servlet-class>CheckInServlet&#60;/servlet-class>
&#60;load-on-startup>0&#60;/load-on-startup>
&#60;/servlet></pre></li>
<li><b>S&#233;lectionnez la case recherche DNS case Activ&#233; pour activer la recherche DNS.
</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Prise en charge de RCM pour activer
la gestion de la configuration des ressources (RCM). </b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Suivi pour activer l&#8217;op&#233;ration TRACE. </b><p>Si cette option est d&#233;sactiv&#233;e, GlassFish Server est moins expos&#233; &#224; des
attaques de scripts entre sites. Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Auth. d&#8217;intercommunication pour indiquer que l&#8217;auditeur de
r&#233;seau qui utilise ce protocole re&#231;oit le trafic d&#8217;un serveur proxy &#224;
terminaison SSL. </b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de Segmentation pour activer le d&#233;coupage de r&#233;ponse
HTTP. </b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>S&#233;lectionnez la case Activ&#233; de XPowered By pour indiquer &#224; GlassFish Server
d&#8217;utiliser les en-t&#234;tes <tt>X-Powered-By</tt> selon les sp&#233;cifications de Java Servlet 3.0 et
de Java Server Pages 2.0. </b><p>Cette option est activ&#233;e par d&#233;faut.</p></li></ol><p></b>&#201;tapes suivantes</b></p><p>Apr&#232;s avoir cr&#233;&#233; un protocole, vous pouvez cr&#233;er un auditeur de r&#233;seau
qui utilise le protocole. </p>

<p></b>Voir aussi</b></p>
<ul><li><p><a href="task-networklistenernew.html">Cr&#233;ation d'un listener r&#233;seau</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">Modification d'un listener r&#233;seau</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">Suppression d'un listener r&#233;seau</a></p>

</li>
<li><p><a href="task-protocoledit.html">Modification d'un protocole</a></p>

</li>
<li><p><a href="task-protocolssledit.html">Modifier les param&#232;tres SSL d'un protocole </a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">Modifier les param&#232;tres HTTP pour un protocole </a></p>

</li>
<li><p><a href="task-protocolfilecacheedit.html">Modifier les param&#232;tres de cache de fichiers pour un protocole</a></p>

</li>
<li><p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>

</li>
<li><p><a href="task-transportnew.html">Cr&#233;er un transport</a></p>

</li>
<li><p><a href="task-transportedit.html">Modifier un transport</a></p>

</li>
<li><p><a href="task-transportdelete.html">Supprimer un transport</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
