<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-webcontainersessiontimeout"></a><h3>Configurer les propri&#233;t&#233;s de session pour le conteneur Web</h3><a name="indexterm-3"></a><a name="indexterm-4"></a><a name="indexterm-5"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez la configuration &#224; modifier. </b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Conteneur Web.</b><p>La page Propri&#233;t&#233;s g&#233;n&#233;rales s&#8217;affiche.</p></li>
<li><b>Dans la page Propri&#233;t&#233;s g&#233;n&#233;rales, cliquez sur l&#8217;onglet Propri&#233;t&#233;s des sessions.</b><p>La page Propri&#233;t&#233;s des sessions s&#8217;affiche.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;expiration de session, tapez le nombre maximum de
secondes pendant lesquelles une session inactive restera valide. </b><p>La valeur par d&#233;faut est 1800. Si la valeur est d&#233;finie sur
0 ou moins, les sessions n&#8217;expirent jamais. </p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>Pour obtenir une description des propri&#233;t&#233;s disponibles, consultez <a href="ref-websessionproperties.html">Propri&#233;t&#233;s sp&#233;cifiques aux sessions de conteneur Web</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-webcontainergeneral.html">Configuration des propri&#233;t&#233;s g&#233;n&#233;rales du conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Configurer les propri&#233;t&#233;s du gestionnaire pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainerstoreprops.html">Configurer les propri&#233;t&#233;s de stockage pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Pour configurer les param&#232;tres de disponibilit&#233; du conteneur Web</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
