<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-webcontainerstoreprops"></a><h4>Configurer les propri&#233;t&#233;s de stockage pour le conteneur Web</h4><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>S&#233;lectionnez la configuration &#224; modifier. </b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Conteneur Web.</b><p>La page Propri&#233;t&#233;s g&#233;n&#233;rales s&#8217;affiche.</p></li>
<li><b>Dans la page Propri&#233;t&#233;s g&#233;n&#233;rales, cliquez sur l&#8217;onglet Propri&#233;t&#233;s du magasin.</b><p>La page Propri&#233;t&#233;s du magasin s&#8217;affiche.</p></li>
<li><b>Dans le champ R&#233;pertoire, saisissez le chemin d&#8217;acc&#232;s, absolu ou relatif, du
r&#233;pertoire dans lequel les fichiers de sessions individuelles sont enregistr&#233;s. </b><p>La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/generated/jsp/j2ee-apps/</tt><i>appname</i><tt>/</tt><i>appname</i><tt>_war</tt>. </p><p>Un chemin d&#8217;acc&#232;s relatif est relatif au r&#233;pertoire de travail temporaire pour
cette application Web.</p><p>Ce param&#232;tre ne s'applique que si le type de persistance est <tt>file</tt>.
 Pour d&#233;finir le type de persistance, voir <a href="task-webcontaineravailability.html">Pour configurer les param&#232;tres de disponibilit&#233; du conteneur Web</a>.  </p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>Le GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour la zone de
stockage.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-webcontainergeneral.html">Configuration des propri&#233;t&#233;s g&#233;n&#233;rales du conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainersessiontimeout.html">Configurer les propri&#233;t&#233;s de session pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontainermanagerprops.html">Configurer les propri&#233;t&#233;s du gestionnaire pour le conteneur Web</a></p>

</li>
<li><p><a href="task-webcontaineravailability.html">Pour configurer les param&#232;tres de disponibilit&#233; du conteneur Web</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
