<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-protocolfilecacheedit"></a><h3>Modifier les param&#232;tres de cache de fichiers pour un protocole</h3><a name="indexterm-30"></a><a name="indexterm-31"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud Config r&#233;seau.</b></li>
<li><b>Sous le n&#339;ud Configuration de r&#233;seau, s&#233;lectionnez le n&#339;ud Protocoles.</b><p>La page Protocoles s&#8217;affiche.</p></li>
<li><b>Sur la page Protocoles, cliquez sur le nom du protocole que vous
modifiez.</b><p>La page Modification du protocole s&#8217;affiche.</p></li>
<li><b>Sur la page Modification de protocole, cliquez sur l&#8217;onglet Cache de fichiers.</b><p>La page Cache de fichiers s&#8217;affiche.</p></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer le cache de fichiers.</b><p>Cette option est s&#233;lectionn&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ &#194;ge max., entrez la dur&#233;e de vie maximale, en
secondes, pour une entr&#233;e de cache valide.</b><p>Ce param&#232;tre d&#233;termine comment des informations en cache depuis un certain temps
sont utilis&#233;es apr&#232;s la mise en cache d&#8217;un fichier. Une entr&#233;e ant&#233;rieure
&#224; l&#8217;&#226;ge maximal est remplac&#233;e par une nouvelle entr&#233;e pour le m&#234;me
fichier. Si le contenu change rarement, augmentez cette valeur pour am&#233;liorer les
performances.</p><p>L&#8217;&#226;ge maximal optimal d&#233;pend de la fr&#233;quence &#224; laquelle les fichiers existants
sont modifi&#233;s. Par exemple, si les fichiers sont modifi&#233;s quatre fois par
jour &#224;&#160;intervalles r&#233;guliers, vous pouvez d&#233;finir l&#8217;&#226;ge maximal sur 21600 secondes (6
heures). Sinon, pensez &#224; d&#233;finir l&#8217;&#226;ge maximal sur la p&#233;riode la plus
longue durant laquelle vous acceptez d&#8217;utiliser la version pr&#233;c&#233;dente d&#8217;un fichier apr&#232;s
sa modification.</p><p>La valeur par d&#233;faut est 30.</p></li>
<li><b>Dans le champ Taille max. du cache, saisissez la taille totale maximale
(en octets) du cache de fichiers sur le disque.</b><p>La valeur par d&#233;faut est 10485760.</p></li>
<li><b>Dans le champ Nb max. de fichiers, saisissez le nombre maximal de
fichiers pouvant &#234;tre stock&#233;s dans le cache de fichiers.</b><p>Si la valeur est trop &#233;lev&#233;e, le serveur met en cache les
fichiers peu utiles qui consomment de la m&#233;moire. Si elle est trop
faible, vous perdez l&#8217;avantage de la mise en cache. Testez diff&#233;rentes valeurs
de cet attribut pour rechercher la solution optimale pour des applications sp&#233;cifiques.</p><p>La valeur par d&#233;faut est 1024.</p></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>


<hr>
</li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-networklistenernew.html">Cr&#233;ation d'un listener r&#233;seau</a></p>

</li>
<li><p><a href="task-networklisteneredit.html">Modification d'un listener r&#233;seau</a></p>

</li>
<li><p><a href="task-networklistenerdelete.html">Suppression d'un listener r&#233;seau</a></p>

</li>
<li><p><a href="task-protocolnew.html">Cr&#233;ation d'un protocole</a></p>

</li>
<li><p><a href="task-protocoledit.html">Modification d'un protocole</a></p>

</li>
<li><p><a href="task-protocolssledit.html">Modifier les param&#232;tres SSL d'un protocole </a></p>

</li>
<li><p><a href="task-protocolhttpedit.html">Modifier les param&#232;tres HTTP pour un protocole </a></p>

</li>
<li><p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>

</li>
<li><p><a href="task-transportnew.html">Cr&#233;er un transport</a></p>

</li>
<li><p><a href="task-transportedit.html">Modifier un transport</a></p>

</li>
<li><p><a href="task-transportdelete.html">Supprimer un transport</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
