<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbcconnpooladvanceattrtab"></a><h4>Modifier les attributs avanc&#233;s du pool de connexions</h4>
<a name="indexterm-24"></a><p>Utilisez la page Modifier les attributs avanc&#233;s du pool de connexions pour
sp&#233;cifier des attributs permettant d&#8217;&#233;tablir un diagnostic des fuites de connexion et
faciliter l&#8217;utilisation.</p>

<p>La page Modifier les attributs avanc&#233;s du pool de connexions pr&#233;sente les
options suivantes&#160;:</p>

<dl><dt>Charger les valeurs par d&#233;faut</dt>
<dd><p>Bouton pour restaurer les valeurs par d&#233;faut de tous les param&#232;tres. </p>

</dd>
<dt>Nom du pool</dt>
<dd><p>Nom du pool de connexions. Le champ Nom est en lecture seule. Vous pouvez indiquer le nom du pool de connexions uniquement au moment de sa cr&#233;ation.</p>

</dd>
<dt>D&#233;lai d&#8217;expiration de l&#8217;instruction</dt>
<dd><p>D&#233;lai, en secondes, au-del&#224; duquel des requ&#234;tes anormalement longues &#224; ex&#233;cuter sont abandonn&#233;es. GlassFish Server va d&#233;finir <tt>QueryTimeout</tt> sur les instructions cr&#233;&#233;es. Une valeur de -1 signifie que l&#8217;option est d&#233;sactiv&#233;e. La valeur par d&#233;faut est &#8211;1.</p>

</dd>
<dt>Taille du cache d&#8217;instruction</dt>
<dd><p>Nombre d&#8217;instructions devant &#234;tre mises dans la m&#233;moire cache &#224; l&#8217;aide du syst&#232;me de mise en cache LRU (utilis&#233; le moins r&#233;cemment). La valeur 0 d&#233;sactive la mise en cache d&#8217;instructions. La valeur par d&#233;faut est 0.</p>

</dd>
<dt>Init SQL</dt>
<dd><p>Cha&#238;ne SQL &#224; ex&#233;cuter lors de la cr&#233;ation (mais pas de la r&#233;utilisation) d&#8217;une connexion dans le pool. L&#8217;ex&#233;cution de cette cha&#238;ne initialise l&#8217;&#233;tat de la connexion.</p>

</dd>
<dt>Listeners de suivi SQL</dt>
<dd><p>Liste de noms de classe d&#8217;impl&#233;mentation des listeners s&#233;par&#233;s par des virgules qui sp&#233;cifie que les instructions SQL ex&#233;cut&#233;es par les applications sont suivies. Les classes de listeners doivent impl&#233;menter l&#8217;interface <tt>org.glassfish.api.jdbc.SQLTraceListener</tt> . L&#8217;utilisation de listeners facilite le filtrage des messages du fichier journal des instructions SQL et aide les administrateurs &#224; analyser ces instructions. </p>

</dd>
<dt>Imbriquer des objets JDBC</dt>
<dd><p>Lorsque cette option est activ&#233;e, les applications imbriquent les objets JDBC pour Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Groupement</dt>
<dd><p>Permet le groupement des connexions pour le pool. Cette option est activ&#233;e par d&#233;faut.</p>

</dd>
<dt>Valider au maximum une fois</dt>
<dd><p>Indique l'intervalle, exprim&#233; en secondes, entre des demandes successives de validation d'une connexion, une fois au plus. La d&#233;finition de cet attribut sur une valeur appropri&#233;e r&#233;duit le nombre de demandes de validation &#233;manant d'une connexion. La valeur par d&#233;faut est 0, ce qui signifie que l'attribut n'est pas activ&#233;. </p>

</dd>
<dt>D&#233;lai d&#8217;expiration de la fuite</dt>
<dd><p>P&#233;riode (en secondes) n&#233;cessaire pour effectuer un suivi des fuites de connexion dans un pool de connexions. Ce champ permet de d&#233;tecter les &#233;ventuelles fuites de connexion de l&#8217;application. Une connexion non renvoy&#233;e au pool par l&#8217;application dans l&#8217;intervalle sp&#233;cifi&#233; est soup&#231;onn&#233;e de pr&#233;senter une fuite&#160;; un suivi de pile de l&#8217;appelant est alors consign&#233; dans le journal. La valeur 0 signifie que le suivi des fuites de connexion est d&#233;sactiv&#233;. La valeur par d&#233;faut est 0.</p>

<p>Utilisez ce champ avec le champ R&#233;cup&#233;ration de la fuite pour &#233;viter tout risque de fuite de connexion de l&#8217;application.</p>

</dd>
<dt>R&#233;cup&#233;ration de la fuite</dt>
<dd><p>Si cette option est activ&#233;e, les connexions pr&#233;sentant des fuites sont restaur&#233;es dans le pool une fois le suivi des fuites de connexion termin&#233;. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Nouvelles tentatives de cr&#233;ation</dt>
<dd><p>Nombre de tentatives effectu&#233;es en cas d&#8217;&#233;chec de cr&#233;ation d&#8217;une connexion. La valeur 0 signifie qu&#8217;aucune tentative ne sera effectu&#233;e pour recr&#233;er une connexion. La valeur par d&#233;faut est 0.</p>

</dd>
<dt>Fr&#233;quence des tentatives</dt>
<dd><p>Intervalle en secondes s&#233;parant deux tentatives de cr&#233;ation d&#8217;une connexion. La valeur par d&#233;faut est 10. Cet attribut n&#8217;est utilis&#233; que si la valeur de l&#8217;option Nouvelles tentatives de cr&#233;ation est sup&#233;rieure &#224; 0.</p>

</dd>
<dt>Association diff&#233;r&#233;e</dt>
<dd><p>Si cette option est activ&#233;e, une connexion physique n&#8217;est associ&#233;e &#224; une collection logique que lorsque la connexion est utilis&#233;e. Les connexions sont dissoci&#233;es lorsque la transaction est termin&#233;e et qu&#8217;une m&#233;thode de composant prend fin, ce qui facilite la r&#233;utilisation des connexions physiques. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Enr&#244;lement diff&#233;r&#233; de la connexion</dt>
<dd><p>Si cette option est activ&#233;e, elle permet de n&#8217;enr&#244;ler une ressource dans une transaction que lorsqu&#8217;elle est utilis&#233;e dans une m&#233;thode. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Associer au thread</dt>
<dd><p>Si cette option est activ&#233;e, la connexion est associ&#233;e &#224; un thread de sorte que lorsque celui-ci n&#233;cessite une connexion, il puisse r&#233;utiliser la connexion qui lui est d&#233;j&#224; associ&#233;e, limitant ainsi le temps d&#8217;arr&#234;t li&#233; &#224; l&#8217;obtention d&#8217;une connexion &#224; partir du pool. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Associer des connexions</dt>
<dd><p>Si cette option est activ&#233;e, une connexion s&#233;lectionn&#233;e dans le pool doit &#234;tre mise en correspondance avec les connexions disposant de certaines informations d&#8217;identification. Cette option doit &#234;tre activ&#233;e si le pool de connexions est utilis&#233; par des applications disposant de plusieurs informations d&#8217;identification utilisateur. Cette option peut &#234;tre d&#233;sactiv&#233;e en toute s&#233;curit&#233; si l&#8217;administrateur sait que les connexions du pool seront toujours homog&#232;nes et qu&#8217;il est donc inutile pour l&#8217;adaptateur de ressources d&#8217;associer une connexion emprunt&#233;e au pool. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Utilisation du nombre maximal de connexions</dt>
<dd><p>Nombre de fois qu&#8217;une connexion doit &#234;tre r&#233;utilis&#233;e par le pool. Une fois qu&#8217;une connexion a &#233;t&#233; r&#233;utilis&#233;e le nombre de fois sp&#233;cifi&#233;, elle est ferm&#233;e. En limitant le nombre de r&#233;utilisations d&#8217;une connexion, vous pouvez &#233;viter les fuites d&#8217;instruction lorsqu&#8217;une application ne ferme pas des instructions. Une valeur de 0 signifie que cet attribut est d&#233;sactiv&#233;. La valeur par d&#233;faut est 0.</p>

</dd>
<dt>Validation des connexions</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, la validation des connexions est requise, ce qui permet au serveur de se reconnecter en cas d&#8217;&#233;chec.</p>

</dd>
<dt>M&#233;thode de validation</dt>
<dd><p>GlassFish Server peut valider les connexions &#224; la base de donn&#233;es de l&#8217;une des mani&#232;res suivantes.</p>

<dl><dt><tt>auto-commit</tt> et <tt>metadata</tt></dt>
<dd><p>GlassFish Server valide une connexion en appelant la m&#233;thode <tt>con.getAutoCommit</tt> ou <tt>con.getMetaData</tt>. </p>


<hr><p><b>Remarque - </b>La plupart des pilotes JDBC mettent en cache le r&#233;sultat de ces appels. Par cons&#233;quent, l&#8217;utilisation de ces appels ne donne pas toujours une validation fiable. Contactez votre fournisseur de pilotes pour savoir si ces appels sont mis ou non en cache.</p>


<hr>
</dd>
<dt><tt>custom-validation</tt></dt>
<dd><p>GlassFish Server utilise un m&#233;canisme de validation d&#233;fini par l&#8217;utilisateur sp&#233;cifi&#233; par la classe d&#8217;impl&#233;mentation personnalis&#233;e dans le champ Nom de classe de validation. </p>

</dd>
<dt><tt>table</tt></dt>
<dd><p>L&#8217;application interroge la table de base de donn&#233;es sp&#233;cifi&#233;e. La table doit exister et &#234;tre accessible mais ne requiert aucune ligne. N&#8217;utilisez pas une table existante comportant un nombre important de lignes ou une table d&#233;j&#224; fr&#233;quemment consult&#233;e. </p>

</dd>
</dl>
</dd>
<dt>Nom de la table</dt>
<dd><p>Nom de la table de base de donn&#233;es pour la validation. Ce champ ne doit &#234;tre utilis&#233; que si la m&#233;thode de validation a &#233;t&#233; d&#233;finie sur <tt>table</tt>.</p>

</dd>
<dt>Nom de classe de validation</dt>
<dd><p>Nom de la classe d&#8217;impl&#233;mentation de la validation personnalis&#233;e. Ce champ ne doit &#234;tre utilis&#233; que si la m&#233;thode de validation a &#233;t&#233; d&#233;finie sur <tt>custom-validation</tt>. GlassFish Server doit pouvoir acc&#233;der au nom de classe indiqu&#233;. La classe sp&#233;cifi&#233;e doit impl&#233;menter l&#8217;interface <tt>org.glassfish.api.jdbc.ConnectionValidation</tt> .</p>

</dd>
<dt>Sur tout &#233;chec</dt>
<dd><p>Si cette option est activ&#233;e, GlassFish Server ferme toutes les connexions du pool et les r&#233;tablit en cas d&#8217;&#233;chec de l&#8217;une d&#8217;entre elles. Si cette option est d&#233;sactiv&#233;e, les connexions individuelles ne sont r&#233;tablies que lorsqu&#8217;elles sont utilis&#233;es. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
<dt>Autoriser des programmes appelants non-composant</dt>
<dd><p>Si cette option est activ&#233;e, le pool peut &#234;tre utilis&#233; par des programmes appelants non-composant tels que les filtres de servlet et les gestionnaires de persistance tiers. Les connexions obtenues par des programmes appelants non-composant ne sont pas automatiquement ferm&#233;es &#224; la fin d&#8217;une transaction par le conteneur. Elles doivent &#234;tre explicitement ferm&#233;es par le programme appelant. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p>

</dd>
</dl>
<a name="gkonw"></a><h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-setdbaccess.html">Configurer l'acc&#232;s &#224; la base de donn&#233;es</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>

</li></ul>
<a name="gkoli"></a><h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=add-resources-1"><tt>add-resources</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-jdbc-connection-pool-1"><tt>create-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-jdbc-connection-pool-1"><tt>delete-jdbc-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-jdbc-connection-pools-1"><tt>list-jdbc-connection-pools</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=ping-connection-pool-1"><tt>ping-connection-pool</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=start-database-1"><tt>start-database</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=stop-database-1"><tt>stop-database</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
