<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jdbc-properties"></a><h4>Propri&#233;t&#233;s sp&#233;cifiques aux pools de connexions JDBC</h4>
<a name="indexterm-26"></a><a name="indexterm-27"></a><p>La plupart des pilotes JDBC permettent d&#8217;utiliser des listes de propri&#233;t&#233;s standard
pour sp&#233;cifier l&#8217;utilisateur, le mot de passe et d&#8217;autres informations de configuration
des ressources. Bien que les propri&#233;t&#233;s soient facultatives par rapport au GlassFish
Server, certaines propri&#233;t&#233;s peuvent &#234;tre n&#233;cessaires pour la plupart des bases de
donn&#233;es. Pour plus de d&#233;tails, reportez-vous &#224; JDBC 4.0 Standard Extension API.</p>

<p>La modification des propri&#233;t&#233;s de pilote JDBC n&#233;cessite un red&#233;marrage du serveur.</p>

<p>Les propri&#233;t&#233;s standard suivantes sont communes &#224; plusieurs fournisseurs JDBC. Pour obtenir
des informations sur les propri&#233;t&#233;s disponibles pour votre pilote JDBC, consultez la
documentation du fournisseur.</p>

<dl><dt><tt>user</tt></dt>
<dd><p>Sp&#233;cifie le nom d&#8217;utilisateur pour la connexion &#224; la base de donn&#233;es.</p>

</dd>
<dt><tt>password</tt></dt>
<dd><p>Sp&#233;cifie le mot de passe pour la connexion &#224; la base de donn&#233;es.</p>

</dd>
<dt><tt>databaseName</tt></dt>
<dd><p>Sp&#233;cifie la base de donn&#233;es pour ce pool de connexions.</p>

</dd>
<dt><tt>serverName</tt></dt>
<dd><p>Sp&#233;cifie le serveur de base de donn&#233;es pour ce pool de connexions.</p>

</dd>
<dt><tt>port</tt></dt>
<dd><p>Sp&#233;cifie le port sur lequel le serveur de base de donn&#233;es &#233;coute les requ&#234;tes.</p>

</dd>
<dt><tt>networkProtocol</tt></dt>
<dd><p>Sp&#233;cifie le protocole de communication.</p>

</dd>
<dt><tt>roleName</tt></dt>
<dd><p>Sp&#233;cifie le nom du r&#244;le SQL initial.</p>

</dd>
<dt><tt>datasourceName</tt></dt>
<dd><p>Sp&#233;cifie un <tt>XADataSource</tt> sous-jacent ou un <tt>ConnectionPoolDataSource</tt> si le pool de connexions est effectu&#233;.</p>

</dd>
<dt><tt>description</tt></dt>
<dd><p>Sp&#233;cifie une description de texte.</p>

</dd>
<dt><tt>url</tt></dt>
<dd><p>Sp&#233;cifie l&#8217;URL pour ce pool de connexions. Bien qu&#8217;il ne s&#8217;agisse pas d&#8217;une propri&#233;t&#233; standard, elle est couramment utilis&#233;e.</p>

</dd>
</dl>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
