<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-integratejdbcdriver" name="task-integratejdbcdriver"></a><a id="GHJDB00031" name="GHJDB00031"></a></p>

<h4><a id="sthref4" name="sthref4"></a>Int&eacute;grer un pilote JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Un pilote prenant en charge l'API JDBC (pilote JDBC) convertit les appels JDBC d'une application en protocole du serveur de base de donn&eacute;es.</p>
<p>Pour int&eacute;grer le pilote JDBC &agrave; un domaine GlassFish&nbsp;Server, effectuez l'une des op&eacute;rations suivantes&nbsp;:</p>
<ul>
<li>
<p>Configurez le pilote afin qu'il soit accessible au chargeur de classe commun.</p>
<ol>
<li>
<p>Copiez les fichiers JAR et ZIP du pilote dans le r&eacute;pertoire <i>domain-dir</i><code>/lib</code>.</p>

<hr>
<p><b>Remarque:</b></p>
Il existe une exception &agrave; cette r&egrave;gle. Si vous utilisez le pilote Oracle JDBC et que vous souhaitez vous servir des extensions EclipseLink disponibles pour utilisation avec les bases de donn&eacute;es Oracle, vous devez placer les fichiers JAR du pilote Oracle JDBC dans le r&eacute;pertoire <i>domain-dir</i><code>/lib/ext</code>.
<hr>

</li>
<li>
<p>Red&eacute;marrez le domaine.</p>
</li>
</ol>
</li>
<li>
<p>Configurez le pilote afin qu'il soit accessible au chargeur de classe syst&egrave;me.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Param&egrave;tres&nbsp;JVM.</p>
<p>La page Param&egrave;tres&nbsp;JVM appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Param&egrave;tres g&eacute;n&eacute;raux JVM, cliquez sur l'onglet Param&egrave;tres du chemin.</p>
</li>
<li>
<p>Dans le champ Suffixe de classpath, saisissez le nom qualifi&eacute; complet du chemin d'acc&egrave;s au fichier JAR du pilote.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
<li>
<p>Red&eacute;marrez le serveur.</p>
</li>
</ol>
</li>
</ul>
<a id="sthref5" name="sthref5"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Param&eacute;trer l'acc&egrave;s &agrave; une base de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Cr&eacute;er une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Modifier une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;er un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modifier les param&egrave;tres g&eacute;n&eacute;raux d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&eacute;s du pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rifier les param&egrave;tres d'un pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&eacute;t&eacute;s d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
