<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcconnectionpoolnew"></a><h4>Cr&#233;er un pool de connexions JDBC</h4><a name="indexterm-7"></a><a name="indexterm-8"></a><a name="indexterm-9"></a><p>Lors de la cr&#233;ation d&#8217;un pool de connexions &#224; l&#8217;aide de la
Console d'administration , vous d&#233;finissez les aspects d&#8217;une connexion &#224; une base
de donn&#233;es sp&#233;cifique.</p>

<h6>Avant de commencer</h6><p>Pour cr&#233;er un pool de connexions, vous devez d&#8217;abord installer et int&#233;grer
un pilote prenant en charge l&#8217;API JDBC (pilote JDBC). Voir <a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a>.</p>

<p>Les informations suivantes sont requises pour cr&#233;er le pool de connexions JDBC.
Rassemblez ces informations avant de proc&#233;der&#160;:</p>


<ul><li><p>Nom du fournisseur de base de donn&#233;es</p>

</li>
<li><p>Type de ressource&#160;: <tt>javax.sql.DataSource</tt> (transactions locales uniquement), <tt>java.sql.ConnectionPoolDataSource</tt> (transactions locales, am&#233;liorations possibles des performances), <tt>javax.sql.XADataSource</tt> (transactions globales) et <tt>java.sql.Driver</tt></p>

</li>
<li><p>Nom de la classe de source de donn&#233;es</p>

</li>
<li><p>Propri&#233;t&#233;s requises, telles que le nom de la base de donn&#233;es (URL), nom de l&#8217;utilisateur et mot de passe</p>

</li></ul>
<ol>
<li><b>Dans l&#8217;arborescence de navigation, s&#233;lectionnez le n&#339;ud T&#226;ches courantes.</b><p>La page T&#226;ches courantes s&#8217;affiche.</p></li>
<li><b>Sur la page T&#226;ches courantes, cliquez sur le bouton Cr&#233;er un nouveau
pool de connexions JDBC.</b><p>La page Nouveau pool de connexions JDBC (&#233;tape 1 sur 2) s&#8217;ouvre.</p>
<hr><p><b>Remarque - </b>Vous pouvez &#233;galement acc&#233;der &#224; la page Nouveau pool de connexions JDBC
en d&#233;veloppant les n&#339;uds Ressources et JDBC et en s&#233;lectionnant le n&#339;ud
Pools de connexions. S&#233;lectionnez l&#8217;option Nouveau sur la page Pools de connexions
pour cr&#233;er un pool de connexions.</p>


<hr>
</li>
<li><b>Dans le champ Nom du pool, entrez le nom du nouveau pool
de connexions.</b><p>Ce champ est obligatoire.</p></li>
<li><b>Dans la liste d&#233;roulante Type de ressource, s&#233;lectionnez un type de ressource.</b><p>Les types de ressources disponibles incluent&#160;: <tt>javax.sql.XADataSource</tt> (transactions globales), <tt>java.sql.ConnectionPoolDataSource</tt> (transactions locales,
am&#233;liorations possibles des performances), <tt>javax.sql.DataSource</tt> (transactions locales uniquement) et <tt>java.sql.Driver</tt>.</p></li>
<li><b>Sp&#233;cifiez un fournisseur de base de donn&#233;es en effectuant l&#8217;une des actions
suivantes&#160;:</b><ul>
<li><b>Dans la liste d&#233;roulante Fournisseur de base de donn&#233;es, s&#233;lectionnez un fournisseur
de base de donn&#233;es.</b></li>
<li><b>Si le fournisseur de la base de donn&#233;es n&#8217;appara&#238;t pas dans la
liste, saisissez le nom du fournisseur dans la zone de texte Fournisseur de
base de donn&#233;es.</b></li></ul></li>
<li><b>Cliquez sur Suivant.</b><p>La page Nouveau pool de connexions JDBC (&#233;tape 2 sur 2) s&#8217;ouvre.</p></li>
<li><b>Dans le champ Nom de classe de la source de donn&#233;es, saisissez
le nom de la classe sp&#233;cifique au fournisseur qui impl&#233;mente l&#8217;API <tt>DataSource</tt>,
<tt>ConnectionPoolDataSource</tt> ou <tt>XADataSource</tt>.</b><p>Si vous s&#233;lectionnez l&#8217;un des types de ressource source de donn&#233;es, ce
champ indique habituellement automatiquement le nom de classe associ&#233; au type de
ressource et au fournisseur de base de donn&#233;es que vous avez choisis.
Si vous s&#233;lectionnez le type de ressource <tt>java.sql.Driver</tt>, ce champ est d&#233;sactiv&#233;.</p></li>
<li><b>Dans le champ Nom de classe du pilote, saisissez le nom de
classe sp&#233;cifique au fournisseur qui impl&#233;mente l&#8217;API <tt>java.sql.Driver</tt>.</b><p>Si vous s&#233;lectionnez le type de ressource <tt>java.sql.Driver</tt>, ce champ indique habituellement
automatiquement le nom de classe associ&#233; au pilote et au fournisseur de
base de donn&#233;es que vous avez choisis. Si vous s&#233;lectionnez l&#8217;un des
types de ressource de source de donn&#233;es, ce champ est d&#233;sactiv&#233;. </p></li>
<li><b>Cochez la case Ping activ&#233; pour effectuer automatiquement un ping sur un
pool lors de sa cr&#233;ation ou de sa reconfiguration afin d&#8217;identifier et de
signaler toute erreur de valeur d&#8217;attribut. </b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Description, entrez une br&#232;ve description du pool de connexions.</b></li>
<li><b>Dans le champ Taille initiale et minimale du pool, entrez le nombre
minimal de connexions pour ce pool.</b><p>Cette valeur d&#233;termine &#233;galement le nombre de connexions plac&#233;es dans le pool
lors de sa cr&#233;ation initiale ou lors du d&#233;marrage de GlassFish Server.
La valeur par d&#233;faut est 8.</p></li>
<li><b>Dans le champ Taille maximale du pool, entrez le nombre maximal de
connexions pour ce pool.</b><p>La valeur par d&#233;faut est 32.</p></li>
<li><b>Dans le champ Valeur de redimensionnement du pool, entrez le nombre de
connexions par lot de redimensionnement du pool.</b><p>Lorsque le pool augmente ou diminue &#224; la taille maximale et minimale
respectivement, il est redimensionn&#233; par lots. Cette valeur d&#233;termine le nombre de
connexions dans le lot. Une valeur trop &#233;lev&#233;e retarde la cr&#233;ation et
le recyclage de la connexion, alors qu&#8217;une valeur trop basse affecte les
performances. La valeur par d&#233;faut est 2.</p></li>
<li><b>Dans le champ D&#233;lai d&#8217;inactivit&#233;, entrez le d&#233;lai maximal, en secondes, durant
lequel une connexion peut demeurer inactive dans le pool.</b><p>Une fois ce d&#233;lai expir&#233;, la connexion est supprim&#233;e du pool. La
valeur par d&#233;faut est 300.</p></li>
<li><b>Dans le champ Attente max., entrez le d&#233;lai maximal, en millisecondes, durant
lequel l&#8217;application demandant une connexion attend avant que la connexion n&#8217;arrive &#224;
expiration.</b><p>La valeur par d&#233;faut est 60&#160;000.</p></li>
<li><b>Cochez la case Connexions non transactionnelles pour revenir aux connexions non transactionnelles.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans la liste d&#233;roulante Niveau d&#8217;isolement des transactions, s&#233;lectionnez le niveau d&#8217;isolement
des transactions de ce pool de connexions.</b><p>Si aucune valeur n&#8217;est sp&#233;cifi&#233;e, les connexions sont &#233;tablies au niveau d&#8217;isolement
par d&#233;faut indiqu&#233; par le pilote JDBC. Par d&#233;faut, cette option n&#8217;est
pas sp&#233;cifi&#233;e.</p></li>
<li><b>Cochez la case Niveau d&#8217;isolement garanti pour que toutes les connexions emprunt&#233;es
au pool partagent le m&#234;me niveau d&#8217;isolement.</b><p>Par exemple, si le niveau d&#8217;isolement de la connexion est syst&#233;matiquement modifi&#233;
(avec <tt>con.setTransactionIsolation</tt>) lors de sa derni&#232;re utilisation, ce m&#233;canisme r&#233;tablit l&#8217;&#233;tat au
niveau d&#8217;isolement sp&#233;cifi&#233;. Cette option est activ&#233;e par d&#233;faut.</p><p>Ce param&#232;tre ne s&#8217;applique que lorsqu&#8217;un niveau d&#8217;isolement de transaction a &#233;t&#233;
sp&#233;cifi&#233;.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>Le nom de la base de donn&#233;es (URL), le nom d&#8217;utilisateur et
le mot de passe sont des exemples de propri&#233;t&#233;s requises. La table
contient normalement les propri&#233;t&#233;s utilis&#233;es par le fournisseur de la base de
donn&#233;es. Pour obtenir des informations sur quelques unes des propri&#233;t&#233;s disponibles, reportez-vous
&#224; la section <a href="ref-jdbc-properties.html">Propri&#233;t&#233;s sp&#233;cifiques aux pools de connexions JDBC</a>.</p><p>Si vous n&#8217;indiquez pas de valeur pour une propri&#233;t&#233;, celle-ci est supprim&#233;e
de la  table &#224; l&#8217;issue de la cr&#233;ation du pool de connexions.
Si vous ne souhaitez pas  d&#233;finir imm&#233;diatement la valeur d&#8217;une propri&#233;t&#233; mais
souhaitez conserver cette propri&#233;t&#233; dans la table afin de d&#233;finir sa valeur ult&#233;rieurement,
entrez des parenth&#232;ses vides dans le champ Valeur&#160;:</p><pre>()</pre><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez, puis cliquez sur le bouton
Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Terminer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-setdbaccess.html">Configurer l'acc&#232;s &#224; la base de donn&#233;es</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Cr&#233;er une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Modifier une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Pour modifier les cibles de ressources JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
