<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcresourcesedit" name="task-jdbcresourcesedit"></a><a id="GHJDB00033" name="GHJDB00033"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Modifier une ressource JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud JDBC.</p>
</li>
<li>
<p>Sous le noeud JDBC, s&eacute;lectionnez le noeud Ressources JDBC.</p>
<p>La page Ressources JDBC appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Ressources JDBC, cliquez sur le nom de la ressource &agrave; modifier.</p>
<p>La page Modifier une ressource JDBC appara&icirc;t.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Nom du pool, s&eacute;lectionnez un pool de connexions &agrave; associer &agrave; la ressource JDBC.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la ressource JDBC.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish&nbsp;Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources JDBC.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur l'onglet Cible pour g&eacute;rer les cibles de ressources.</p>
<ol type="a">
<li>
<p>Activez ou d&eacute;sactivez les cibles d&eacute;finies pour la ressource, comme vous le souhaitez.</p>
</li>
<li>
<p>Cliquez sur le bouton G&eacute;rer les cibles pour ajouter des cibles &agrave; la ressource ou en enlever.</p>
</li>
</ol>
<p>Pour plus d'informations, reportez-vous &agrave; <a href="task-jdbcresourcetargets.html">Modifier les cibles de ressources JDBC</a>.</p>
</li>
<li>
<p>Cliquez sur l'onglet G&eacute;n&eacute;ral pour revenir &agrave; la page Modifier une ressource JDBC.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Param&eacute;trer l'acc&egrave;s &agrave; une base de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;grer un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Cr&eacute;er une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Modifier les cibles de ressources JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;er un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modifier les param&egrave;tres g&eacute;n&eacute;raux d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&eacute;s du pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rifier les param&egrave;tres d'un pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&eacute;t&eacute;s d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
