<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcconnectionpoolproperty"></a><h3>Modifier les propri&#233;t&#233;s d'un pool de connexions JDBC</h3><a name="indexterm-14"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le n&#339;ud Ressources, d&#233;veloppez le n&#339;ud JDBC.</b></li>
<li><b>Sous le n&#339;ud JDBC, s&#233;lectionnez le n&#339;ud Pools de connexions.</b><p>La page Pools de connexions s&#8217;ouvre.</p></li>
<li><b>Cliquez sur le nom du pool de connexions que vous modifiez.</b><p>La page Modification du pool de connexions s&#8217;ouvre.</p></li>
<li><b>Dans la page Modification du pool de connexions, cliquez sur l&#8217;onglet Autres
propri&#233;t&#233;s.</b><p>La page Modification des propri&#233;t&#233;s du pool de connexions s&#8217;affiche.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>Le nom de la base de donn&#233;es (URL), le nom d&#8217;utilisateur et
le mot de passe sont des exemples de propri&#233;t&#233;s requises. Pour obtenir
des informations sur les propri&#233;t&#233;s disponibles, consultez <a href="ref-jdbc-properties.html">Propri&#233;t&#233;s sp&#233;cifiques aux pools de connexions JDBC</a>.</p><p>Si vous n&#8217;indiquez pas de valeur pour une propri&#233;t&#233;, celle-ci est supprim&#233;e
de la  table &#224; l&#8217;issue de la modification du pool de connexions.
Si vous ne souhaitez pas  d&#233;finir imm&#233;diatement la valeur d&#8217;une propri&#233;t&#233; mais
souhaitez conserver cette propri&#233;t&#233; dans la table afin de d&#233;finir sa valeur ult&#233;rieurement,
entrez des parenth&#232;ses vides dans le champ Valeur&#160;:</p><pre>()</pre><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-setdbaccess.html">Configurer l'acc&#232;s &#224; la base de donn&#233;es</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Cr&#233;er une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Modifier une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Pour modifier les cibles de ressources JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
