<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setdbaccess"></a><h4>Configurer l&#8217;acc&#232;s &#224; la base de donn&#233;es</h4><a name="indexterm-1"></a><a name="indexterm-2"></a><p>Pour stocker, organiser et r&#233;cup&#233;rer les donn&#233;es, la plupart des applications utilisent
des bases de donn&#233;es relationnelles.</p>

<p>GlassFish Server inclut une copie de la base de donn&#233;es Java DB
et est pr&#233;configur&#233; pour acc&#233;der &#224; cette base de donn&#233;es.</p>

<ol>
<li><b>Installez un produit de base de donn&#233;es pris en charge. </b><p>Pour consulter la liste des bases de donn&#233;es prises en charge, reportez-vous
aux <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2434&id=sjsaseern"><i>Oracle GlassFish Server 3.1 Release Notes </i></a>.</p></li>
<li><b>Installez un pilote prenant en charge l&#8217;API JDBC (pilote JDBC) pour la
base de donn&#233;es.</b><p>Assurez-vous que le pilote que vous souhaitez utiliser pour cr&#233;er des connexions
&#224; la base de donn&#233;es est install&#233; sur tous les serveurs sur
lesquels vous souhaitez d&#233;ployer la source de donn&#233;es.</p></li>
<li><b>Assurez-vous que le fichier JAR du pilote soit accessible &#224; l&#8217;instance de
serveur du domaine. </b><p>Voir <a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a>.</p></li>
<li><b>Cr&#233;ez la base de donn&#233;es. </b><p>G&#233;n&#233;ralement, le fournisseur d&#8217;applications offre des scripts pour cr&#233;er et renseigner la
base de donn&#233;es.</p></li>
<li><b>Cr&#233;ez un pool de connexions pour la base de donn&#233;es. </b><p>Voir <a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a>.</p></li>
<li><b>Cr&#233;ez une ressource JDBC pointant vers le pool de connexions. </b><p>Voir <a href="task-jdbcresourcenew.html">Cr&#233;er une ressource JDBC</a>.</p></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Cr&#233;er une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Modifier une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
