<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcresourcenew"></a><h3>Cr&#233;er une ressource JDBC</h3><a name="indexterm-4"></a><p>Une ressource JDBC (Java DataBase Connectivity) (source de donn&#233;es) fournit des applications
via une connexion &#224; une base de donn&#233;es.</p>

<p><b>Avant de commencer</b></p><p>Pour cr&#233;er une ressource JDBC, vous devez commencer par cr&#233;er un pool
de connexions JDBC. Voir <a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a>.</p>

<ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le n&#339;ud Ressources, d&#233;veloppez le n&#339;ud JDBC.</b></li>
<li><b>Sous le n&#339;ud JDBC, s&#233;lectionnez le n&#339;ud Ressources JDBC.</b><p>La page Ressources JDBC s&#8217;affiche.</p></li>
<li><b>Dans la page Ressources JDBC, cliquez sur Nouveau.</b><p>La page Nouvelle ressource JDBC s&#8217;ouvre.</p></li>
<li><b>Dans le champ Nom JNDI, saisissez un nom de ressource unique. </b><p>Le nom JNDI organise et recherche des composants dans un environnement informatique
distribu&#233; de la m&#234;me mani&#232;re que des catalogues sur fiches organisent et
repr&#233;sentent des emplacements de livres dans une biblioth&#232;que. Par cons&#233;quent, le nom
JNDI devient une m&#233;thode importante d&#8217;acc&#232;s &#224; la ressource JDBC. Par convention,
le nom commence par la cha&#238;ne <tt>jdbc/</tt>, comme par exemple dans <tt>jdbc/payrolldb</tt>.
N&#8217;oubliez pas la barre oblique.</p><p>Le nom ne peut contenir que des caract&#232;res alphanum&#233;riques, des caract&#232;res de
soulignement, des tirets ou des points.</p></li>
<li><b>Dans la liste d&#233;roulante Nom du pool, s&#233;lectionnez un pool de connexions
&#224; associer &#224; la nouvelle ressource JDBC.</b></li>
<li><b>Dans le champ Description, entrez une br&#232;ve description de la nouvelle ressource
JDBC.</b></li>
<li><b>Cochez la case &#201;tat activ&#233; pour rendre la ressource disponible au moment de
l&#8217;ex&#233;cution.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les ressources JDBC.</p><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p></li>
<li><b>S&#233;lectionnez une cible disponible pour l'ajouter ou la supprimer de la liste
Cibles s&#233;lectionn&#233;es. </b></li>
<li><b>Cliquez sur OK.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-setdbaccess.html">Configurer l'acc&#232;s &#224; la base de donn&#233;es</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesedit.html">Modifier une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Pour modifier les cibles de ressources JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
