<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jdbcresourcesedit"></a><h3>Modifier une ressource JDBC</h3><a name="indexterm-5"></a><ol>
<li><b>Dans l&#8217;arborescence de navigation, d&#233;veloppez le n&#339;ud Ressources.</b></li>
<li><b>Sous le n&#339;ud Ressources, d&#233;veloppez le n&#339;ud JDBC.</b></li>
<li><b>Sous le n&#339;ud JDBC, s&#233;lectionnez le n&#339;ud Ressources JDBC.</b><p>La page Ressources JDBC s&#8217;affiche.</p></li>
<li><b>Sur la page Ressources JDBC, cliquez sur le nom de la ressource
&#224; modifier.</b><p>La page Modification d&#8217;une ressource JDBC s&#8217;ouvre.</p></li>
<li><b>Dans la liste d&#233;roulante Nom du pool, s&#233;lectionnez un pool de connexions
&#224; associer &#224; la ressource JDBC.</b></li>
<li><b>Dans le champ Description, entrez une br&#232;ve description de la ressource JDBC.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d&#8217;autres propri&#233;t&#233;s.</b><p>GlassFish Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les ressources JDBC.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez, puis cliquez sur le bouton
Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur l'onglet Cible pour g&#233;rer les cibles de ressources. </b><ol style="list-style-type: lower-alpha">
<li><b>Activez ou d&#233;sactivez les cibles d&#233;finies pour la ressource, comme vous le
souhaitez. </b></li>
<li><b>Cliquez sur le bouton Gestion des cibles pour ajouter ou supprimer des
cibles de la ressource. </b></li></ol><p>Voir <a href="task-jdbcresourcetargets.html">Pour modifier les cibles de ressources JDBC</a> pour plus d'informations. </p></li>
<li><b>Cliquez sur l'onglet G&#233;n&#233;ral pour revenir &#224; la page Modification d'une ressource
JDBC. </b></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><p></b>Voir aussi</b></p>
<ul><li><p><a href="task-setdbaccess.html">Configurer l'acc&#232;s &#224; la base de donn&#233;es</a></p>

</li>
<li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcenew.html">Cr&#233;er une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcetargets.html">Pour modifier les cibles de ressources JDBC</a></p>

</li>
<li><p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p>

</li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s d'un pool de connexions JDBC</a></p>

</li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle et/ou ses affili&#233;s. Tous droits r&#233;serv&#233;s. <a href="docinfo.html">Notice l&#233;gale</a></small>
