<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 1997, 2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at packager/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>Copyright</title>
</head>
<body>
<!-- help content -->
<a name="wp1022127"> </a>
<h2 class="pHeading2">Copyright
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Copyright &copy; 2005, 2010, Oracle y/o sus subsidiarias. Todos los derechos reservados.
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">Este software y la documentaci&oacute;n relacionada est&aacute;n sujetos a un contrato de licencia que incluye restricciones de uso y revelaci&oacute;n, y se encuentran protegidos por la legislaci&oacute;n sobre la propiedad intelectual. A menos que figure expl&iacute;citamente en el contrato de licencia o est&eacute; permitido por la ley, no se podr&aacute; utilizar, copiar, reproducir, traducir, emitir, modificar, conceder licencias, transmitir, distribuir, exhibir, representar, publicar ni mostrar ninguna parte, de ninguna forma, por ning&uacute;n medio. Queda prohibida la ingenier&iacute;a inversa, desensamblaje o descompilaci&oacute;n de este software, excepto en la medida en que sean necesarios para conseguir interoperabilidad seg&uacute;n lo especificado por la legislaci&oacute;n aplicable.
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">
  La informaci&oacute;n contenida en este documento puede someterse a modificaciones sin previo aviso y no se garantiza que se encuentre exenta de errores. Si detecta alg&uacute;n error, le agradeceremos que nos lo comunique por escrito.
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">
  Si este software o la documentaci&oacute;n relacionada se entrega al Gobierno de EE.UU. o a cualquier entidad que adquiera licencias en nombre del Gobierno de EE.UU. se aplicar&aacute; la siguiente disposici&oacute;n:
</p>
<a name="wp1022136"> </a>
<p class="pParagraph">
  U.S. GOVERNMENT RIGHTS 
Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are &quot;commercial computer software&quot; or &quot;commercial technical data&quot; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065
</p>
<a name="wp1022137"> </a>
<p class="pParagraph">
  Este software o hardware se ha desarrollado para uso general en diversas aplicaciones de gesti&oacute;n de la informaci&oacute;n. No se ha dise&ntilde;ado ni est&aacute; destinado para utilizarse en aplicaciones de riesgo inherente, incluidas las aplicaciones que pueden causar da&ntilde;os personales. Si utiliza este software o hardware en aplicaciones de riesgo, usted ser&aacute; responsable de tomar todas las medidas apropiadas de prevenci&oacute;n de fallos, copia de seguridad, redundancia o de cualquier otro tipo para garantizar la seguridad en el uso de este software o hardware. Oracle Corporation y sus subsidiarias declinan toda responsabilidad derivada de los da&ntilde;os causados por el uso de este software o hardware en aplicaciones de riesgo.
</p>
<a name="wp1022138"> </a>
<p class="pParagraph">
  Oracle y Java son marcas comerciales registradas de Oracle y/o sus subsidiarias. Todos los dem&aacute;s nombres pueden ser marcas comerciales de sus respectivos propietarios.
</p>
<a name="wp1022139"> </a>
<p class="pParagraph">
  AMD, Opteron, el logotipo de AMD y el logotipo de AMD Opteron son marcas comerciales o marcas comerciales registradas de Advanced Micro Devices. Intel e Intel Xeon son marcas comerciales o marcas comerciales registradas de Intel Corporation. Todas las marcas comerciales de SPARC se utilizan con licencia y son marcas comerciales o marcas comerciales registradas de SPARC International, Inc. UNIX es una marca comercial registrada con acuerdo de licencia de X/Open Company, Ltd.
</p>
<a name="wp1022140"> </a>
<p class="pParagraph">
  Este software o hardware y la documentaci&oacute;n pueden ofrecer acceso a contenidos, productos o servicios de terceros o informaci&oacute;n sobre los mismos. Ni Oracle Corporation ni sus subsidiarias ser&aacute;n responsables de ofrecer cualquier tipo de garant&iacute;a sobre el contenido, los productos o los servicios de terceros y renuncian expl&iacute;citamente a ello. Oracle Corporation y sus subsidiarias no se har&aacute;n responsables de las p&eacute;rdidas, los costos o los da&ntilde;os en los que se incurra como consecuencia del acceso o el uso de contenidos, productos o servicios de terceros.
</p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">Informaci&oacute;n jur&iacute;dica</a>
</body>
</html>




