#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

Usage#
deploy.command=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u306b\u914d\u5099\u3057\u307e\u3059
deploy.command.usagetext=deploy\n\t[--target[=<target(default:server)>]]\n\t[--virtualservers <virtual_servers>] [--contextroot <context_root>]\n\t[--force[=<force(default:false)>]]\n\t[--precompilejsp[=<precompilejsp(default:false)>]]\n\t[--verify[=<verify(default:false)>]] [--name <component_name>]\n\t[--upload[=<upload(default:false)>]] [--retrieve <local_dirpath>]\n\t[--dbvendorname <dbvendorname>]\n\t[--createtables[=createtables(default:false)>] |\n\t --dropandcreatetables[=<dropandcreatetables(default:false)>]]\n\t[--uniquetablenames[=<uniquetablenames(default:false)>]]\n\t[--deploymentplan <deployment_plan>]\n\t[--enabled[=<enabled(default:true)>]]\n\t[--availabilityenabled[=<availabilityenabled(default:false)>]]\n\t[--lbenabled[=<lbenabled(default:true)>]]\n\t[--asyncreplication[=<asyncreplication(default:true)>]]\n\t[--keepstate[=<keepstate(default:false)>]]\n\t[--generatermistubs[=<generatermistubs(default:false)>]]\n\t[--libraries jar_file[,jar_file*]] [--type <pkg-type>]\n\t[--properties (name=value)[:name=value]*]\n\t[-?|--help[=<help(default:false)>]] file_archive | filepath
deploy.command.path=\u914d\u5099\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9
deploy.command.name=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u540d\u524d
deploy.command.contextroot=Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30eb\u30fc\u30c8\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u62e1\u5f35\u5b50\u306a\u3057\u306e\u30d5\u30a1\u30a4\u30eb\u540d\u3067\u3059\u3002
deploy.command.libraries=\u30e9\u30a4\u30d6\u30e9\u30ea JAR \u30d5\u30a1\u30a4\u30eb\u306e\u30b3\u30f3\u30de\u533a\u5207\u308a\u30ea\u30b9\u30c8\u3067\u3059\u3002 
deploy.command.force=true \u306e\u5834\u5408\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u518d\u914d\u5099\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false \u3067\u3059\u3002
deploy.command.precompilejsp=true \u306e\u5834\u5408\u3001\u914d\u5099\u4e2d\u306b JSP \u304c\u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false \u3067\u3059\u3002
deploy.command.verify=true \u306e\u5834\u5408\u3001\u914d\u5099\u8a18\u8ff0\u5b50\u306e\u69cb\u6587\u3068\u610f\u5473\u8ad6\u304c\u691c\u8a3c\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false \u3067\u3059\u3002
deploy.command.retrieve=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b9\u30bf\u30d6 JAR \u30d5\u30a1\u30a4\u30eb\u3092\u30b5\u30fc\u30d0\u30fc\u30de\u30b7\u30f3\u304b\u3089\u53d6\u5f97\u3057\u3066\u30ed\u30fc\u30ab\u30eb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u914d\u7f6e\u3057\u307e\u3059\u3002
deploy.command.dbvendorname=\u4f5c\u6210\u3059\u308b\u30c6\u30fc\u30d6\u30eb\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30d9\u30f3\u30c0\u30fc\u306e\u540d\u524d\u3002
deploy.command.createtables=CMP Bean \u304c\u30de\u30c3\u30d7\u3055\u308c\u3066\u3044\u306a\u3044\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u914d\u5099\u3059\u308b\u3068\u304d\u306b\u30c6\u30fc\u30d6\u30eb\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
deploy.command.dropandcreatetables=true \u306e\u5834\u5408\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u518d\u914d\u5099\u6642\u306b\u3001\u4ee5\u524d\u306e\u914d\u5099\u6642\u306b\u4f5c\u6210\u3055\u308c\u305f\u30c6\u30fc\u30d6\u30eb\u304c\u3001\u65b0\u3057\u3044\u30c6\u30fc\u30d6\u30eb\u3092\u4f5c\u6210\u3059\u308b\u524d\u306b\u30c9\u30ed\u30c3\u30d7\u3055\u308c\u307e\u3059\u3002
deploy.command.uniquetablenames=\u3059\u3079\u3066\u306e Bean \u306b\u5bfe\u3057\u3066\u4e00\u610f\u306e\u30c6\u30fc\u30d6\u30eb\u540d\u304c\u4ed8\u3051\u3089\u308c\u308b\u3053\u3068\u3092\u4fdd\u8a3c\u3059\u308b\u305f\u3081\u3001\u30c6\u30fc\u30d6\u30eb\u540d\u306b\u30cf\u30c3\u30b7\u30e5\u30b3\u30fc\u30c9\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
deploy.command.deploymentplan=\u914d\u5099\u8a08\u753b (Sun \u56fa\u6709\u306e\u8a18\u8ff0\u5b50\u304c\u542b\u307e\u308c\u3066\u3044\u308b JAR) \u3092\u53d6\u5f97\u3057\u3066\u914d\u5099\u3057\u307e\u3059\u3002
deploy.command.enabled=true \u306e\u5834\u5408\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3078\u306e\u30a2\u30af\u30bb\u30b9\u304c\u30e6\u30fc\u30b6\u30fc\u306b\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f true \u3067\u3059\u3002
deploy.command.generatermistubs=true \u306e\u5834\u5408\u3001\u9759\u7684 RMI-IIOP \u30b9\u30bf\u30d6\u304c\u751f\u6210\u3055\u308c\u3001client.jar \u306b\u914d\u7f6e\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false \u3067\u3059\u3002
deploy.command.availabilityenabled=true \u306e\u5834\u5408\u3001SFSB \u30c1\u30a7\u30c3\u30af\u30dd\u30a4\u30f3\u30c8\u306e\u8a2d\u5b9a\u3084\u30d1\u30c3\u30b7\u30d9\u30fc\u30b7\u30e7\u30f3\u3092\u884c\u3046\u5834\u5408\u306b\u5099\u3048\u3066\u3001\u9ad8\u53ef\u7528\u6027\u304c\u6709\u52b9\u306b\u306a\u308a\u307e\u3059\u3002\u30af\u30e9\u30b9\u30bf\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30c9\u30e1\u30a4\u30f3\u3067\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
deploy.command.target=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u914d\u5099\u3059\u308b\u30bf\u30fc\u30b2\u30c3\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
deploy.command.properties=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30e9\u30f3\u30bf\u30a4\u30e0\u306b\u6e21\u3055\u308c\u308b\u540d\u524d/\u5024\u30da\u30a2\u3068\u3057\u3066\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
deploy.nocontainer=\u767b\u9332\u6e08\u307f\u3001\u5b9f\u884c\u6e08\u307f\u306e\u30b3\u30f3\u30c6\u30ca\u30b5\u30fc\u30d3\u30b9\u304c\u3042\u308a\u307e\u305b\u3093...
application.alreadyreg.redeploy={0} \u3068\u3044\u3046\u540d\u524d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3059\u3067\u306b\u914d\u5099\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u518d\u914d\u5099\u3092\u5f37\u5236\u7684\u306b\u884c\u3046\u5fc5\u8981\u304c\u3042\u308b\u3053\u3068\u3092\u6307\u5b9a\u3059\u308b\u304b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u914d\u5099\u3057\u307e\u3059\u3002\u307e\u305f\u306f\u3001\u65b0\u898f\u914d\u5099\u306e\u5834\u5408\u306f\u3001\u5225\u306e\u540d\u524d\u3092\u9078\u629e\u3057\u307e\u3059\u3002 
deploy.command.success={0} \u3068\u3044\u3046\u540d\u524d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u914d\u5099\u3055\u308c\u307e\u3057\u305f\u3002
deploy.command.successwithwarning={0} \u3068\u3044\u3046\u540d\u524d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u6b63\u5e38\u306b\u914d\u5099\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u6b21\u306e\u8b66\u544a\u304c\u767a\u751f\u3057\u307e\u3057\u305f:
deploy.unknownarchivetype=\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u7a2e\u985e {0} \u306f\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f
deploy.unknowntype={0} \u306f\u8a8d\u8b58\u3055\u308c\u3066\u3044\u308b\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u7a2e\u985e\u3067\u306f\u3042\u308a\u307e\u305b\u3093
deploy.unknowncontainer={0} \u306f\u8a8d\u8b58\u3055\u308c\u3066\u3044\u308b\u30b3\u30f3\u30c6\u30ca\u3067\u306f\u3042\u308a\u307e\u305b\u3093 
deploy.unknownarchiveformat=\u8a8d\u8b58\u3055\u308c\u3066\u3044\u306a\u3044\u30a2\u30fc\u30ab\u30a4\u30d6\u30d5\u30a9\u30fc\u30de\u30c3\u30c8
deploy.errorexpandingjar=jar \u30d5\u30a1\u30a4\u30eb\u306e\u5c55\u958b\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
deploy.cannotcreateexpansiondir=jar \u306e\u5c55\u958b {0} \u3067\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u304c\u3001\u7d9a\u884c\u3057\u3066\u3044\u307e\u3059
deploy.errorclosingarchive=\u914d\u5099\u53ef\u80fd\u306a\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8 {0} \u3092\u9589\u3058\u3066\u3044\u308b\u9593\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
deploy.invalidpropertyformat=\u914d\u5099\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c NAME=VALUE \u306e\u5f62\u5f0f\u306b\u5f93\u3063\u3066\u3044\u307e\u305b\u3093: {0}
deploy.errOpeningArtifact=\u914d\u5099\u53ef\u80fd\u306a\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u3092\u958b\u3044\u3066\u3044\u308b\u9593\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
deploy.errDuringDepl=\u914d\u5099\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001server.log \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
deploy.errClosingArtifact=\u914d\u5099\u53ef\u80fd\u306a\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8 {0} \u3092\u9589\u3058\u3066\u3044\u308b\u9593\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
deploy.done={0} \u306f\u3001{1} \u30df\u30ea\u79d2\u3067\u6b63\u5e38\u306b\u914d\u5099\u3055\u308c\u307e\u3057\u305f\u3002
deploy.failverifier=\u6307\u5b9a\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3059\u308b\u4e00\u90e8\u306e\u30d9\u30ea\u30d5\u30a1\u30a4\u30a2\u30c6\u30b9\u30c8\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u914d\u5099\u3092\u4e2d\u6b62\u3057\u3066\u3044\u307e\u3059\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001server.log \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
deploy.remoteDirDeployChecksumMismatch=\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e {0} \u306b\u3042\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u914d\u5099\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30c9\u30e1\u30a4\u30f3\u7ba1\u7406\u30b5\u30fc\u30d0\u30fc\u306e\u540c\u3058\u30d1\u30b9\u306b\u3042\u308b\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u30d5\u30a1\u30a4\u30eb\u3068\u306f\u7570\u306a\u308a\u307e\u3059\u3002\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u4e00\u81f4\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u4e00\u81f4\u3057\u3066\u3044\u306a\u3044\u3068\u3001\u305d\u308c\u4ee5\u5916\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u5225\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u914d\u5099\u3055\u308c\u307e\u3059\u3002
download.errDownloading=\u751f\u6210\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
compat.value.not.supported=\u8b66\u544a: {0} \u306f\u4e92\u63db\u6027\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306f v2 \u3067\u3059\u3002\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
#
undeploy.command=\u4ee5\u524d\u306b\u914d\u5099\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u914d\u5099\u3092\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u53d6\u308a\u6d88\u3057\u307e\u3059
undeploy.command.usagetext=undeploy\n\t[--target[=<target(default:server)>]]\n\t[--droptables[=<droptables(default:false)>]]\n\t[--cascade[=<cascade(default:false)>]]\n\t[-?|--help[=<help(default:false)>]] name
undeploy.command.name=\u914d\u5099\u3055\u308c\u3066\u3044\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u540d\u524d
undeploy.command.target=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u914d\u5099\u3092\u53d6\u308a\u6d88\u3059\u30bf\u30fc\u30b2\u30c3\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
undeploy.command.success={0} \u306e\u914d\u5099\u304c\u6b63\u5e38\u306b\u53d6\u308a\u6d88\u3055\u308c\u307e\u3057\u305f
undeploy.contextcreation.failed =\u914d\u5099\u3092\u53d6\u308a\u6d88\u3059\u305f\u3081\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093: {0}

#
deploydir.command=\u5c55\u958b\u5f62\u5f0f\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u914d\u5099\u3057\u307e\u3059\u3002\u3053\u306e\u30b3\u30de\u30f3\u30c9\u306f\u63a8\u5968\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002deploy \u30b3\u30de\u30f3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002deploy \u30b3\u30de\u30f3\u30c9\u306e\u8a73\u7d30\u306a\u8aac\u660e\u306b\u3064\u3044\u3066\u306f\u3001\u300cdeploy --help\u300d\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
deploydir.command.usagetext=deploydir\n\t[--target[=<target(default:server)>]]\n\t[--virtualservers <virtual_servers>] [--contextroot <context_root>]\n\t[--force[=<force(default:false)>]]\n\t[--precompilejsp[=<precompilejsp(default:false)>]]\n\t[--verify[=<verify(default:false)>]] [--name <component_name>]\n\t[--retrieve <local_dirpath>]\n\t[--dbvendorname <dbvendorname>]\n\t[--createtables[=createtables(default:false)>] |\n\t --dropandcreatetables[=<dropandcreatetables(default:false)>]]\n\t[--uniquetablenames[=<uniquetablenames(default:false)>]]\n\t[--deploymentplan <deployment_plan>]\n\t[--enabled[=<enabled(default:true)>]]\n\t[--availabilityenabled[=<availabilityenabled(default:false)>]]\n\t[--lbenabled[=<lbenabled(default:true)>]]\n\t[--asyncreplication[=<asyncreplication(default:true)>]]\n\t[--keepstate[=<keepstate(default:false)>]]\n\t[--generatermistubs[=<generatermistubs(default:false)>]]\n\t[--libraries jar_file[,jar_file*]] [--type <pkg-type>]\n\t[--properties (name=value)[:name=value]*]\n\t[-?|--help[=<help(default:false)>]] dirpath

#
redeploy.command=\u4ee5\u524d\u306b\u914d\u5099\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u914d\u5099\u3057\u307e\u3059\u3002  
redeploy.command.name=\u518d\u914d\u5099\u3059\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u540d\u524d\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u5fc5\u9808\u3067\u3059\u3002
redeploy.command.path=\u914d\u5099\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9\u3002
redeploy.command.invalid.path=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d1\u30b9\u3092\u7279\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
redeploy.command.cannot.redeploy=\u30d1\u30b9\u30aa\u30da\u30e9\u30f3\u30c9\u3092\u6307\u5b9a\u305b\u305a\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u3092\u518d\u914d\u5099\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
redeploy.command.success={0} \u304c\u6b63\u5e38\u306b\u518d\u914d\u5099\u3055\u308c\u307e\u3057\u305f
redeploy.command.usagetext=redeploy\n\t[--target[=<target(default:server)>]]\n\t[--virtualservers <virtual_servers>] [--contextroot <context_root>]\n\t[--precompilejsp[=<precompilejsp(default:false)>]]\n\t[--verify[=<verify(default:false)>]] --name <component_name>\n\t[--upload[=<upload(default:false)>]] [--retrieve <local_dirpath>]\n\t[--dbvendorname <dbvendorname>]\n\t[--createtables[=createtables(default:false)>] |\n\t --dropandcreatetables[=<dropandcreatetables(default:false)>]]\n\t[--uniquetablenames[=<uniquetablenames(default:false)>]]\n\t[--deploymentplan <deployment_plan>]\n\t[--enabled[=<enabled(default:true)>]]\n\t[--availabilityenabled[=<availabilityenabled(default:false)>]]\n\t[--lbenabled[=<lbenabled(default:true)>]]\n\t[--asyncreplication[=<asyncreplication(default:true)>]]\n\t[--keepstate[=<keepstate(default:false)>]]\n\t[--generatermistubs[=<generatermistubs(default:false)>]]\n\t[--libraries jar_file[,jar_file*]] [--type <pkg-type>]\n\t[--properties (name=value)[:name=value]*]\n\t[-?|--help[=<help(default:false)>]] [file_archive | filepath]

#
enable.command=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u6709\u52b9\u306b\u3057\u307e\u3059
enable.command.target=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u6709\u52b9\u306b\u3059\u308b\u30bf\u30fc\u30b2\u30c3\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
enable.command.component=\u6709\u52b9\u306b\u3059\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u540d\u524d\u3002
enable.command.success={0} \u304c\u6b63\u5e38\u306b\u6709\u52b9\u5316\u3055\u308c\u307e\u3057\u305f

#
disable.command=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u7121\u52b9\u306b\u3057\u307e\u3059
disable.command.usagetext=disable\n\t[--target[=<target(default:server)>]]\n\t[-?|--help[=<help(default:false)>]] component
disable.command.component=\u7121\u52b9\u306b\u3059\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u540d\u524d
disable.command.success={0} \u304c\u6b63\u5e38\u306b\u7121\u52b9\u5316\u3055\u308c\u307e\u3057\u305f
disable.command.failed={0} \u306e\u7121\u52b9\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f

#
failToLoadOnInstance=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {0} \u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u6b63\u3057\u304f\u5b9f\u884c\u3055\u308c\u307e\u305b\u3093\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u4fee\u6b63\u3057\u3066\u304b\u3089\u914d\u5099\u3057\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n{1}\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001server.log \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002 

#
list.components=\u30e6\u30fc\u30b6\u30fc\u304c\u914d\u5099\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\u3002
list.components.type=\u4e00\u89a7\u8868\u793a\u3059\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u7a2e\u985e\u3002\u8a72\u5f53\u3059\u308b\u7a2e\u985e\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3001EJB\u3001Web\u3001\u30b3\u30cd\u30af\u30bf\u3001\u304a\u3088\u3073 Web \u30b5\u30fc\u30d3\u30b9\u3067\u3059\u3002\u4f55\u3082\u6307\u5b9a\u3057\u306a\u3044\u3068\u3001\u3059\u3079\u3066\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002
list.components.success=list-components \u304c\u6210\u529f\u3057\u307e\u3057\u305f\u3002
list.components.command.invalid.type=\u30aa\u30d7\u30b7\u30e7\u30f3\u5024\u306e\u30bf\u30a4\u30d7\u304c\u7121\u52b9\u3067\u3059\u3002
list.components.no.elements.to.list=\u8868\u793a\u3059\u308b\u9805\u76ee\u304c\u3042\u308a\u307e\u305b\u3093\u3002
list.applications.success=list-applications \u304c\u6210\u529f\u3057\u307e\u3057\u305f\u3002
list.applications=\u30e6\u30fc\u30b6\u30fc\u304c\u914d\u5099\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\u3002\u6709\u52b9\u306a\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u4e00\u89a7\u306b\u3064\u3044\u3066\u306f\u3001\u300clist-applications --help\u300d\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
list.applications.warning=\u8b66\u544a: \u3053\u306e\u30b3\u30de\u30f3\u30c9\u306f\u524a\u9664\u3055\u308c\u308b\u4e88\u5b9a\u3067\u3059\u3002list-components \u30b3\u30de\u30f3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
list.applications.verbose.enabled=\u6709\u52b9
list.applications.verbose.disabled=\u7121\u52b9

#
component.status={0} \u306e\u72b6\u614b\u306f {1} \u3067\u3059\u3002

# common strings
application.alreadyreg=[{0}] \u3068\u3044\u3046\u540d\u524d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3059\u3067\u306b\u914d\u5099\u3055\u308c\u3066\u3044\u307e\u3059\u3002
application.notreg=[{0}] \u3068\u3044\u3046\u540d\u524d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u914d\u5099\u3055\u308c\u3066\u3044\u307e\u305b\u3093
lifecycle.alreadyreg=[{0}] \u3068\u3044\u3046\u540d\u524d\u306e\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059
lifecycle.notreg=[{0}] \u3068\u3044\u3046\u540d\u524d\u306e\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u5b58\u5728\u3057\u307e\u305b\u3093
ref.not.referenced.target=\u3053\u306e\u30bf\u30fc\u30b2\u30c3\u30c8 [{1}] \u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u306f\u914d\u5099\u3055\u308c\u3066\u3044\u307e\u305b\u3093
lifecycle.not.referenced.target=\u3053\u306e\u30bf\u30fc\u30b2\u30c3\u30c8 [{1}] \u306b\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u30e2\u30b8\u30e5\u30fc\u30eb {0} \u306f\u914d\u5099\u3055\u308c\u3066\u3044\u307e\u305b\u3093
virtualservers=\u30b3\u30de\u30f3\u30c9\u3092\u9069\u7528\u3059\u308b\u4eee\u60f3\u30b5\u30fc\u30d0\u30fc\u306e\u4e00\u89a7
fnf=\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
invalidconfig=domain.xml \u30a8\u30f3\u30c8\u30ea\u304c\u7121\u52b9\u3067\u3059\u3002\u30d0\u30b0\u3092\u767b\u9332\u3057\u3066\u304f\u3060\u3055\u3044
nocontainer=\u767b\u9332\u6e08\u307f\u3001\u5b9f\u884c\u6e08\u307f\u306e\u30b3\u30f3\u30c6\u30ca\u30b5\u30fc\u30d3\u30b9\u304c\u3042\u308a\u307e\u305b\u3093...
unknownmoduletpe=\u30e2\u30b8\u30e5\u30fc\u30eb\u30bf\u30a4\u30d7\u304c\u8a8d\u8b58\u3067\u304d\u307e\u305b\u3093

appref.already.exists=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u53c2\u7167 {0} \u306f\u3001\u3059\u3067\u306b\u30bf\u30fc\u30b2\u30c3\u30c8 {1} \u306b\u5b58\u5728\u3057\u307e\u3059\u3002
appref.not.exists=\u30bf\u30fc\u30b2\u30c3\u30c8 {1} \u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u3078\u306e\u53c2\u7167\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002


wildcard.not.allowed=\u8b66\u544a: \u30d0\u30fc\u30b8\u30e7\u30f3\u5f0f\u3092\u4f7f\u7528\u3067\u304d\u308b\u306e\u306f\u3001--enabled=false \u306e\u5834\u5408\u3060\u3051\u3067\u3059
