<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a><a id="GHCLU00014" name="GHCLU00014"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>&#21474;&#38598;&#29305;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#21474;&#38598;&#29305;&#24615;&#12301; &#38913;&#38754;&#26371;&#39023;&#31034;&#28858;&#25152;&#36984;&#21462;&#21474;&#38598;&#35373;&#23450;&#30340;&#29305;&#24615;&#28165;&#21934;&#12290;&#36889;&#20123;&#29305;&#24615;&#21487;&#22686;&#21152;&#26377;&#38364;&#21474;&#38598;&#30340;&#36984;&#25799;&#24615;&#32068;&#24907;&#36039;&#35338;&#12290;</p>
<p>&#12300;&#21474;&#38598;&#21517;&#31281;&#12301; &#27396;&#20301;&#26159;&#21807;&#35712;&#27396;&#20301;&#65292;&#26371;&#39023;&#31034;&#25152;&#36984;&#21462;&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#23565;&#26044;&#27599;&#20491;&#29305;&#24615;&#65292;&#37117;&#26371;&#39023;&#31034;&#20197;&#19979;&#36039;&#35338;&#65306;</p>
<dl>
<dt>&#21517;&#31281;</dt>
<dd>
<p>&#29305;&#24615;&#30340;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#20540;</dt>
<dd>
<p>&#28858;&#25152;&#36984;&#21462;&#23526;&#20363;&#35373;&#23450;&#30340;&#29305;&#24615;&#20540;&#12290;</p>
</dd>
<dt>&#35498;&#26126;</dt>
<dd>
<p>&#25552;&#20379;&#26377;&#38364;&#29305;&#24615;&#20043;&#26356;&#22810;&#36039;&#35338;&#30340;&#25991;&#23383;&#35498;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#20854;&#20182;&#29305;&#24615;&#34920;&#20063;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#22686;&#21152;&#29305;&#24615;</dt>
<dd>
<p>&#22686;&#21152;&#29305;&#24615;&#30340;&#25353;&#37397;&#12290;&#25353;&#19968;&#19979;&#27492;&#25353;&#37397;&#21363;&#21487;&#22312;&#20854;&#20182;&#29305;&#24615;&#34920;&#20013;&#22686;&#21152;&#19968;&#21015;&#12290;</p>
</dd>
<dt>&#21034;&#38500;&#29305;&#24615;</dt>
<dd>
<p>&#21034;&#38500;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#29305;&#24615;&#30340;&#25353;&#37397;&#12290;&#21034;&#38500;&#30340;&#20219;&#20309;&#29305;&#24615;&#37117;&#26371;&#24489;&#21407;&#25104;&#20854;&#38928;&#35373;&#20540;&#25110;&#26410;&#23450;&#32681; (&#22914;&#26524;&#26410;&#35373;&#23450;&#20219;&#20309;&#38928;&#35373;&#20540;)&#12290;</p>
</dd>
</dl>
<p>GlassFish Server &#26371;&#23450;&#32681;&#19979;&#21015;&#21474;&#38598;&#29305;&#24615;&#65306;</p>
<dl>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>&#21474;&#38598;&#20597;&#32893;&#20358;&#33258;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209; (GMS) &#20043;&#35338;&#24687;&#25152;&#29992;&#36899;&#25509;&#22496;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <code>${GMS_LISTENER_PORT-</code><i>cluster-name</i><code>}</code>&#12290;&#22312;&#22823;&#37096;&#20998;&#24773;&#27841;&#19979;&#65292;&#27492;&#38928;&#35373;&#20540;&#23601;&#25033;&#36275;&#22816;&#12290;</p>
<p>&#19981;&#36942;&#65292;&#22914;&#26524; GMS <b>&#26410;</b>&#20351;&#29992;&#22810;&#37325;&#25773;&#36865;&#20358;&#24291;&#25773;&#35338;&#24687;&#65292;&#21063;&#27492;&#29305;&#24615;&#24517;&#38920;&#25351;&#23450;&#23565;&#21474;&#38598;&#20013;&#25152;&#26377; GlassFish Server &#23526;&#20363;&#32780;&#35328;&#37117;&#26377;&#25928;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;&#33509;&#35201;&#35731;&#38928;&#35373;&#20540;&#31526;&#21512;&#27492;&#38656;&#27714;&#65292;&#35531;&#20351;&#29992;&#31995;&#32113;&#29305;&#24615;&#20358;&#20491;&#21029;&#35373;&#23450;&#27599;&#20491;&#23526;&#20363;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20351;&#29992;<a href="ref-clustersystemproperties.html">&#21474;&#38598;&#31995;&#32113;&#29305;&#24615;</a>&#38913;&#38754;&#21487;&#24314;&#31435;&#31995;&#32113;&#29305;&#24615; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12290;&#28982;&#24460;&#65292;&#23559;&#21474;&#38598;&#20013;&#27599;&#20491;&#23526;&#20363;&#30340; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#31995;&#32113;&#29305;&#24615;&#35373;&#23450;&#28858;&#23526;&#20363;&#20597;&#32893;&#20358;&#33258; GMS &#20043;&#35338;&#24687;&#25152;&#29992;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;&#21474;&#38598;&#20043; <code>GMS_LISTENER_PORT</code> &#29305;&#24615;&#30340;&#38928;&#35373;&#20540;&#26371;&#21443;&#29031;&#27492;&#31995;&#32113;&#29305;&#24615;&#12290;</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>&#25351;&#23450;&#23526;&#20363;&#26159;&#21542;&#26371;&#25910;&#21040;&#20854;&#26412;&#36523;&#30340;&#25033;&#29992;&#31243;&#24335;&#23652;&#32026;&#35338;&#24687; (&#30001;&#23526;&#20363;&#24291;&#25773;&#21040;&#21474;&#38598;)&#12290;</p>
<p>&#21487;&#33021;&#20540;&#22914;&#19979;&#65306;</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>&#23526;&#20363;<i>&#19981;&#26371;</i>&#25910;&#21040;&#20854;&#26412;&#36523;&#30340;&#35338;&#24687; (&#38928;&#35373;)&#12290;</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>&#23526;&#20363;&#21487;&#20197;&#25910;&#21040;&#20854;&#26412;&#36523;&#30340;&#35338;&#24687;&#12290;&#20351;&#29992;&#27492;&#35373;&#23450;&#65292;&#21487;&#22312;&#23526;&#20363;&#26159;&#21474;&#38598;&#20013;&#30340;&#21807;&#19968;&#23526;&#20363;&#26178;&#28204;&#35430;&#35442;&#23526;&#20363;&#12290;</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>&#22312;&#25448;&#26820;&#35338;&#24687;&#20043;&#21069;&#65292;&#19979;&#21015;&#20107;&#20214;&#39006;&#22411;&#30340;&#22810;&#37325;&#25773;&#36865;&#35338;&#24687;&#21487;&#32147;&#27511;&#30340;&#37325;&#35079;&#36939;&#31639;&#25110;&#20659;&#36664;&#25976;&#30446;&#19978;&#38480;&#65306;</p>
<ul>
<li>
<p>&#32676;&#32068;&#25506;&#32034;</p>
</li>
<li>
<p>&#25104;&#21729;&#27963;&#21205;&#35338;&#34399;</p>
</li>
<li>
<p>&#25104;&#21729;&#36523;&#20221;&#35722;&#26356;</p>
</li>
</ul>
<p>&#28858;&#20102;&#31526;&#21512;&#24314;&#32622; DAS &#33287;&#21474;&#38598;&#23526;&#20363;&#25152;&#22312;&#20043;&#32178;&#36335;&#30340;&#32068;&#24907;&#65292;&#35531;&#20760;&#21487;&#33021;&#23559;&#27492;&#20540;&#35373;&#20302;&#12290;&#33509;&#35201;&#21028;&#26039;&#31995;&#32113;&#21487;&#34892;&#30340;&#26368;&#20302;&#20540;&#65292;&#35531;&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a> &#23376;&#21629;&#20196;&#12290;</p>
<p>&#20540;&#28858; 0 &#26178;&#21487;&#30906;&#20445;&#22810;&#37325;&#25773;&#36865;&#35338;&#24687;&#32085;&#23565;&#19981;&#26371;&#38626;&#38283;&#24291;&#25773;&#23427;&#20497;&#30340;&#20027;&#27231;&#12290;</p>
<p>&#20540;&#28858; 1 &#26178;&#21487;&#36991;&#20813;&#22312;&#36879;&#36942;&#20132;&#25563;&#22120;&#25110;&#36335;&#30001;&#22120;&#36899;&#32218;&#20043;&#30456;&#21516;&#23376;&#32178;&#36335;&#19978;&#30340;&#20027;&#27231;&#20043;&#38291;&#24291;&#25773;&#35338;&#24687;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 4&#65292;&#21487;&#30906;&#20445;&#22312;&#20027;&#27231;&#26159;&#36879;&#36942;&#20132;&#25563;&#22120;&#25110;&#36335;&#30001;&#22120;&#36899;&#32218;&#30340;&#32178;&#36335;&#20013;&#65292;&#23559;&#35338;&#24687;&#25104;&#21151;&#24291;&#25773;&#21040;&#25152;&#26377;&#21474;&#38598;&#25104;&#21729;&#12290;</p>
</dd>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>GMS &#35201;&#23559;&#32676;&#32068;&#20107;&#20214;&#20659;&#36865;&#33267;&#20854;&#20013;&#30340; GlassFish Server &#23526;&#20363;&#20301;&#32622;&#12290;&#21482;&#26377;&#22312; GMS &#26410;&#20351;&#29992;&#22810;&#37325;&#25773;&#36865;&#20358;&#24291;&#25773;&#35338;&#24687;&#26178;&#65292;&#25165;&#38656;&#35201;&#27492;&#29305;&#24615;&#12290;</p>
<p>&#27492;&#29305;&#24615;&#30340;&#26377;&#25928;&#20540;&#22914;&#19979;&#65306;</p>
<ul>
<li>
<p>&#32113;&#19968;&#36039;&#28304;&#35672;&#21029;&#30908; (URI) &#30340;&#36887;&#34399;&#20998;&#38548;&#28165;&#21934;&#12290;&#27599;&#20491; URI &#37117;&#24517;&#38920;&#25214;&#21040; GlassFish Server &#23526;&#20363;&#12290;&#22914;&#26524;&#22810;&#20491; GlassFish Server &#23526;&#20363;&#22312;&#30456;&#21516;&#20027;&#27231;&#19978;&#22519;&#34892;&#65292;&#21063;&#38656;&#20351;&#29992;&#27492;&#26684;&#24335;&#12290;</p>
<p>&#28165;&#21934;&#20013;&#27599;&#20491; URI &#30340;&#26684;&#24335;&#22914;&#19979;&#65306;</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i> &#26159; URI &#26041;&#26696; (&#28858; <code>tcp</code>)&#12290;</p>
</li>
<li>
<p><i>host-name-or -IP-address</i> &#26159;&#22519;&#34892;&#23526;&#20363;&#25152;&#22312;&#20043;&#20027;&#27231;&#30340;&#20027;&#27231;&#21517;&#31281;&#25110; IP &#20301;&#22336;&#12290;</p>
</li>
<li>
<p><i>port</i> &#26159;&#23526;&#20363;&#20597;&#32893;&#20358;&#33258; GMS &#20043;&#35338;&#24687;&#25152;&#29992;&#36899;&#25509;&#22496;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;&#24744;&#24517;&#38920;&#35373;&#23450;&#23526;&#20363;&#30340;&#31995;&#32113;&#29305;&#24615; <code>GMS_LISTENER_PORT-</code><i>clustername</i>&#12290;&#22914;&#38656;&#26377;&#38364;&#22914;&#20309;&#28858;&#23526;&#20363;&#35373;&#23450;&#27492;&#31995;&#32113;&#29305;&#24615;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;</p>
</li>
</ul>
</li>
</ul>
</dd>
</dl>



<p><i>Oracle GlassFish Server High Availability Administration Guide</i><i>Locating GlassFish Server Instances When Multicast Is Disabled</i><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">&#12290;</a></p>
<p>IP &#20301;&#22336;&#25110;&#20027;&#27231;&#21517;&#31281;&#30340;&#36887;&#34399;&#20998;&#38548;&#28165;&#21934;&#12290;&#27492;&#28165;&#21934;&#21487;&#21516;&#26178;&#21253;&#21547; IP &#20301;&#22336;&#21644;&#20027;&#27231;&#21517;&#31281;&#12290;&#21482;&#26377;&#30070;&#27599;&#20491;&#20027;&#27231;&#19978;&#22343;&#22519;&#34892;&#19968;&#20491;&#21474;&#38598;&#23526;&#20363;&#26178;&#65292;&#25165;&#33021;&#20351;&#29992;&#27492;&#26684;&#24335;&#12290;&#32178;&#22495;&#20013;&#27599;&#20491;&#21474;&#38598;&#30340; <code>GMS_LISTENER_PORT</code> &#29305;&#24615;&#20540;&#24517;&#38920;&#26159;&#21807;&#19968;&#30340;&#12290;</p>
<p>&#38364;&#37749;&#23383; <code>generate</code>&#12290;&#21482;&#26377;&#30070;&#27599;&#20491;&#20027;&#27231;&#19978;&#22343;&#22519;&#34892;&#21474;&#38598;&#20013;&#30340;&#19968;&#20491;&#23526;&#20363;&#26178;&#65292;&#25165;&#33021;&#20351;&#29992;&#27492;&#26684;&#24335;&#12290;&#30456;&#21516;&#20027;&#27231;&#19978;&#30340;&#22810;&#20491;&#23526;&#20363;&#19981;&#33021;&#26159;&#30456;&#21516;&#21474;&#38598;&#30340;&#25104;&#21729;&#12290;&#32178;&#22495;&#20013;&#27599;&#20491;&#21474;&#38598;&#30340; <code>GMS_LISTENER_PORT</code> &#29305;&#24615;&#20540;&#24517;&#38920;&#26159;&#21807;&#19968;&#30340;&#12290;</p>
<a id="sthref302" name="sthref302"></a>
<h5>&#31561;&#25928; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
