<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>&#26032;&#24314;&#21474;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992; &#12300;&#26032;&#24314;&#21474;&#38598;&#12301; &#38913;&#38754;&#21487;&#24314;&#31435;&#21474;&#38598;&#12290;</p>
<p>&#12300;&#26032;&#24314;&#21474;&#38598;&#12301; &#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#21474;&#38598;&#21517;&#31281;</dt>
<dd>
<p>&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#21517;&#31281;&#24517;&#38920;&#31526;&#21512;&#19979;&#21015;&#38656;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21517;&#31281;&#21482;&#33021;&#21253;&#21547; ASCII &#23383;&#20803;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#24517;&#38920;&#20197;&#23383;&#27597;&#12289;&#25976;&#23383;&#25110;&#24213;&#32218;&#28858;&#38283;&#38957;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#21482;&#33021;&#21253;&#21547;&#19979;&#21015;&#23383;&#20803;&#65306;</p>
<ul>
<li>
<p>&#23567;&#23531;&#23383;&#27597;</p>
</li>
<li>
<p>&#22823;&#23531;&#23383;&#27597;</p>
</li>
<li>
<p>&#25976;&#23383;</p>
</li>
<li>
<p>&#36899;&#23383;&#31526;</p>
</li>
<li>
<p>&#23567;&#25976;&#40670;&#34399;</p>
</li>
<li>
<p>&#24213;&#32218;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#31281;&#22312;&#32178;&#22495;&#20013;&#24517;&#38920;&#26159;&#21807;&#19968;&#30340;&#65292;&#19988;&#19981;&#24471;&#28858;&#21478;&#19968;&#20491;&#21474;&#38598;&#12289;&#24050;&#21629;&#21517;&#32068;&#24907;&#12289;GlassFish Server &#23526;&#20363;&#25110;&#31680;&#40670;&#30340;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#19981;&#24471;&#28858; <code>domain</code>&#12289;<code>server</code> &#25110; GlassFish Server &#25152;&#20445;&#30041;&#30340;&#20219;&#20309;&#20854;&#20182;&#38364;&#37749;&#23383;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#32068;&#24907;</dt>
<dd>
<p>&#21474;&#38598;&#21487;&#20197;&#20351;&#29992;&#20043;&#29694;&#26377;&#24050;&#21629;&#21517;&#32068;&#24907;&#30340;&#19979;&#25289;&#24335;&#28165;&#21934;&#12290;&#21474;&#38598;&#38656;&#35201;&#24050;&#21629;&#21517;&#32068;&#24907;&#65292;&#35442;&#32068;&#24907;&#26371;&#23450;&#32681;&#22686;&#21152;&#33267;&#21474;&#38598;&#20043;&#25152;&#26377;&#23526;&#20363;&#30340;&#32068;&#24907;&#12290;&#24744;&#24517;&#38920;&#24478;&#28165;&#21934;&#20013;&#36984;&#21462;&#19968;&#20491;&#32068;&#24907;&#12290;&#24314;&#31435;&#21474;&#38598;&#26178;&#65292;&#21474;&#38598;&#23559;&#20351;&#29992;&#25152;&#36984;&#21462;&#30340;&#32068;&#24907;&#12290;</p>
</dd>
<dt>&#35079;&#35069;&#36984;&#21462;&#30340;&#32068;&#24907;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#23601;&#26371;&#22312;&#24314;&#31435;&#21474;&#38598;&#26178;&#35079;&#35069;&#36984;&#21462;&#30340;&#32068;&#24907;&#12290;&#28858;&#32068;&#24907;&#21103;&#26412;&#25351;&#23450;&#30340;&#21517;&#31281;&#26159; <i>cluster-name</i><code>-config</code>&#65292;&#20854;&#20013; <i>cluster-name</i> &#26159;&#22312;&#12300;&#21474;&#38598;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#30340;&#21474;&#38598;&#21517;&#31281;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#24478; &#12300;&#32068;&#24907;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462; <code>default-config</code>&#65292;&#21063;&#24517;&#38920;&#36984;&#21462;&#27492;&#36984;&#38917;&#12290;<code>default-config</code> &#32068;&#24907;&#20677;&#21487;&#35079;&#35069;&#65292;&#28961;&#27861;&#21443;&#29031;&#12290;</p>
</dd>
<dt>&#21443;&#29031;&#36984;&#21462;&#30340;&#32068;&#24907;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21474;&#38598;&#23559;&#26371;&#20351;&#29992;&#25351;&#23450;&#30340;&#29694;&#26377;&#24050;&#21629;&#21517;&#32068;&#24907;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#24478; &#12300;&#32068;&#24907;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462; <code>default-config</code>&#65292;&#21063;<i>&#19981;&#33021;</i>&#36984;&#21462;&#27492;&#36984;&#38917;&#12290;<code>default-config</code> &#32068;&#24907;&#28961;&#27861;&#21443;&#29031;&#65292;&#20677;&#21487;&#35079;&#35069;&#12290;</p>
</dd>
<dt>&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#23526;&#20363;</dt>
<dd>
<p>&#21363;&#23559;&#22312;&#24314;&#31435;&#21474;&#38598;&#26178;&#24314;&#31435;&#30340; GlassFish Server &#23526;&#20363;&#28165;&#21934;&#12290;&#23565;&#26044;&#27599;&#20491;&#23526;&#20363;&#65292;&#22343;&#25552;&#20379;&#20197;&#19979;&#36039;&#35338;&#65306;</p>
<dl>
<dt>&#23526;&#20363;&#21517;&#31281;</dt>
<dd>
<p>&#23526;&#20363;&#30340;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#27402;&#25976;</dt>
<dd>
<p>&#19968;&#20491;&#25972;&#25976;&#65292;&#20195;&#34920;&#23526;&#20363;&#30340;&#36000;&#36617;&#24179;&#34913;&#27402;&#25976;&#12290;</p>
<p>&#36000;&#36617;&#24179;&#34913;&#27402;&#25976;&#21487;&#27770;&#23450;&#36865;&#33267;&#21474;&#38598;&#20379;&#23526;&#20363;&#34389;&#29702;&#20043;&#25152;&#26377;&#35531;&#27714;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#26377;&#20841;&#20491;&#23526;&#20363;&#30340;&#21474;&#38598;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#35731;&#20854;&#20013;&#19968;&#20491;&#23526;&#20363;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19968;&#20491;&#35531;&#27714;&#65292;&#32780;&#35731;&#21478;&#19968;&#20491;&#23526;&#20363;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19977;&#20491;&#35531;&#27714;&#12290;&#22312;&#36889;&#31278;&#24773;&#27841;&#19979;&#65292;&#21487;&#23559;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#20043;&#19968;&#20491;&#35531;&#27714;&#30340;&#23526;&#20363;&#27402;&#25976;&#35373;&#23450;&#28858; 1&#65292;&#23559;&#21478;&#19968;&#20491;&#23526;&#20363;&#27402;&#25976;&#35373;&#23450;&#28858; 3&#12290;&#22914;&#26524;&#24744;&#35201;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#35531;&#23559;&#36889;&#20841;&#20491;&#23526;&#20363;&#30340;&#27402;&#25976;&#20998;&#21029;&#35373;&#23450;&#28858; 25 &#33287; 75&#12290;</p>
<p>&#38928;&#35373;&#27402;&#25976;&#28858; 100&#12290;</p>
</dd>
<dt>&#31680;&#40670;</dt>
<dd>
<p>&#21487;&#23384;&#22312;&#23526;&#20363;&#20043;&#29694;&#26377;&#31680;&#40670;&#30340;&#19979;&#25289;&#24335;&#28165;&#21934;&#12290;&#24744;&#24517;&#38920;&#24478;&#28165;&#21934;&#20013;&#36984;&#21462;&#19968;&#20491;&#31680;&#40670;&#12290;&#24314;&#31435;&#21474;&#38598;&#26178;&#65292;&#23526;&#20363;&#23559;&#20301;&#26044;&#36984;&#21462;&#30340;&#31680;&#40670;&#19978;&#12290;</p>
</dd>
</dl>
<p>&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#23526;&#20363;&#34920;&#20063;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#24314;&#31435;&#23526;&#20363;&#30340;&#25353;&#37397;&#12290;&#25353;&#19968;&#19979;&#27492;&#25353;&#37397;&#21363;&#21487;&#22312;&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#23526;&#20363;&#34920;&#20013;&#22686;&#21152;&#19968;&#21015;&#12290;</p>
</dd>
<dt>&#21034;&#38500;</dt>
<dd>
<p>&#21034;&#38500;&#23526;&#20363;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<p><a href="task-create-cluster.html">&#24314;&#31435;&#21474;&#38598;</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>&#31561;&#25928; asadmin &#23376;&#21629;&#20196;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
