<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ejbcontaineravailability"></a><h4>EJB-Container-Verf&#252;gbarkeit</h4>
<a name="indexterm-13"></a><a name="indexterm-14"></a><p>Auf der Seite "EJB-Container-Verf&#252;gbarkeit" k&#246;nnen Sie Verf&#252;gbarkeitseinstellungen f&#252;r den EJB-Container konfigurieren.</p>

<p>Die Seite "EJB-Container-Verf&#252;gbarkeit" enth&#228;lt die folgenden Optionen.</p>

<dl><dt>Standardeinstellungen laden</dt>
<dd><p>Schaltfl&#228;che zum Wiederherstellen der Standardwerte f&#252;r Einstellungen, f&#252;r die es Standardwerte gibt. Einstellungen, die nicht &#252;ber Standardwerte verf&#252;gen, k&#246;nnen nicht ge&#228;ndert werden.</p>

</dd>
<dt>Name der Konfiguration</dt>
<dd><p>Der Name der Konfiguration, f&#252;r die die Einstellungen auf dieser Seite gelten. Dieses Feld ist schreibgesch&#252;tzt.</p>

</dd>
<dt>Verf&#252;gbarkeitsdienst</dt>
<dd><p>Wenn das Kontrollk&#228;stchen "Aktiviert" aktiviert ist, wird die Verf&#252;gbarkeit f&#252;r den EJB-Container aktiviert.</p>

</dd>
<dt>HA-Fortdauertyp</dt>
<dd><p>Der Fortdauermechanismums, der verwendet wird, wenn "Aktiviert" f&#252;r den Verf&#252;gbarkeitsdienst aktiviert ist. Der Standardwert lautet <tt>replicated</tt>, woraus die Fortdauer resultiert, die auf einem Failover in einem Cluster basiert. &#196;ndern Sie diesen Wert nicht.</p>

</dd>
<dt>SFSB-Fortdauertyp</dt>
<dd><p>Der Fortdauermechanismums, der verwendet wird, wenn "Aktiviert" f&#252;r den Verf&#252;gbarkeitsdienst <b>nicht</b> aktiviert ist. Der Standardwert lautet <tt>file</tt>, woraus die Fortdauer resultiert, die auf dem Dateisystem basiert. &#196;ndern Sie diesen Wert nicht.</p>

<p>Das Feld "Sitzungsspeicherort" bestimmt, wo SFSB-Fixpunktzust&#228;nde beibehalten werden. Informationen zum Sitzungsspeicherort finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2962&id=task-ejbgeneral">To Configure EJB Settings</a>.</p>

</dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>Weitere Eigenschaften f&#252;r die EJB-Container-Verf&#252;gbarkeit.</p>

<p>Bei GlassFish-Server sind keine weiteren Eigenschaften f&#252;r die Eigenschaften der EJB-Container-Verf&#252;gbarkeit definiert.</p>

</dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-ejbcontaineravailability.html">So konfigurieren Sie die Verf&#252;gbarkeitseinstellungen f&#252;r den EJB-Container</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2962&id=task-ejbgeneral">To Configure EJB Settings</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle und/oder verbundene Unternehmen. Alle Rechte vorbehalten. <a href="docinfo.html">Rechtlicher Hinweis</a></small>
