<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-orb"></a><h4>ORB</h4>
<a name="indexterm-8"></a><a name="indexterm-9"></a><p>Utilize a p&#225;gina ORB para configurar o Object Request Broker.</p>

<p>O ORB fornece a infraestrutura para identificar e localizar objetos, processar o
gerenciamento de conex&#245;es, entregar dados e solicitar comunica&#231;&#245;es. Clientes remotos de beans
empresariais (m&#243;dulos EJB) se comunicam com o Servidor GlassFish utilizando o ORB.</p>

<p>A p&#225;gina ORB cont&#233;m as op&#231;&#245;es a seguir.</p>

<dl><dt>Carregar Padr&#245;es</dt>
<dd><p>Bot&#227;o para restaurar os valores padr&#227;o de todas as configura&#231;&#245;es.</p>

</dd>
<dt>Nome da configura&#231;&#227;o</dt>
<dd><p>Nome da configura&#231;&#227;o ao qual as configura&#231;&#245;es desta p&#225;gina ser&#227;o enviadas. Este campo &#233; de somente leitura.</p>

</dd>
<dt>ID do conjunto de segmentos</dt>
<dd><p>O grupo de segmentos utilizado pelo ORB. O ORB utiliza grupos de segmentos para responder a solicita&#231;&#245;es de clientes remotos de beans empresariais e outros clientes que se comunicam utilizando RMI-IIOP. O grupo de segmentos padr&#227;o do ORB &#233; <tt>thread-pool-1</tt>, que utiliza padr&#245;es apropriados para solicita&#231;&#245;es RMI/IIOP.</p>

</dd>
<dt>Tamanho m&#225;x. do fragmento de mensagem</dt>
<dd><p>O tamanho m&#225;ximo di fragmento de mensagem para mensagens IIOP. As mensagens com tamanho maior do que o m&#225;ximo permitido s&#227;o fragmentadas. O valor padr&#227;o &#233; 1024 bytes.</p>

</dd>
<dt>Total de conex&#245;es</dt>
<dd><p>O n&#250;mero m&#225;ximo de conex&#245;es de entrada para todas as escutas de IIOP. O valor padr&#227;o &#233; 1024.</p>

</dd>
<dt>Autentica&#231;&#227;o do cliente IIOP</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Ativado estiver marcada, o servidor rejeita solicita&#231;&#245;es n&#227;o autenticadas e insere um bit autentica&#231;&#227;o-necess&#225;ria nas Refer&#234;ncias de Objeto Interoper&#225;veis (IORs) enviadas para clientes. A autentica&#231;&#227;o do cliente IIOP pode ser ativada ou desativada. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p>

</dd>
<dt>Propriedades adicionais</dt>
<dd><p>Propriedades adicionais do ORB. O Servidor GlassFish n&#227;o define propriedades adicionais para o ORB.</p>

</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-orb.html">Para configurar o ORB</a></p>

</li>
<li><p><a href="task-iioplistenernew.html">Para criar uma escuta de IIOP</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">Para editar uma escuta de IIOP</a></p>

</li>
<li><p><a href="task-editiiopssl.html">Para editar configura&#231;&#245;es de SSL para uma escuta de IIOP segura</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">Para excluir uma escuta de IIOP</a></p>

</li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-iiop-listener-1"><tt>create-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=list-iiop-listeners-1"><tt>list-iiop-listeners</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-iiop-listener-1"><tt>delete-iiop-listener</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=create-ssl-1"><tt>create-ssl</tt>(1)</a></p>

</li>
<li><p><a href="http://www.oracle.com/pls/topic/lookup?ctx=821-2433&id=delete-ssl-1"><tt>delete-ssl</tt>(1)</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
