<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009, 2010 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-editiiopssl"></a><h4>Para editar configura&#231;&#245;es de SSL para uma escuta de IIOP segura</h4><a name="indexterm-5"></a><a name="indexterm-6"></a><ol>
<li><b>No componente da &#225;rvore, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>No n&#243; Configura&#231;&#227;o, expanda o n&#243; ORB.</b></li>
<li><b>Selecione o n&#243; Escutas de IIOP.</b><p>A p&#225;gina Escutas de IIOP &#233; aberta.</p></li>
<li><b>Na tabela, clique no nome da escuta a ser editada.</b><p>A p&#225;gina Editar Escuta de IIOP &#233; aberta.</p></li>
<li><b>Se a caixa de sele&#231;&#227;o Seguran&#231;a ativa estiver marcada, clique no painel
com abas SSL para modificar as configura&#231;&#245;es de Camada de Soquete Seguro
dessa escuta de IIOP.</b><p>A p&#225;gina SSL &#233; exibida.</p></li>
<li><b>Na p&#225;gina SSL, marque a caixa de sele&#231;&#227;o SSL3 Ativa para ativar
SSL3.</b><p>A op&#231;&#227;o est&#225; ativada por padr&#227;o.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o TLS Ativa para ativar o Transport Layer
Security (TLS).</b><p>A op&#231;&#227;o est&#225; ativada por padr&#227;o.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Autentica&#231;&#227;o de cliente ativa para exigir que
os clientes se identifiquem para o servidor a cada solicita&#231;&#227;o.</b><p>A op&#231;&#227;o est&#225; desativada por padr&#227;o.</p></li>
<li><b>No campo Apelido do certificado, digite o apelido do certificado do servidor
no banco de dados do certificado ou no s&#237;mbolo PKCS#11.</b><p>No certificado, o formato do nome &#233; <tt><i> tokenname</i>:<i>nickname</i></tt>. Incluir a parte do
<tt><i>nome do s&#237;mbolo</i>: </tt> nesse atributo &#233; opcional. </p></li>
<li><b>No campo Armazenamento de chave, digite o nome do arquivo do armazenamento
de chave (por exemplo, <tt>keystore.jks</tt>).</b></li>
<li><b>No campo Algoritmo confi&#225;vel, digite o nome do algoritmo de gest&#227;o fiduci&#225;ria
(por exemplo, PKIX) para utilizar para valida&#231;&#227;o do caminho de certifica&#231;&#227;o.</b></li>
<li><b>No campo Comprimento m&#225;x. do certificado, digite o n&#250;mero m&#225;ximo de certificados
intermedi&#225;rios n&#227;o emitidos automaticamente, que podem existir em um caminho de certifica&#231;&#227;o.
</b><p>Esse campo &#233; utilizado apenas se o campo Algoritmo confi&#225;vel estiver definido
como PKIX. O valor 0 indica que o caminho pode conter somente
um certificado. O valor -1 indica que o comprimento do caminho n&#227;o
&#233;   restringido (n&#227;o existe m&#225;ximo). Definir um valor menor do
que -1 causa uma exce&#231;&#227;o a ser lan&#231;ada. </p></li>
<li><b>No campo Armazenamento confi&#225;vel, digite o nome do arquivo do armazenamento confi&#225;vel
(por exemplo, <tt>cacerts.jks</tt>).</b></li>
<li><b>Na &#225;rea Conjuntos codificados, especifique os conjuntos codificados a serem utilizados.</b><p>Se voc&#234; n&#227;o adicionar quaisquer conjuntos codificados, todos os conjuntos codificados ser&#227;o
utilizados.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-orb.html">Para configurar o ORB</a></p>

</li>
<li><p><a href="task-iioplistenernew.html">Para criar uma escuta de IIOP</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">Para editar uma escuta de IIOP</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">Para excluir uma escuta de IIOP</a></p>

</li></ul>


<small>Copyright &#169; 2010, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
