<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2011 Oracle and/or its affiliates. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-iioplistenernew"></a><h3>Para criar uma escuta de IIOP</h3><a name="indexterm-3"></a><ol>
<li><b>No componente da &#225;rvore, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Selecione a inst&#226;ncia que ser&#225; configurada:</b><ul>
<li><b>Para configurar uma inst&#226;ncia em particular, selecione o n&#243; de configura&#231;&#227;o da
inst&#226;ncia. Por exemplo, na inst&#226;ncia padr&#227;o, <tt>server</tt>, selecione o n&#243; <tt>server-config</tt>.</b></li>
<li><b>Para configura as defini&#231;&#245;es padr&#227;o das futuras inst&#226;ncias que utilizam uam c&#243;pia
de <tt>default-config</tt>, selecione o n&#243; <tt> default-config</tt>.</b></li></ul></li>
<li><b>No n&#243; Configura&#231;&#227;o, expanda o n&#243; ORB.</b></li>
<li><b>Selecione Escutas de IIOP.</b><p>A p&#225;gina Escutas de IIOP &#233; aberta.</p></li>
<li><b>Clique em Novo.</b></li>
<li><b>No campo Nome, digite um nome para identificar a escuta.</b></li>
<li><b>No campo Endere&#231;o de Rede, digite o endere&#231;o de rede da escuta.</b><p>Voc&#234; pode digitar uma endere&#231;o IP ou um nome de host resol&#250;vel
de DNS.</p></li>
<li><b>No campo Porta de escuta, digite o n&#250;mero da porta em que
a escuta de IIOP ser&#225; efetuada.</b></li>
<li><b>Marque a caixa de sele&#231;&#227;o Escuta ativa para ativar conex&#245;es de entrada
de IIOP do ORB com o Servidor GlassFish.</b><p>A op&#231;&#227;o est&#225; ativada por padr&#227;o.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Seguran&#231;a ativa para ativar SSL para a
escuta de IIOP.</b><p>A op&#231;&#227;o est&#225; desativada por padr&#227;o.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades adicionais, especifique as propriedades.</b><p>O Servidor GlassFish n&#227;o define propriedades adicionais para escutas de IIOP.</p><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p></li>
<li><b>Clique em OK.</b></li>
<li><b>Se voc&#234; marcou a caixa de sele&#231;&#227;o Seguran&#231;a ativa, siga as etapas
encontradas em <a href="task-editiiopssl.html">Para editar configura&#231;&#245;es de SSL para uma escuta de IIOP segura</a>.</b></li></ol><p></b>Consulte tamb&#233;m</b></p>
<ul><li><p><a href="task-orb.html">Para configurar o ORB</a></p>

</li>
<li><p><a href="task-iioplisteneredit.html">Para editar uma escuta de IIOP</a></p>

</li>
<li><p><a href="task-editiiopssl.html">Para editar configura&#231;&#245;es de SSL para uma escuta de IIOP segura</a></p>

</li>
<li><p><a href="task-iioplistenerdelete.html">Para excluir uma escuta de IIOP</a></p>

</li></ul>


<small>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu&#231;&#227;o total ou parcial. <a href="docinfo.html">Advert&#234;ncia legal</a></small>
