<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceconfigproperties" name="ref-clusterinstanceconfigproperties"></a><a id="GHCLU00010" name="GHCLU00010"></a></p>

<h4><a id="sthref283" name="sthref283"></a><a id="sthref284" name="sthref284"></a><a id="sthref285" name="sthref285"></a>Propriet&agrave; di sistema dell'istanza</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina Propriet&agrave; di sistema dell'istanza viene visualizzata una lista delle propriet&agrave; di sistema Java impostate per l'istanza di GlassFish Server corrente. Le propriet&agrave; di sistema Java vengono passate al launcher dell'applicazione Java tramite l'opzione <code>-D</code> del launcher stesso all'avvio di GlassFish Server.</p>
<p>Queste propriet&agrave; prevalgono sulle definizioni delle propriet&agrave; relative alle impostazioni delle porte, contenute nella configurazione dell'istanza. Le impostazioni predefinite per le porte devono essere ignorate se, ad esempio, due istanze in cluster risiedono nello stesso host. In questa situazione &egrave; necessario che le impostazioni delle porte per una delle istanze siano ignorate, perch&eacute; le due istanze condividono la stessa configurazione.</p>
<p>Per informazioni sulle impostazioni predefinite della porta in una configurazione, vedere <a href="../../../common/it/help/missingtopic.html">Predefined Configuration System Properties</a>.</p>
<p>Il campo Nome istanza &egrave; un campo di sola lettura in cui viene visualizzato il nome dell'istanza corrente.</p>
<p>Per ogni propriet&agrave; vengono visualizzate le seguenti informazioni:</p>
<dl>
<dt>Nome variabile istanza</dt>
<dd>
<p>Nome della propriet&agrave; di sistema.</p>
</dd>
<dt>Valore corrente</dt>
<dd>
<p>Valore attualmente impostato per la propriet&agrave;. Campo di sola lettura.</p>
</dd>
<dt>Valore di sostituzione</dt>
<dd>
<p>Valore su cui verr&agrave; impostata la propriet&agrave; dopo il salvataggio delle modifiche.</p>
</dd>
</dl>
<p>La tabella Propriet&agrave; aggiuntive contiene inoltre le seguenti opzioni.</p>
<dl>
<dt>Aggiungi propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di aggiungere una propriet&agrave;. Se si fa clic su questo pulsante, viene aggiunta una riga alla tabella Propriet&agrave; aggiuntive.</p>
</dd>
<dt>Elimina propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di eliminare una o pi&ugrave; propriet&agrave; selezionate. Quando una propriet&agrave; viene eliminata, viene ripristinato il rispettivo valore predefinito oppure, se non &egrave; specificato il valore predefinito, il valore resta non definito.</p>
</dd>
</dl>
<a id="sthref286" name="sthref286"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificare i numeri di porta di un'istanza di GlassFish Server in cluster</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">Impostare i valori predefiniti per le propriet&agrave; di sistema della configurazione</a></p>
</li>
</ul>
<a id="sthref287" name="sthref287"></a>
<h5>Comandi secondari equivalenti asadmin</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
