<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a><a id="GHCLU00026" name="GHCLU00026"></a></p>

<h4><a id="sthref354" name="sthref354"></a>Modifica Group Management Service</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina Group Management Service &egrave; possibile modificare le impostazioni GMS.</p>
<p>Il servizio GMS (Group Management Service) &egrave; un servizio in-process che offre monitoraggio del cluster, appartenenza del cluster e servizi di comunicazione di gruppo. Il servizio GMS &egrave; stato creato all'inizio di uno stack configurabile di protocolli di monitoraggio dell'integrit&agrave; e di individuazione di appartenenza al gruppo. Esegue le funzioni seguenti:</p>
<ul>
<li>
<p>Notifica ai moduli registrati in un'istanza di GlassFish Server l'aggiunta o la rimozione di una o pi&ugrave; istanze membro da un cluster oppure un errore sospetto o confermato di tali istanze.</p>
</li>
<li>
<p>Consente di inviare e ricevere messaggi tra processi di un gruppo.</p>
</li>
</ul>
<p>La pagina Group Management Service contiene le seguenti opzioni.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante che consente di ripristinare i valori predefiniti delle impostazioni che dispongono di tali valori. Le impostazioni prive di valori predefiniti restano invariate.</p>
</dd>
<dt>Nome configurazione</dt>
<dd>
<p>Nome della configurazione a cui si applicano le impostazioni presenti in questa pagina. Campo di sola lettura.</p>
</dd>
<dt>Numero massimo heartbeat mancati</dt>
<dd>
<p>Numero di tentativi di monitoraggio dopo i quali &egrave; probabile un errore dell'istanza del server. Il valore predefinito &egrave; 3.</p>
</dd>
<dt>Frequenza heartbeat</dt>
<dd>
<p>Intervallo di tempo che intercorre tra i tentativi di monitoraggio. Il valore predefinito &egrave; 2000 millisecondi.</p>
</dd>
<dt>Timeout di individuazione gruppo</dt>
<dd>
<p>Tempo di attesa del servizio GMS per l'individuazione di altri membri del cluster. Il valore predefinito &egrave; 5000 millisecondi.</p>
</dd>
<dt>Tempo di attesa verifica errore</dt>
<dd>
<p>Tempo dopo il quale un errore sospetto viene contrassegnato come verificato. Il valore predefinito &egrave; 1500 millisecondi.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Tabella di propriet&agrave; aggiuntive per il servizio GMS.</p>
<p>In GlassFish Server non &egrave; definita alcuna propriet&agrave; GMS aggiuntiva.</p>
<p>Per ogni propriet&agrave; vengono visualizzate le seguenti informazioni:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Nome della propriet&agrave;.</p>
</dd>
<dt>Valore</dt>
<dd>
<p>Il valore della propriet&agrave; &egrave; impostato per l'istanza selezionata.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>Descrizione testuale in cui sono riportate ulteriori informazioni sulla propriet&agrave;.</p>
</dd>
</dl>
<p>La tabella Propriet&agrave; aggiuntive contiene inoltre le seguenti opzioni.</p>
<dl>
<dt>Aggiungi propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di aggiungere una propriet&agrave;. Se si fa clic su questo pulsante, viene aggiunta una riga alla tabella Propriet&agrave; aggiuntive.</p>
</dd>
<dt>Elimina propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di eliminare una o pi&ugrave; propriet&agrave; selezionate. Quando una propriet&agrave; viene eliminata, viene ripristinato il rispettivo valore predefinito oppure, se non &egrave; specificato il valore predefinito, il valore resta non definito.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Abilitare GMS</a></p>
</li>
<li>
<p><a href="task-gms.html">Configurare GMS</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Configurare le impostazioni di GMS per un cluster</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
