<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-availabilityservice" name="ref-availabilityservice"></a><a id="GHCLU00025" name="GHCLU00025"></a></p>

<h4><a id="sthref352" name="sthref352"></a>Servizio disponibilit&agrave;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina Servizio disponibilit&agrave; &egrave; possibile modificare le impostazioni per un cluster.</p>
<p>La pagina Servizio disponibilit&agrave; contiene le seguenti opzioni.</p>
<dl>
<dt>Nome configurazione</dt>
<dd>
<p>Nome della configurazione a cui si applicano le impostazioni presenti in questa pagina. Campo di sola lettura.</p>
</dd>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante che consente di ripristinare i valori predefiniti delle impostazioni che dispongono di tali valori. Le impostazioni prive di valori predefiniti restano invariate.</p>
</dd>
<dt>Servizio disponibilit&agrave;</dt>
<dd>
<p>Se &egrave; selezionata la casella di controllo Abilitato, la disponibilit&agrave; &egrave; abilitata per il cluster. Questa opzione &egrave; selezionata per impostazione predefinita.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Tabella di propriet&agrave; aggiuntive per il servizio di disponibilit&agrave;.</p>
<p>In GlassFish Server non vengono definite propriet&agrave; aggiuntive per il servizio di disponibilit&agrave;.</p>
<p>Per ogni propriet&agrave; vengono visualizzate le seguenti informazioni:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Nome della propriet&agrave;.</p>
</dd>
<dt>Valore</dt>
<dd>
<p>Il valore della propriet&agrave; &egrave; impostato per l'istanza selezionata.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>Descrizione testuale in cui sono riportate ulteriori informazioni sulla propriet&agrave;.</p>
</dd>
</dl>
<p>La tabella Propriet&agrave; aggiuntive contiene inoltre le seguenti opzioni.</p>
<dl>
<dt>Aggiungi propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di aggiungere una propriet&agrave;. Se si fa clic su questo pulsante, viene aggiunta una riga alla tabella Propriet&agrave; aggiuntive.</p>
</dd>
<dt>Elimina propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di eliminare una o pi&ugrave; propriet&agrave; selezionate. Quando una propriet&agrave; viene eliminata, viene ripristinato il rispettivo valore predefinito oppure, se non &egrave; specificato il valore predefinito, il valore resta non definito.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref353" name="sthref353"></a>
<h5>Task correlati</h5>
<p><a href="task-availabilityservice.html">Configurare le impostazioni di disponibilit&agrave; per un cluster</a></p>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
